[
 ["一",[{"mnemonic":"Yoda lays a calm line of spaghetti on a plate in Italy, representing 'one.'","strategy":"Character: Yoda represents the initial 'y' in 'yī'.\nLocation: Italy is chosen for the final 'i' in 'yī'.\nTone: The action of laying a line of spaghetti is calm and steady, matching the first tone feature.\nMeaning: A single line of spaghetti on a plate visually symbolizes the number 'one'.\nVisual: The horizontal line of spaghetti mirrors the appearance of 一."},{"mnemonic":"Yoda balances a single straw in Italy, illustrating the simplicity of 'one.'","strategy":"Character: Yoda symbolizes the initial 'y'.\nLocation: Italy symbolizes the final 'i'.\nTone: Balancing is calm and steady, fitting the first tone.\nMeaning: A single straw on its own is 'one', demonstrating simplicity.\nVisual: The straw reflects the horizontal line of 一."},{"mnemonic":"Yoda draws a peaceful line in the sand in Italy, symbolizing 'one.'","strategy":"Character: Yoda embodies the initial 'y'.\nLocation: Italy connects to the final 'i'.\nTone: Drawing a line is a calm, steady motion, suitable for first tone.\nMeaning: A single line in the sand signifies the concept of 'one'.\nVisual: The line in the sand is analogous to 一."},{"mnemonic":"Yoda smooths a calm line of icing on a cake in Italy, signifying 'one.'","strategy":"Character: Yoda represents initial 'y'.\nLocation: Italy signifies final 'i'.\nTone: Smoothing icing is calm and horizontal, aligning with first tone.\nMeaning: A single line of icing shows the idea of 'one'.\nVisual: The single line of icing corresponds visually to 一."},{"mnemonic":"Yoda gently places a single brushstroke on a canvas in Italy, portraying 'one.'","strategy":"Character: Yoda is the symbol for initial 'y'.\nLocation: Italy symbolizes final 'i'.\nTone: Placing a brushstroke is steady, matching first tone.\nMeaning: A single brushstroke signifies the idea of 'one'.\nVisual: The brushstroke resembles 一 visually."}]],
 ["丨",[{"mnemonic":"David Attenborough takes a sharp turn down a steep valley to observe a line of animals.","strategy":"The character '丨' resembles a straight line, represented by David's sudden movement downwards in the valley."},{"mnemonic":"Attenborough swiftly points to a line of insects in the valley, marking their path.","strategy":"Pointing indicates a sudden action, leading back to the sharp fall of Tone 4 and the visual appearance of a line."},{"mnemonic":"In a sudden drop, David discovers a single line in the wilderness of the valley.","strategy":"The discovery reflects suddenness, with the valley's landscape providing a connection to the character's meaning."},{"mnemonic":"David Attenborough draws a quick line in the dirt of the valley as he narrates a story.","strategy":"Drawing a line visually represents the character, and the action is sudden, matching the falling tone."},{"mnemonic":"With a sharp breath, David points out the straight line made by the river in the valley.","strategy":"The falling action of sharp breathing accompanies the visual of a straight line, solidifying the character's meaning."}]],
 ["丶",[{"mnemonic":"Zorro leaves a dot on the leaves of the rainforest as he dips in and out of the jungle foliage.","strategy":"Zorro represents the initial 'z', the rainforest is the 'ü' final, and the action of dipping and rising depicts Tone 3."},{"mnemonic":"Zorro playfully dips into a rainforest stream, dropping dots of laughter as he bounces back to the surface.","strategy":"Associating Zorro with the action of 'dipping' fits the character's appearance and meaning."},{"mnemonic":"With a quick flick, Zorro draws a dot in the sand of the rainforest as he swings back and forth.","strategy":"The visual of Zorro's sword creating a dot signifies the character while connecting to the environment."},{"mnemonic":"Zorro dances in the rainforest, creating dotted patterns on the ground with his swirly movements.","strategy":"Integrating Zorro's characteristics with the tone and location provides a dynamic method to remember the meaning."},{"mnemonic":"Zorro zigzags around a rainforest, his path leaving dotted footprints as he rises and falls.","strategy":"This approach links Zorro’s movement style to the character's shape and meaning."}]],
 ["丿",[{"mnemonic":"Pocahontas swiftly slashes through the valley plants with her canoe paddle, creating a swift cut.","strategy":"Pocahontas symbolizes 'p', the valley represents the 'i', and the sudden action depicts Tone 4."},{"mnemonic":"With a sudden movement, Pocahontas slashes across the valley with her vibrant bow and arrow.","strategy":"Emphasizing her strong character enhances the interpretation of the slash action."},{"mnemonic":"Pocahontas springs into the valley and makes a sharp slash in the grass with her hand.","strategy":"The visual of a sharp slash aligns with the character shape and conveys its meaning."},{"mnemonic":"In a sudden motion, Pocahontas slices through the silent valley, leaving her mark behind.","strategy":"Creating a narrative around Pocahontas supports the sudden action of a slash."},{"mnemonic":"Pocahontas elegantly arcs her body in the valley, making a powerful slash movement in a bowing gesture.","strategy":"This mnemonic connects her gracefulness with the character's visual appearance."}]],
 ["乙",[{"mnemonic":"Yoda hovers gently above a serene valley to mark the order of second.","strategy":"Yoda represents the initial 'y' while the valley symbolizes the '-i' final. The hovering action reflects tone 5, and the meaning 'second' is encapsulated by Yoda being the wise guide in the series."},{"mnemonic":"Yoda gracefully pausing in a valley to signify being second.","strategy":"This maintains the initial and final associations, with a calm, light pause reflecting the neutral tone."},{"mnemonic":"Yoda skips lightly across the valley floor, indicating the second position.","strategy":"The imagery of Yoda combined with the gentle action still points to the desired tone and meaning."},{"mnemonic":"Yoda floats quietly in a peaceful valley to convey the second.","strategy":"Floating is another representation of the neutral action—combined with the environment and character meaning."},{"mnemonic":"Yoda lingers momentarily above the valley as a reminder of second.","strategy":"Lingering also suggests a light, fleeting motion that aligns with the neutral tone."}]],
 ["亅",[{"mnemonic":"Yoda drifts lightly across the desert, reminding of his second place.","strategy":"Yoda symbolizes the initial and the desert references the final, while the drifting action conveys the neutral tone."},{"mnemonic":"Yoda glides along the edge of the desert to signify he is second.","strategy":"Gliding exemplifies smooth movement, staying consistent with tone and meaning."},{"mnemonic":"Yoda floats gently above the sandy dunes, marking himself as second.","strategy":"Floating is light and matches the neutral tone while visually connecting with the meaning."},{"mnemonic":"Yoda skips softly through the desert landscape, indicating he’s second.","strategy":"Skipping is an energetic yet light action complementing the associations."},{"mnemonic":"Yoda hovers lightly over the desert sands, symbolizing second.","strategy":"Hovering aligns strongly with a gentle motion while reflecting the overall context."}]],
 ["二",[{"mnemonic":"Nemo darts through the savanna to signify the number two.","strategy":"Nemo symbolizes the 'n' initial and savanna reflects the final. The darting action conveys the light, neutral tone."},{"mnemonic":"Nemo swims quickly among the tall grasses of the savanna to show two.","strategy":"The imagery combines movement and environment coherently while addressing the meaning."},{"mnemonic":"Nemo wades through the savanna grass, symbolizing the number two.","strategy":"Wading creates a smooth visual connection while remaining light."},{"mnemonic":"Nemo lightly hops through the savanna, marking the count of two.","strategy":"Hopping maintains an image of liveliness but adheres to a light, neutral action."},{"mnemonic":"Nemo swims gently around savanna puddles, denoting the number two.","strategy":"This whimsical take gives image-heavy associations that support the mnemonic."}]],
 ["亠",[{"mnemonic":"Tarzan swings lightly above the desert, reminding us of a lid.","strategy":"Tarzan portrays the 't' initial while the desert functions as the final, with swinging illustrating a light, neutral action."},{"mnemonic":"Tarzan glides softly through the arid desert, representing the lid.","strategy":"Gliding verifies movement yet retains the lightness required for the tone."},{"mnemonic":"Tarzan hops gently over the sandy desert dunes, marking the concept of a lid.","strategy":"Hopping stays consistent with the light and fleeting idea while visualizing the meaning."},{"mnemonic":"Tarzan sways chaotically in the desert breeze, illustrating a lid.","strategy":"Swaying conveys a neutral movement while integrating with the overall context."},{"mnemonic":"Tarzan lightly strolls through the desert to denote the shape of a lid.","strategy":"Strolling presents a serene image that aligns with tone and meaning."}]],
 ["人",[{"mnemonic":"Robin Hood strolls gently across the sparkling glacier to represent humanity.","strategy":"Robin Hood represents 'r', and the glacier portrays the '-e' final, with a gentle stroll depicting the neutral tone."},{"mnemonic":"Robin Hood glides softly over the surface of the glacier, symbolizing human essence.","strategy":"Gliding holds a serene image supporting light actions and connections to meaning."},{"mnemonic":"Robin Hood skips lightly on the glacier, embodying human qualities.","strategy":"Skipping expresses liveliness while keeping the actions neutral and light."},{"mnemonic":"Robin Hood glances over the glacier, indicating the beauty of humans.","strategy":"The glancing action remains light and meaningful while tying back to the overall theme."},{"mnemonic":"Robin Hood whispers softly on the glacier, reminding us of what is human.","strategy":"Whispering is gentle and fleeting, reinforcing neutral tone and meaning."}]],
 ["儿",[{"mnemonic":"Robin Hood lightly rides a riverbend, symbolizing the innocence of a child.","strategy":"Robin Hood captures the initial while riverbend represents the final. Riding expresses light action associated with the tone."},{"mnemonic":"Robin Hood frolics softly at the riverbend, embodying childhood spirit.","strategy":"Frolicking provides a buoyant essence aligned with childlike energy."},{"mnemonic":"Robin Hood plays gently near the riverbend, representing a child's nature.","strategy":"Playing suffuses innocence while fitting well with the meaning."},{"mnemonic":"Robin Hood weaves through the riverbend, signifying youthful carefree spirit.","strategy":"Weaving encompasses freedom and lightness while emphasizing childhood."},{"mnemonic":"Robin Hood glides easily across the riverbend, indicating the essence of a child.","strategy":"Gliding remains a gentle movement illustrating childlike freedom."}]],
 ["入",[{"mnemonic":"Robin Hood dramatically leaps into the desert, emphasizing the action of entering.","strategy":"This connects Robin Hood to 'r', the desert as '-u', with a falling action signifying the tone."},{"mnemonic":"Robin Hood dives sharply into the sandy desert, illustrating the act of entering.","strategy":"Diving effectively remains sharp, matching the tone while drawing upon the meaning."},{"mnemonic":"Robin Hood plunges ruthlessly into the endless desert, indicating movement into.","strategy":"Plunging fits the action necessary to depict the sharp entrance associated with tone 4."},{"mnemonic":"Robin Hood drops into the desert landscape, showcasing the concept of entering.","strategy":"Dropping invokes a sudden action while fulfilling the required associations."},{"mnemonic":"Robin Hood falls into the sneaky dunes of the desert, reflecting the entrance action.","strategy":"Falling maintains the motion's sharpness when entering with clear imagery."}]],
 ["八",[{"mnemonic":"Imagine Bilbo Baggins standing in the savanna and suddenly plunging down as he counts to eight.","strategy":"Bilbo represents 'b', the savanna stands for the 'a', and the sharp downward action embodies tone 4."},{"mnemonic":"Visualize Bilbo quickly darting down in the savanna to find eight treasures buried underground.","strategy":"Bilbo is the initial 'b', the savanna is the final 'a', and the action of darting down represents tone 4."},{"mnemonic":"Picture Bilbo in the savanna, shouting 'eight!' as he dives down to avoid a herd of wildebeests.","strategy":"Bilbo is used for 'b', savanna symbolizes 'a', and the diving action captures the sharpness of tone 4."},{"mnemonic":"Envision Bilbo standing confidently in the savanna, then suddenly bending low to the ground, counting to eight.","strategy":"Bilbo symbolizes initial 'b', the savanna is final 'a', and the action of bending low signifies the dynamic of tone 4."},{"mnemonic":"Imagine Bilbo shouting 'eight!' in the savanna when an eagle swoops down suddenly.","strategy":"Bilbo represents the initial 'b', savanna is for the final 'a', and the sudden action reflects the sharpness of tone 4."}]],
 ["冂",[{"mnemonic":"Imagine Moana lightly hopping on the edge of an upside-down box near the base of a volcano, skipping lightly.","strategy":"Moana represents 'm', volcano symbolizes 'o', and the skipping motion captures the neutral tone 5."},{"mnemonic":"Visualize Moana playfully balancing on an upside-down box as the volcano gently smokes in the background.","strategy":"Moana is the initial 'm', the volcano is 'o', while the playful balancing reflects the lightness of tone 5."},{"mnemonic":"See Moana hovering above an upside-down box near a volcano, occasionally skipping in delight as smoke drifts.","strategy":"Here, Moana stands for 'm', the volcano is for 'o', and hovering action reflects tone 5's neutrality."},{"mnemonic":"Picture Moana gently bouncing on an upside-down box at a volcanic beach, feeling relaxed and carefree.","strategy":"In this mnemonic, Moana represents 'm', the volcano is 'o', and the gentle bouncing captures the neutral essence of tone 5."},{"mnemonic":"Envision Moana lightly skipping over an upside-down box beside a serene volcano, enjoying the gentle atmosphere.","strategy":"Moana signifies 'm', where the volcano serves as 'o', and the skipping action conveys the fleeting nature of tone 5."}]],
 ["冖",[{"mnemonic":"Imagine Frodo climbing a glacier, reaching up to cover a cold spot with his cloak, feeling the ascent.","strategy":"Frodo symbolizes 'f', glacier represents 'e', and the upward action captures the essence of rising tone 2."},{"mnemonic":"Visualize Frodo standing on a glacier, lifting his hand to cover the sun's rays as he rises higher.","strategy":"Here, Frodo stands for 'f', the glacier represents final 'e', and the upward motion reflects the rising nature of tone 2."},{"mnemonic":"Picture Frodo walking up a glacier, smiling as he covers his eyes from the bright light shining below.","strategy":"Frodo for 'f', glacier for 'e', with the action illustrating the uplifting ascent linked to tone 2."},{"mnemonic":"See Frodo joyfully rising on a glacier, wrapping his cloak tighter around himself to cover from the cold wind.","strategy":"This mnemonic uses Frodo for 'f', glacier symbolizes 'e', and the rising action embodies tone 2's uplifting nature."},{"mnemonic":"Envision Frodo reaching the top of a glacier and covering himself with a blanket as he basks in the sunlight.","strategy":"Frodo represents 'f', glacier represents final 'e', and the rising action of reaching captures tone 2."}]],
 ["冫",[{"mnemonic":"Imagine David Attenborough climbing up a mountain and suddenly slipping, causing a sharp fall into a pile of ice.","strategy":"David is for 'd', mountain represents the final 'eng', and the fall represents the sharpness of tone 4."},{"mnemonic":"Visualize David scaling a mountain, then rapidly plunging down to land in a massive ice formation.","strategy":"David Attenborough symbolizes 'd', mountain is 'eng', and the sharp plunge conveys the action of tone 4."},{"mnemonic":"Picture David Attenborough narrating a documentary on the mountain, and then he sharply drops down to the ice below.","strategy":"This mnemonic features David for 'd', mountain signifies 'eng', while the action of dropping matches tone 4."},{"mnemonic":"See David standing at the mountain peak, then suddenly rolling down sharply into a frozen ice cave.","strategy":"Here, David represents initial 'd', mountain for static 'eng', with the downward roll embodying tone 4."},{"mnemonic":"Picture David Attenborough announcing his findings about the icy mountain as he suddenly falls to interact with the ice.","strategy":"In this mnemonic, David symbolizes 'd', mountain represents 'eng', and the action of falling captures the sharpness of tone 4."}]],
 ["几",[{"mnemonic":"Imagine Jane Goodall counting monkeys in a valley, her hands dipping and rising as she holds up fingers to show how many.","strategy":"Anchors Jane Goodall for the 'j' initial and a valley for the 'i' final, while her dipping and rising hands visually represent the fall-rise tone."},{"mnemonic":"Picture Jane in a valley, her voice rising and falling as she asks how many animals there are around her.","strategy":"Uses the character of Jane and the valley while the action of her voice matches the tone characteristics."},{"mnemonic":"See Jane surrounded by a valley of animals, each time she counts, she does a slight dip and rise.","strategy":"This combines the initial 'j', the location 'i', and represents the tone with a physical action."},{"mnemonic":"Visualize Jane observing creatures in a valley, her fingers dancing up and down to count them.","strategy":"Associates Jane and the valley while the finger motions visualize the fall-rise tone."},{"mnemonic":"Imagine Jane giving a lecture in a valley, her voice fluctuating as she talks about several species.","strategy":"Connects Jane and the valley, while connecting her speech tone to the character's meaning."}]],
 ["凵",[{"mnemonic":"Picture Quasimodo holding a circular container filled with water that suddenly tips, splashing all around in the wetlands.","strategy":"Utilizes Quasimodo for the 'q' initial and wetlands for the 'an' final, while the action captures the tone characteristics of sharpness."},{"mnemonic":"See Quasimodo making a sudden move to hold water in his cupped hands in the wetlands.","strategy":"Combines Quasimodo's character, the wetlands setting, and the sudden action to express the tone."},{"mnemonic":"Visualize Quasimodo with an overflowing container in the wetlands, suddenly tilting it to hold back the flood.","strategy":"Links the character, location, and an abrupt action reflecting the fall tone."},{"mnemonic":"Imagine Quasimodo cautiously balancing a bucket in the wetlands, only to let it drop suddenly.","strategy":"Associates the character and environment while illustrating the sharpness of tone through action."},{"mnemonic":"Picture Quasimodo quickly capturing a fish in his hands in the wetlands, the action being sharp and sudden.","strategy":"Mentions the initial and location and uses a sudden action to reflect the meaning."}]],
 ["刀",[{"mnemonic":"Imagine David Attenborough dramatically slicing through the air with a knife near a towering waterfall.","strategy":"Ties David to the 'd' initial and the waterfall to 'ao', while the action captures the sharpness of tone."},{"mnemonic":"Picture David across a stunning waterfall, wielding a knife to cut through vines suddenly.","strategy":"Combines the character and location with a sudden action reflective of the falling tone."},{"mnemonic":"See David demonstrating a knife's sharp edge as water crashes down a waterfall behind him.","strategy":"Links the initial with an action of showcasing a knife, maintaining the falling tone with the waterfall's movement."},{"mnemonic":"Visualize David carefully carving something near the edge of a waterfall, his movements quick and precise.","strategy":"Connects David and the waterfall while his quick motions illustrate the sharpness of the tone."},{"mnemonic":"Imagine David slashing the air with a knife as the force of water falls in a waterfall nearby.","strategy":"Associates the character and environment with a sharp action representing the meaning."}]],
 ["力",[{"mnemonic":"Legolas stands strong at the edge of a valley, ready to shoot an arrow with sudden force.","strategy":"Legolas represents 'l', the valley represents '-i', and the sudden action reflects Tone 4, emphasizing strength."},{"mnemonic":"Legolas leaps down into a valley, showcasing his power in a sudden fall.","strategy":"The leap connects 'l' with 'valley' and the quick descent reflects Tone 4, symbolizing strength."},{"mnemonic":"As Legolas runs through the valley, he stops sharply, demonstrating his strength.","strategy":"Running through the valley integrates the characteristics, while the sudden stop highlights the tone."},{"mnemonic":"Legolas trains vigorously in the valley, his agility and strength making a strong impression.","strategy":"Training in the valley combines the character traits, emphasizing strength with a vivid visual."},{"mnemonic":"Legolas uses his bow in the valley, showcasing sudden strength as he releases the arrow.","strategy":"Using the bow connects both the visual and meaning, with an action representing Tone 4."}]],
 ["勹",[{"mnemonic":"Bilbo Baggins wraps a gift as he climbs up to the top of a waterfall, a joyous expression on his face.","strategy":"Bilbo represents 'b', the waterfall shows the environment '-ao', with the uplifted action denoting Tone 2."},{"mnemonic":"Bilbo excitedly wraps a treasure while rising towards a majestic waterfall.","strategy":"The wrapping connects to the meaning, while the rise matches Tone 2."},{"mnemonic":"As Bilbo joyfully ties the ribbon around the gift, he ascends toward a sparkling waterfall.","strategy":"Tying represents the action of wrapping, and ascending reflects the rising tone."},{"mnemonic":"Bilbo floats up a waterfall with a wrapped package, his face glowing with excitement.","strategy":"The floating motion portrays Tone 2, while the wrapped package conveys the character's meaning."},{"mnemonic":"Bilbo skillfully wraps a precious item, rising eagerly to the waterfall just ahead.","strategy":"The act of wrapping aligns with the meaning, and the rising element highlights Tone 2."}]],
 ["匕",[{"mnemonic":"David Attenborough swiftly dives into the valley holding a sharp dagger.","strategy":"David represents 'd', the valley connects to '-i', and the dive encapsulates the sharp, sudden action of Tone 4."},{"mnemonic":"As David explores the valley, he sharply brandishes a dagger to showcase excitement.","strategy":"Brandishing the dagger represents the meaning, with the sharp action reflecting Tone 4."},{"mnemonic":"David Attenborough gazes down into the valley, gripping his dagger with a sharp expression.","strategy":"The visual of gripping and the valley connects meaning and tone with a fall-action."},{"mnemonic":"While in the valley, David announces a sudden discovery, pulling out a dagger dramatically.","strategy":"The sudden pull translates to Tone 4, while the valley location illustrates the character's context."},{"mnemonic":"David skillfully navigates the valley, his dagger gleaming sharply amidst the lush landscape.","strategy":"Navigating the valley ties it all together, with a gleaming dagger symbolizing the meaning."}]],
 ["匚",[{"mnemonic":"Frodo dips into a box found near a volcano crater, his eyes large with curiosity.","strategy":"Frodo represents 'f', the volcano crater connects to '-ang', and the dipping action signifies the fall-rise nature of Tone 3."},{"mnemonic":"With a brave heart, Frodo lowers himself to peek into a box at the edge of the volcano crater.","strategy":"Peeking into the box symbolizes the meaning, with a motion that embodies Tone 3."},{"mnemonic":"Frodo carefully retrieves a small box from the edges of a volcano crater, dipping again to avoid the heat.","strategy":"The retrieval is a visual cue for the meaning, with the action denoting the fall-rise tone."},{"mnemonic":"Standing at the volcano's edge, Frodo opens a box, his face revealing a mixture of thrill and caution.","strategy":"Opening the box represents the meaning, while the volcanic context aligns with the character."},{"mnemonic":"Frodo bends down to check for treasures within a box sitting at the volcano crater's entrance.","strategy":"Bending down signifies the action and fall, while the box captures the essence of its meaning."}]],
 ["匸",[{"mnemonic":"Xena climbs up a cliffside, deftly hiding her weapon to conceal her next move.","strategy":"Xena embodies 'x', the cliffside connects to '-ie', and the climbing action signifies Tone 2."},{"mnemonic":"As Xena scales the cliffside, she hides her sword behind a rock, rising with stealth.","strategy":"Scaling represents the climbing action, emphasizing the meaning of concealment."},{"mnemonic":"Xena, on the cliffs, swiftly conceals her dagger within her armor while feeling the thrill of ascent.","strategy":"Concealing the dagger represents the meaning, while her ascent highlights the rising tone."},{"mnemonic":"Atop the cliffside, Xena cautiously tucks her weapon away, smiling as she enjoys the view.","strategy":"The visual of tucking away reflects the tone and meaning harmoniously."},{"mnemonic":"Xena rises atop a rocky cliff, her concealed weapons hidden cleverly among the wild plants.","strategy":"The placement of her weapons encapsulates the meaning, alongside the climbing action showing the tone."}]],
 ["十",[{"mnemonic":"Imagine Shrek climbing up a valley while counting ten vibrant green ogres.","strategy":"Shrek represents the initial 'sh', the valley stands for the '-i' final, the rising action of climbing represents tone 2, and it visually appears like the shape of the character."},{"mnemonic":"Shrek joyfully hops upward in the valley, using ten colorful balloons.","strategy":"The joyful and rising action denotes the tone, while the colorful balloons help visualize the concept of 'ten' in a fun way."},{"mnemonic":"Picture Shrek ascending the valley slope while repeatedly shouting 'ten!' as he counts.","strategy":"The action of ascending signifies tone 2, with Shrek representing the initial, the valley for the final, and reinforces the meaning with a counting action."},{"mnemonic":"Visualize Shrek smiling as he rises above the valley while stacking ten rocks.","strategy":"Shrek represents 'sh', the valley is for the final '-i', the stacking action reflects the tone, and the image solidifies the meaning of 'ten'."},{"mnemonic":"Shrek is seen cheerfully flying up a valley filled with balloons shaped like the number ten.","strategy":"This combines the initial 'sh', the final '-i', and the uplifting action fits the tone perfectly with the visual representation of 'ten'."}]],
 ["卜",[{"mnemonic":"Imagine Bilbo Baggins digging down into the desert to find ancient runes for divination.","strategy":"Bilbo represents the 'b', the desert for the final '-u', the digging action captures the falling tone, and it relates to the meaning of divination."},{"mnemonic":"Visualize Bilbo sharply dropping a precious gemstone into the desert to reveal its secrets.","strategy":"The sharp dropping action symbolizes tone 4, while Bilbo illustrates the initial and desert corresponds to the final, linking to divination."},{"mnemonic":"Bilbo is abruptly pulling a treasure map from the desert's sand, predicting the treasure's location.","strategy":"The action of pulling reflects the sharp nature of tone 4, with Bilbo as the initial and the desert solidifying the meaning of divination."},{"mnemonic":"Arrange ten stones with Bilbo over them before he dramatically drops them into the desert.","strategy":"The arrangement reflects his initial, the dropping of stones portrays the falling tone, and the desert connects the environment to the meaning."},{"mnemonic":"Picture Bilbo gazing into a deep crack in the desert, foretelling the future from its depths.","strategy":"The gaze downwards conveys tone 4, Bilbo is the person for 'b', desert is the location, all tying together to represent divination."}]],
 ["卩",[{"mnemonic":"Imagine Jane Goodall casually stamping her foot in a valley to make friends with animals.","strategy":"Jane represents 'j', the valley for '-ie', the gentle stamping action symbolizes the neutral tone, and it relates to the concept of a stamp."},{"mnemonic":"Visualize Jane lightly skipping around a valley, leaving her animal-shaped stamps behind.","strategy":"The skipping action conveys a light tone, with Jane as the initial and the valley connecting to the meaning of a seal or stamp."},{"mnemonic":"Picture Jane resting in a valley, occasionally making light impressions with her stamp of approval.","strategy":"The resting motion symbolizes tone 5, with Jane for initial, valley for final, while the act connects to the character's meaning."},{"mnemonic":"Jane is hovering in the valley, creating light impressions of animal footprints as stamps.","strategy":"The energy of hovering matches tone 5, while Jane represents the initial and the valley aligns with the ambiance of the meaning."},{"mnemonic":"See Jane lounging peacefully in the valley, occasionally marking her pinky stamp on the ground.","strategy":"The calming presence and marking action reflects tone 5, with the valley and Jane connecting directly to the seal/stamp meaning."}]],
 ["厂",[{"mnemonic":"Visualize Hagrid suddenly building a workshop in the wetlands with giant tools.","strategy":"Hagrid signifies the initial 'h', the wetlands work as the final '-an', and the sharp building action embodies the falling tone."},{"mnemonic":"Imagine Hagrid abruptly cutting down a tree to make space for his factory in the wetlands.","strategy":"This sudden action reflects tone 4, with Hagrid's initial representation and wetlands integrating to symbolize a factory."},{"mnemonic":"Hagrid is seen crashing down in the wetlands, establishing a workshop for magical creatures.","strategy":"The act of crashing ties to the falling tone, while Hagrid represents 'h' and wetlands illustrate the environment related to the meaning."},{"mnemonic":"Picture Hagrid swiftly moving to create a wetland factory, his actions timed perfectly.","strategy":"Swift movements represent tone with Hagrid as initial and wetlands completing the picture connected to workshop or factory."},{"mnemonic":"Hagrid sharply executes a plan to craft a big workshop amidst the serene wetlands.","strategy":"The execution of the plan reflects tone 4, Hagrid stands for 'h', and wetlands round out the imagery for factory or workshop."}]],
 ["厶",[{"mnemonic":"Imagine Moana sailing peacefully through a quiet valley, where she reveals secret treasures.","strategy":"Moana represents the initial 'm', the valley is the environment represented by 'i', and her calm sailing illustrates the neutral tone while conveying the meaning of a private area."},{"mnemonic":"Moana whispers a secret to her turtle friend in a serene valley.","strategy":"Moana continues to embody the initial, while the valley establishes the environment, and the whisper highlights the light action associated with the tone."},{"mnemonic":"In a tranquil valley, Moana hides her necklace, a private treasure.","strategy":"Moana signifies 'm', the valley depicts 'i', and the act of hiding aligns with 'private', promoting the hidden aspect."},{"mnemonic":"Moana explores a lush valley, guarding a private cove.","strategy":"Moana serves as the character for 'm', the valley as the setting, and her guarding behavior illustrates the secretive meaning."},{"mnemonic":"Moana shares soft songs about her personal adventures in a peaceful valley.","strategy":"Moana is the initial reference, the valley represents the final, and the act of sharing softly suggests a private interaction."}]],
 ["又",[{"mnemonic":"Yoda gracefully jumps over a canyon, saying 'Again!' as he demonstrates his agility.","strategy":"Yoda for 'y' as the initial, the canyon for 'ou', and the rising motion of jumping shows the uplifting tone while conveying the meaning 'again.'"},{"mnemonic":"Yoda lifts his hand to raise a stone from the canyon, repeating his action.","strategy":"Yoda represents 'y', the canyon is the final, and lifting the stone captures the rising tone and the concept of doing something again."},{"mnemonic":"Yoda walks back to the canyon, exclaiming, 'Let's do this again!'","strategy":"Yoda stands for 'y', the canyon illustrates 'ou', and the phrase signifies repetition or 'again'."},{"mnemonic":"Yoda uses the Force to bring another item from the canyon, proving he does it again.","strategy":"This connects 'y' for Yoda, the 'ou' canyon, while the action highlights the meaning of 'again'."},{"mnemonic":"At the edge of the canyon, Yoda teaches, 'To learn again, you must return!'","strategy":"Yoda is 'y', the canyon is 'ou', with the teaching aspect embodying the idea of repetition."}]],
 ["口",[{"mnemonic":"King Kong opens his mouth wide while roaring at the edge of a canyon.","strategy":"King Kong as 'k', the canyon as 'ou', and the sharp roar signifies the falling tone, emphasizing the meaning of an opening (mouth)."},{"mnemonic":"King Kong yells down into the canyon, demonstrating the power of his mouth.","strategy":"King Kong embodies the initial, the canyon depicts the final, and the act of yelling shows a sharp, sudden action representing the tone."},{"mnemonic":"Standing proudly at the canyon, King Kong opens his mouth, ready to eat a huge meal.","strategy":"This reflects King Kong for 'k', the canyon for 'ou', with the mouth-opening action illustrating both the meaning and tone."},{"mnemonic":"King Kong lets out a furious roar that echoes throughout the canyon, emphasizing his immense mouth.","strategy":"King Kong stands for the initial, the canyon is the place, and the furious roar indicates the falling tone while supporting the meaning regarding the mouth."},{"mnemonic":"At the canyon's edge, King Kong dramatically opens his mouth, showcasing his intimidating power.","strategy":"King Kong covers 'k', the canyon relates to 'ou', and the dramatic opening signifies a sharp action correlating with the meaning of 'mouth'."}]],
 ["囗",[{"mnemonic":"Wonder Woman quickly surrounds a volcano with her lasso, creating a boundary.","strategy":"Wonder Woman embodies 'w', the volcano is the environment connected to 'o'. The sudden action hints at the tone while depicting an enclosure."},{"mnemonic":"Wonder Woman draws a circle around the volcano, establishing a secure boundary.","strategy":"This integrates Wonder Woman for 'w', the volcano for 'o', and the circle illustrates the sudden action corresponding to the meaning of enclosure."},{"mnemonic":"In a flash, Wonder Woman traps the erupting volcano with a wall of energy.","strategy":"Wonder Woman represents 'w', the volcano portrays 'o', and trapping presents a sharp action emphasizing the meaning of a boundary."},{"mnemonic":"Wonder Woman, with quick precision, creates a ring of protection around the volcano.","strategy":"Wonder Woman is 'w', the volcano symbolizes 'o', and her protection denotes the sudden action while reflecting the meaning of enclosure."},{"mnemonic":"With authority, Wonder Woman encircles the volcano to prevent eruptions across the boundary.","strategy":"Wonder Woman captures 'w', the volcano encodes 'o', and the authoritative action supplies the tone reflecting the meaning concerning the enclosure."}]],
 ["土",[{"mnemonic":"Tarzan jumps down from a tree, landing on the desert soil with a thud.","strategy":"Tarzan represents 't', the desert for 'u', and the falling action of landing emphasizes the meaning of earth while capturing the tone."},{"mnemonic":"Tarzan digs into the desert ground with his bare hands, revealing rich soil.","strategy":"This uses Tarzan for 't', the desert as 'u', and the digging shows a sharp action reflecting earth and soil."},{"mnemonic":"In the harsh desert, Tarzan feels the dry soil with his feet, showcasing its texture.","strategy":"Tarzan captures the initial, the desert represents the final, and the act of feeling shows the falling tone while expressing the meaning of soil."},{"mnemonic":"As Tarzan gracefully swings down, he lands on the soft earth of the desert.","strategy":"Tarzan stands for 't', the desert is 'u', and the action of landing showcases falling dynamics while embodying the meaning."},{"mnemonic":"Tarzan collects desert earth to create a protective barrier around his village.","strategy":"Tarzan symbolizes 't', the desert highlights 'u', and the act of collecting earth indicates a sharp action relevant to the meaning of soil."}]],
 ["士",[{"mnemonic":"Simba climbs to the top of the valley and suddenly roars like a mighty warrior, showing his strength.","strategy":"Simba represents the initial 's' and the valley represents the final '-i'. The action of roaring indicates the sharp, downward tone (Tone 4), and the meaning relates to a warrior or leader."},{"mnemonic":"Simba surveys the valley, and with a sudden leap, he demonstrates his command as a scholar of the savanna.","strategy":"The sudden leap symbolizes the downward tone and connects with the idea of a commanding presence of a scholar/warrior."},{"mnemonic":"Simba pounces down the valley, striking like a fierce warrior.","strategy":"The action of pouncing illustrates the falling tone and embodies the character's meaning."},{"mnemonic":"Simba stands tall at the edge of the valley, before dramatically falling into a warrior stance.","strategy":"The visual imagery of falling into a warrior stance conveys both the tone and meaning effectively."},{"mnemonic":"Simba gracefully drops into the valley, channeling the strength of a warrior.","strategy":"The graceful drop relates to the tone while enhancing the representation of strength and meaning."}]],
 ["夂",[{"mnemonic":"Zorro rides his horse down into the valley, dips to the ground, and then springs up to strike with his sword, stopping all foes.","strategy":"Zorro represents 'z' and the valley symbolizes '-i'. The action of dipping and rising corresponds to Tone 3, while the meaning of stopping is embodied in Zorro's action."},{"mnemonic":"Zorro appears at the valley entrance, quick to drop down and then rise to halt the enemy's advance.","strategy":"The quick drop and rise embodies the meaning and matches the tone perfectly."},{"mnemonic":"Zorro stops suddenly in the valley, his cape swirling as he dips then rises to face off against villains.","strategy":"This visual creates both tone and meaning through the dramatic motion."},{"mnemonic":"With a sudden dip into the valley, Zorro halts, ready to fight.","strategy":"The immediate action of dipping reflects the tone, coupled with a clear representation of the meaning."},{"mnemonic":"Zorro dances down into the valley, pausing sharply before taking a decisive action.","strategy":"The dance correlates with the tone variety while the purpose of stopping highlights the character's meaning."}]],
 ["夊",[{"mnemonic":"Simba climbs up a sandy dune in the desert, rising gradually before stopping for a refreshing drink.","strategy":"Simba stands for 's' and the desert depicts '-u'. The action of climbing represents the rising tone, and the stopping depicts the meaning."},{"mnemonic":"In the desert, Simba ascends the plateau, pausing at the top to survey his territory.","strategy":"The pausing at the peak enhances the representation of stopping, while climbing complements the tone."},{"mnemonic":"Simba rises smoothly up the desert hill, finally halting under a palm tree for shade.","strategy":"This imagery combines upward movement and the act of stopping to portray both tone and meaning."},{"mnemonic":"Simba jumps up the sandy slopes of the desert and halts abruptly, sensing danger.","strategy":"The excitement of jumping reflects the rising tone while stopping signifies the definition."},{"mnemonic":"Simba makes a gradual ascent in the desert, eventually stopping to rest and reflect.","strategy":"The action of climbing higher before stopping illustrates both the tone and the meaning."}]],
 ["夕",[{"mnemonic":"Xena battles at sunset in the valley, as the sun sharply drops below the horizon.","strategy":"Xena represents 'x' and the valley sets the scene for the '-i'. The sharp drop of the sun corresponds to the falling tone, while evening embodies the meaning."},{"mnemonic":"Xena stands tall in the valley as the sun plunges quickly into night, signifying evening.","strategy":"The visual of the sun falling is illustrative of the tone and connects to the meaning of evening."},{"mnemonic":"As evening falls, Xena swings her sword down in the valley, bringing day to an end.","strategy":"The sharp sword swing captures the essence of a downward motion and connects with the evening meaning."},{"mnemonic":"Xena watches the sun drop into the valley, declaring the onset of evening.","strategy":"The action implies the downward tone while describing the character of evening beautifully."},{"mnemonic":"In the valley, Xena witnesses the day plunge into darkness, marking the arrival of evening.","strategy":"This imagery readily connects the representation of the action's sharp decline with its meaning."}]],
 ["大",[{"mnemonic":"David Attenborough stands tall in the savanna, his voice booming as he declares the greatness of the wildlife around him.","strategy":"David represents 'd' and the savanna represents '-a'. His powerful declaration depicts the sharp downward tone (Tone 4) and aligns with the meaning of greatness."},{"mnemonic":"In the savanna, David Attenborough's presence looms large as he shares insights about the great beasts.","strategy":"The image of his larger-than-life presence correlates with the meaning of big, while the act of sharing aligns with the tone."},{"mnemonic":"David swiftly points downward at the vast savanna, emphasizing the grandeur of the landscape.","strategy":"The pointing action signifies a sharp downward motion representing the tone, alongside the idea of a big landscape."},{"mnemonic":"As the sun sets over the savanna, David highlights the grandeur of the creatures that inhabit it.","strategy":"The setting sun conveys the downward action of the tone while demonstrating significant meaning."},{"mnemonic":"With arms wide open in the vast savanna, David celebrates the wonders of life, showcasing the 'greatness' around him.","strategy":"The expansive gesture reflects the meaning of big/great and the feeling of descent indicative of the tone."}]],
 ["女",[{"mnemonic":"Imagine Nemo bouncing around in a vibrant rainforest, joyfully saying 'I'm a female fish!'","strategy":"Nemo represents the initial 'n', the rainforest represents the final 'ü', and the action of bouncing reflects the fall-rise tone."},{"mnemonic":"Nemo finds a female fish hidden among the lush greenery of the rainforest, occasionally bouncing excitedly.","strategy":"The visual connection of Nemo with the rainforest promotes recall of the character, while noting its meaning."},{"mnemonic":"Picture Nemo swimming alongside a gentle female river spirit in the rainforest, playfully bouncing up and down.","strategy":"This emphasizes the character's association with femininity and the visual theme of nature."},{"mnemonic":"Nemo and a female dolphin are bouncing together in a rainforest pool.","strategy":"Combining oceanic life with a rainforest setting links the character and enhances recall."},{"mnemonic":"Nemo takes breaks from swimming to bounce joyfully on the rainforest's soft, green floor.","strategy":"The light action reflects the character's meaning and tone, creating a memorable image."}]],
 ["子",[{"mnemonic":"Zorro rides his horse, bouncing down into a lush valley filled with children playing.","strategy":"Zorro represents the initial 'z', while the valley represents the final 'i', and the bouncing action reflects the tone."},{"mnemonic":"Imagine Zorro playfully chasing children in a valley, all bouncing happily around him.","strategy":"This integrates the meaning of 'child' with the visual of Zorro bonding with kids."},{"mnemonic":"Zorro stops to watch children bouncing along the valley floor, symbolizing joy and youth.","strategy":"Utilizing a playful scene to connect Zorro to the meaning of the character, reinforcing memory."},{"mnemonic":"In a valley, Zorro and a group of children bounce about, celebrating the spirit of youth.","strategy":"The combination of Zorro with children in a scenic location helps link the meaning and tone."},{"mnemonic":"Zorro gives a playful flourish as he bounces into a valley filled with playful children.","strategy":"This lighthearted imagery enhances memorization through motion and character."}]],
 ["宀",[{"mnemonic":"Moana stands on the roof of a cozy cottage in a sunny meadow, suddenly looking down sharply.","strategy":"Moana provides a vivid initial, the meadow defines the final, and the sharp look implements the tone."},{"mnemonic":"Picture Moana perched atop a roof overlooking a colorful meadow, falling sharply to greet her friends below.","strategy":"The height implies the meaning of a roof, and the location anchors the image in nature."},{"mnemonic":"Moana sings as she stands on a roof surrounded by a blooming meadow, her voice falling low.","strategy":"This captures her character's essence while integrating the meaning and visual."},{"mnemonic":"On a bright day, Moana looks from the roof of her hut into the vast meadow below, her gaze sharp.","strategy":"This evokes a scene where the character's action matches the meaning."},{"mnemonic":"Moana finds shelter on her roof in the meadow, with a sudden drop of realization.","strategy":"The sudden drop action combined with the visual of the roof reinforces memory retention."}]],
 ["寸",[{"mnemonic":"Captain Planet shrinks to an inch as he stands at the edge of the ocean, falling dramatically into a wave.","strategy":"The character emphasizes Captain Planet for the initial, while the ocean completes the final, and falling action resonates with the tone."},{"mnemonic":"Imagine Captain Planet measuring an inch above the ocean's surface, then suddenly falling into the water.","strategy":"Incorporating context of measurement connects with the meaning of 'inch.'"},{"mnemonic":"Captain Planet stands on a floating inch-thick platform in the turbulent ocean, grabbing attention.","strategy":"The imagery combines the environmental element with the visual meaning of the character."},{"mnemonic":"In a dramatic moment, Captain Planet falls from an inch above the ocean, splashing into a wave.","strategy":"Combining a suspenseful action with ocean scenery reinforces memorable connections."},{"mnemonic":"Captain Planet hovers just an inch above the ocean, then drops suddenly into the water.","strategy":"Utilizing visual depth to depict the character's meaning while embedding the concept in nature."}]],
 ["小",[{"mnemonic":"Xena playfully dances in a small meadow, her movements bouncing from flower to flower.","strategy":"Xena represents the initial letter 'x', the meadow signifies the final, and the playful bouncing motion reflects the tone."},{"mnemonic":"Imagine Xena executing small jumps through a blooming meadow, spreading joy wherever she goes.","strategy":"The imagery of small jumps captures the meaning of the character effectively."},{"mnemonic":"Xena races with tiny woodland creatures in a meadow, their little bodies bouncing together.","strategy":"This promotes an engaging, visual narrative to retain the character's essence."},{"mnemonic":"In a meadow, Xena leaps gracefully between small patches of flowers, embodying lightness.","strategy":"The gentle atmosphere reflects both the character's meaning and the actions connected to it."},{"mnemonic":"Xena finds delight in the small details of the meadow, bouncing lightly between them.","strategy":"Highlighting small wonders not only clarifies the meaning but also enhances imagery."}]],
 ["尢",[{"mnemonic":"Yoda meditates calmly in the wetlands, showing kindness to a lame creature.","strategy":"The calmness relates to the flat tone while encapsulating the character's meaning through care."},{"mnemonic":"In the wetlands, Yoda walks steadily beside a lame frog, helping it along.","strategy":"The idea of steady walking supports the tone and the message of assisting someone crippled."},{"mnemonic":"Yoda watches a small, lame animal resting peacefully in the wetlands.","strategy":"The image of peace embodies the tone and emphasizes the condition of being lame."},{"mnemonic":"Yoda directs his calm energy toward healing a crippled animal in the wetlands.","strategy":"This illustrates both the steady tone and the healing aspect of the character’s meaning."},{"mnemonic":"Yoda remains calm as he finds a lame bird struggling in the wetlands.","strategy":"Calmly observing reinforces the tone while revealing the nature of the character."}]],
 ["尸",[{"mnemonic":"Simba discovers a sharp, sudden scene in the valley where a corpse lies.","strategy":"The sudden discovery captures the sharp tone while representing the character's meaning effectively."},{"mnemonic":"In the valley, Simba comes across a dead body, a shocking sight that startles him.","strategy":"The shock of the scene emphasizes both the suddenness of the tone and the somber meaning."},{"mnemonic":"Simba stops suddenly in the valley upon seeing a lifeless figure beneath the trees.","strategy":"The act of stopping sharply reflects the tone and highlights the grim meaning."},{"mnemonic":"Simba's heart skips as he finds a corpse lying still in the valley.","strategy":"The skipping motion indicates a sudden reaction to something dire, linking to the meaning."},{"mnemonic":"In the valley's shadows, Simba encounters a brutal truth: a lifeless form before him.","strategy":"The confrontation with a corpse creates a sharp contrast to the environment, embodying the character's essence."}]],
 ["屮",[{"mnemonic":"Captain Planet climbs up to a beautiful waterfall, scooping up sprouting plants.","strategy":"Captain Planet represents the initial 'c', while the waterfall is linked to the final 'iao', with the action of climbing and scooping illustrating the fall-rise tone."},{"mnemonic":"Captain Planet, with a big smile, dances around a flowing waterfall as little sprouts appear.","strategy":"The joyful action of dancing fits the fall-rise tone while emphasizing the meaning of sprouting."},{"mnemonic":"Imagine Captain Planet gently nurturing sprouts by splashing them with water from a majestic waterfall.","strategy":"The action of splashing connects to the tone and the sprouting meaning, bringing it to life visually."},{"mnemonic":"Captain Planet, with arms extended, ascends towards a waterfall where new sprouts are bursting forth.","strategy":"The ascension aligns with the fall-rise tone while presenting a clear image of sprouts emerging."},{"mnemonic":"Visualize Captain Planet catching raindrops from a waterfall that help sprouts grow.","strategy":"The imagery encapsulates the initial and final while gently illustrating the sprouting action."}]],
 ["山",[{"mnemonic":"Shrek stands flat on a mountain in the wetlands, looking calm and serene.","strategy":"Shrek represents 'sh', the wetlands are 'an', and Shrek's calm stance captures the flat tone, denoting stability."},{"mnemonic":"Imagine Shrek resting peacefully against a lush mountain in the wetlands.","strategy":"The resting action conveys the calmness of the flat tone while the mountain reflects the meaning."},{"mnemonic":"Shrek takes a deep breath, gazing across a vast mountain landscape interspersed with wetlands.","strategy":"The overall calm scene represents both the visual aspect of 'mountain' and the flatness in tone."},{"mnemonic":"Picture Shrek lying flat on a mountain, surveying the wetland below him.","strategy":"The flat position illustrates the tone while linking back to the mountain and wetlands in a memorable way."},{"mnemonic":"Shrek climbs slowly, continuously scanning the serene wetlands from atop the mountain.","strategy":"The slow, even action represents the flat tone, while the double imagery reinforces both the initial and final."}]],
 ["巛",[{"mnemonic":"Chun-Li suddenly jumps down a sand dune, creating ripples in the stream below.","strategy":"Chun-Li represents 'ch', the sand dune is 'uan', and her jump illustrates the sharpness of the falling tone."},{"mnemonic":"Visualize Chun-Li landing powerfully on a sand dune, causing a stream to surge around her.","strategy":"The sudden landing represents the falling tone while emphasizing the connection to 'stream'."},{"mnemonic":"Chun-Li races down the sand dune, triggering a swift movement of the stream nearby.","strategy":"The action of racing links vividly to the meaning of 'stream' and the intensity of the tone."},{"mnemonic":"Chun-Li performs a powerful downwards kick that causes the sand dune to collapse into the stream.","strategy":"The kicking action effectively conveys the tone while illustrating the character's meaning."},{"mnemonic":"Imagine Chun-Li sliding fiercely down a sand dune, splashing water from the stream over her.","strategy":"The visual scene distinctively ties together all elements while also conveying the falling tone."}]],
 ["工",[{"mnemonic":"Gandalf is busy tinkering at his station in an oasis, efficiently doing his work.","strategy":"Gandalf represents initial 'g', the oasis signifies final 'ong', while the calm atmosphere embodies the neutral tone."},{"mnemonic":"Imagine Gandalf skillfully crafting tools in the shade of an oasis, his expression focused yet relaxed.","strategy":"His skillful crafting relates to work, with the neutral tone illustrated by his relaxed demeanor."},{"mnemonic":"Visualize Gandalf glancing around, satisfied with his work in a peaceful oasis.","strategy":"The visual serenity conveys the neutral tone while presenting the meaning of work clearly."},{"mnemonic":"Gandalf quietly shapes his magical staff at the refreshing oasis, enjoying his focused work.","strategy":"The tranquil action underlines the neutral tone while creatively linking back to the meaning."},{"mnemonic":"Gandalf ponders over his work as he relaxes in the soft sands of the oasis.","strategy":"The imagery of a calm oasis integrates the concepts of work with the neutral tone effectively."}]],
 ["己",[{"mnemonic":"Imagine Jane Goodall gently dipping into a valley filled with wildlife, representing her self-awareness and connection to nature.","strategy":"Jane Goodall (initial) interacts with a valley (final) while her action of dipping represents the fall-rise tone, emphasizing her introspective nature."},{"mnemonic":"Picture Jane climbing a hill, then sliding down into a valley, reflecting on her own self.","strategy":"The characters represent 'self,' tying the character's meaning into the action of climbing and sliding, symbolizing self-reflection."},{"mnemonic":"Envision Jane standing at the edge of a valley, looking at her reflection in a stream.","strategy":"The visual of 'self' is invoked through the action of reflection aligning with her initial and final."},{"mnemonic":"Imagine Jane balancing on the edge of the valley, showcasing her self-control and confidence.","strategy":"The balance suggests stability (fall-rise tone) while connecting the meaning of 'self' to Jane's character."},{"mnemonic":"Visualize Jane humbly resting in the valley, appreciating herself amidst nature.","strategy":"The resting action is neutral-light (tone 5) and associates with her essence and the character's meaning."}]],
 ["巾",[{"mnemonic":"Picture Jane Goodall climbing a snowy hill in the tundra while carrying a colorful towel.","strategy":"The visualization incorporates a rising action (tone 2) and links the meaning of 'towel' through the object she's carrying."},{"mnemonic":"Imagine Jane unfurling a towel as she ascends the tundra, watching wildlife from above.","strategy":"The action of unfurling the towel links to the meaning while the climbing action captures the rising tone."},{"mnemonic":"Envision Jane standing on a snowy tundra, using a towel to absorb droplets of melting snow.","strategy":"Link the towel to the tundra environment while maintaining an upward-moving action representing tone 2."},{"mnemonic":"Visualize Jane on a hilltop, waving a towel cheerfully as she looks at the tundra below.","strategy":"Waving symbolizes lively ascension aligning with tone 2 while effectively linking it to the meaning of 'towel.'"},{"mnemonic":"Picture Jane spreading out a towel on the tundra as she prepares for a nature observation.","strategy":"The act of spreading showcases the towel while creating a visual connection to the environment."}]],
 ["干",[{"mnemonic":"Imagine Gandalf casting a spell that suddenly transforms a wetlands into a thriving ecosystem.","strategy":"The spellcasting represents a sudden action (tone 4) and links to the work done in the wetlands."},{"mnemonic":"Picture Gandalf working eagerly in the wetlands, enthusiastically wielding a staff.","strategy":"The enthusiasm in his actions captures the meaning of 'to work' and the urgency of the falling tone."},{"mnemonic":"Envision Gandalf commanding a sudden storm to do essential tasks in the wetlands.","strategy":"Storms are sudden (tone 4) while the character's actions relate to the meaning of 'to do.'"},{"mnemonic":"Imagine Gandalf landing abruptly in the wetlands to complete a vital learning mission.","strategy":"Landing abruptly symbolizes sudden action correlating with the character's work toward ecological balance."},{"mnemonic":"Visualize Gandalf executing a significant task in the wetlands, with birds feasting thanks to his efforts.","strategy":"Executing a task integrates the action into the meaning, showcasing intent and urgency."}]],
 ["幺",[{"mnemonic":"Imagine Yoda shrunk down, standing on a tiny ledge above a mighty waterfall, showcasing his small stature.","strategy":"Yoda represents tiny (meaning) while the waterfall links to the environment. The sharp action of 'standing' denotes the falling tone."},{"mnemonic":"Picture Yoda suddenly diving into the waterfall, emphasizing his small size.","strategy":"The diving act is a sharp action (tone 4), visually representing 'tiny' while connecting Yoda's persona."},{"mnemonic":"Envision Yoda climbing the rocks adjacent to a waterfall, emphasizing his small, nimble figure.","strategy":"Climbing presents an action while connecting the meaning of 'tiny' to his stature against a large waterfall."},{"mnemonic":"Imagine Yoda using his tiny hands to catch drops of water from the waterfall.","strategy":"The action reflects the meaning of something small, with a sudden capturing accentuating tone 4."},{"mnemonic":"Visualize Yoda balancing on a small stone at the edge of a waterfall, demonstrating his frail physicality.","strategy":"Balancing translates the notion of 'tiny' with the sharpness of balance correlating with falling tone."}]],
 ["广",[{"mnemonic":"Gandalf stands tall on a Sand Dune, proclaiming its vastness, but suddenly points down sharply to the ground, indicating the breadth of the land.","strategy":"Gandalf represents the initial 'g', the Sand Dune symbolizes the final 'uang', and the sharp action signifies the falling tone."},{"mnemonic":"Imagine Gandalf overseeing the Sand Dune, his arms wide as he represents the great width of the landscape, sharply gesturing downwards.","strategy":"Same associations while focusing more on his actions illustrating 'broad'."},{"mnemonic":"Gandalf rides down a steep Sand Dune, spreading his arms to show the wide area below him, then he suddenly drops to the ground.","strategy":"Emphasizes the imagery of width, with motion linking to the character meaning and tone."},{"mnemonic":"Gandalf raises his staff high at the top of a Sand Dune, showing how broad it is, but then he quickly brings it down pointing sharply.","strategy":"Combines the visual of Gandalf, location, and tone in a continuous flow."},{"mnemonic":"Gandalf stands overlooking the Sand Dune, calmly expressing its width, then he suddenly swoops down, emphasizing the broad expanse.","strategy":"Uses a fluid motion to allude to both the initial and the tonal aspect."}]],
 ["廴",[{"mnemonic":"Yoda strolls gracefully across the Tundra, dipping and rising as he steps, showing both his wisdom and movement.","strategy":"Yoda illustrates the initial 'y', the Tundra is the final 'in', and his movement captures the fall-rise of the tone."},{"mnemonic":"As Yoda walks in the Tundra, he takes slow, steady dips and rises, reflecting his knowledge of motion.","strategy":"Reinforces the idea of walking with a focus on rhythm and the character's meaning."},{"mnemonic":"Imagine Yoda bouncing gently on the Tundra, using his walking stick, embodying both walking and the gentle rise and fall.","strategy":"Layers the character's meaning with a playful motion."},{"mnemonic":"Yoda hops around the Tundra, his motion showing a combination of prediction and movement.","strategy":"Focuses on the playful aspects of both character and tone."},{"mnemonic":"Yoda glides across the icy Tundra, gently dipping and rising, as he illustrates the act of moving.","strategy":"Combines the visual action with serene motion reflecting the character's purpose."}]],
 ["廾",[{"mnemonic":"Quasimodo gently cradles the edge of a Volcano Crater, holding it lightly, embodying the essence of grasping.","strategy":"Quasimodo identifies the initial 'q', the location represents the final 'iang', and the light, fluttering action shows the neutral tone."},{"mnemonic":"Imagine Quasimodo standing at the Volcano Crater, softly holding the rim without applying too much pressure.","strategy":"Uses a calm and understated action to emphasize holding."},{"mnemonic":"Quasimodo hovers at the edge of the Volcano Crater, lightly holding the air above, illustrating the concept of grasping.","strategy":"Focuses on a delicate touch reflecting the tone and meaning."},{"mnemonic":"Quasimodo rests his hands on the gentle slope of the Volcano Crater, holding it softly as if in a moment of contemplation.","strategy":"Combines visual and emotional depth for enhanced memorability."},{"mnemonic":"Quasimodo holds onto the edge of the Volcano Crater like it's a fragile treasure, exhibiting a careful touch.","strategy":"Delivers the meaning via a gentle visual."}]],
 ["弋",[{"mnemonic":"Yoda stands at the Valley, aiming a bow and arrow, then suddenly lets the arrow fly downwards sharply.","strategy":"Yoda signifies 'y', the Valley illustrates 'i', and the sudden downward action expresses the falling tone while shooting."},{"mnemonic":"Visualize Yoda in the Valley, preparing to shoot an arrow straight down into the ground, emphasizing precision.","strategy":"Highlights the initial and location with a powerful action."},{"mnemonic":"Yoda draws back his arrow while standing on the edge of the Valley, then releases it swiftly into the air.","strategy":"Connects the meaning of shooting with movement and action."},{"mnemonic":"Imagine Yoda launching an arrow from the Valley, it drops sharply towards the ground, representing his intent.","strategy":"Associates the character with both action and visual context."},{"mnemonic":"Yoda grips his bow tightly on the Valley's border and shoots an arrow down with precision.","strategy":"Combines the visual of aiming and the energy of the shooting action vividly."}]],
 ["弓",[{"mnemonic":"Gandalf stands serenely at the Oasis, holding his bow steadily, emphasizing its importance.","strategy":"Gandalf represents 'g', the Oasis signifies 'ong', and his calm posture reflects the flat tone."},{"mnemonic":"Imagine Gandalf poised at the Oasis, bow in hand, with a steady grip and a calm demeanor, showcasing strength.","strategy":"Focuses on the internal calm relating to the meaning of bow."},{"mnemonic":"Gandalf stands still by the Oasis, bow drawn back, showcasing a flat readiness to shoot without tension.","strategy":"Uses imagery of readiness to reinforce the concept and sound."},{"mnemonic":"At the Oasis, Gandalf rests his bow across his lap, never losing his calm focus on the surroundings.","strategy":"Combines visual resting state with intent and character's meaning."},{"mnemonic":"Gandalf quietly surveys the Oasis, bow by his side, an image of stillness and readiness.","strategy":"Emphasizes the flat tone while visualizing calm strength."}]],
 ["彐",[{"mnemonic":"Imagine Jane Goodall suddenly diving down into a lush valley to observe the snouts of animals.","strategy":"Jane Goodall represents the 'j' initial, while the valley symbolizes the '-i' final, and the diving action fits the sharpness of tone 4."},{"mnemonic":"Visualize Jane standing at the edge of a valley, looking sharply downward at a wild animal with a notable snout.","strategy":"Here, Jane represents the initial, while the valley reflects the final, and the sharp gaze represents tone 4."},{"mnemonic":"Picture Jane climbing quickly down a steep valley to document the snout of a rare creature.","strategy":"This image portrays the descent of tone 4, with 'j' from Jane and '-i' from the valley."},{"mnemonic":"See Jane powerfully sweeping her hand down towards a snout in the valley below.","strategy":"The sweeping gesture represents tone 4's sharpness, linked with Jane for the initial and valley for the final."},{"mnemonic":"Imagine Jane observing a group of animals with fascinating snouts while standing atop a valley cliff, then leans in sharply.","strategy":"This scenario blends initial, final, tone, and meaning in a vivid image."}]],
 ["彡",[{"mnemonic":"Imagine Simba rising up on his hind legs to observe the wetlands and the bristles of grass swaying upwards.","strategy":"Simba stands for the initial, while the wetlands represent the final, with the rising action signaling tone 2."},{"mnemonic":"Visualize Simba leaping triumphantly among the tall bristles of grass in a vibrant wetland.","strategy":"This blends the initial, final, tone through Simba’s action of rising to leap."},{"mnemonic":"See Simba climbing to the top of a mound overlooking the wetlands, where the bristles catch his curiosity.","strategy":"The upward movement captures tone 2, with Simba representing the initial."},{"mnemonic":"Picture Simba brushing his mane against the tall bristles of grass in the wetlands, rising with interest.","strategy":"This illustrates the combination of initial, final, and the rising motion indicative of tone 2."},{"mnemonic":"Envision Simba playfully jumping upward in the wetlands, brushing against the bristling flora.","strategy":"This vibrant scene links the initial, final, and action to enhance memory of the character."}]],
 ["彳",[{"mnemonic":"Picture Tarzan stepping down a valley, then bouncing up again while glancing at the trees.","strategy":"Tarzan symbolizes the initial, valley represents the final, and the bounce shows tone 3's fall-rise."},{"mnemonic":"Imagine Tarzan taking a single step into the valley and then springing back up to grab a vine.","strategy":"This scenario emphasizes the initial 't', the 'i' final, and the fall-rise motion of tone 3."},{"mnemonic":"Visualize Tarzan gliding down into the valley then rising swiftly to swing from a branch.","strategy":"The imagery captures the action of tone 3 along with the associations for initial and final."},{"mnemonic":"See Tarzan gently stepping into the valley before leaping up, celebrating his step stats.","strategy":"This combines Tarzan’s identity, the valley setting, and the dynamic of tone 3's bounce."},{"mnemonic":"Envision Tarzan navigating the slope of a valley, hopping lightly then springing upward again.","strategy":"This portrayal enriches the mnemonic by intertwining the character with the tone's unique movement."}]],
 ["心",[{"mnemonic":"Imagine Xena standing peacefully in the tundra, her heart calm as she gazes at the horizon.","strategy":"Xena represents the initial, tundra the final, and her serene gaze embodies tone 1."},{"mnemonic":"Visualize Xena meditating in the tundra, with a soft heart, focused on the calm landscape.","strategy":"This combines Xena's identity with a peaceful environment and the steady nature of tone 1."},{"mnemonic":"See Xena lying on the tundra, her heart steady as she takes in the tranquility of her surroundings.","strategy":"The stillness captures the essence of tone 1, alongside Xena and the tundra."},{"mnemonic":"Picture Xena consolidating her strength in the tundra, her heart at ease as she connects with nature.","strategy":"This reflects the initial, final, character meaning, and the calmness of tone 1."},{"mnemonic":"Envision Xena walking slowly across the tundra, her heart steady and calm amidst the chilly air.","strategy":"This scene ties together all elements seamlessly with tone 1's flatness."}]],
 ["戈",[{"mnemonic":"Imagine Gandalf throwing a spear straight down into a glacier, triumphantly.","strategy":"Gandalf represents the initial. The glacier is the final, while throwing down illustrates the falling tone. Triumphantly connects with the meaning of the weapon."},{"mnemonic":"Picture Gandalf sharply piercing the glacier with his spear, showing mastery.","strategy":"Gandalf encodes the initial, glacier the final, and piercing indicates falling tone, while mastery connects to the meaning of weapon."},{"mnemonic":"Visualize Gandalf dramatically slamming his spear into the ice of the glacier.","strategy":"Gandalf symbolizes the initial, glacier for the final, and slamming signifies falling tone, while ice represents the meaning."},{"mnemonic":"Think of Gandalf diving off a mountain to stab the glacier with a spear.","strategy":"Gandalf stands for the initial, glacier the final, diving captures falling tone, while stabbing links to the meaning."},{"mnemonic":"Envision Gandalf casting a spear downward onto the glacier, echoing power.","strategy":"Gandalf encodes the initial, glacier for the final, casting signifies falling tone, and echoing power relates to the meaning of the weapon."}]],
 ["戶",[{"mnemonic":"Imagine Hagrid letting a heavy door slam shut against the dusty desert wind.","strategy":"Hagrid represents the initial. The desert reflects the final, and letting slam illustrates the falling tone, while door connects with the meaning."},{"mnemonic":"Picture Hagrid pushing through a massive door in the vast, open desert.","strategy":"Hagrid encodes initial, desert final, and pushing through signifies falling tone, while the massive door ties to the meaning."},{"mnemonic":"Visualize Hagrid forcefully shutting a door against the hot desert sun.","strategy":"Hagrid symbolizes the initial, the desert is the final, forcefully shutting illustrates falling tone, while hot door relates to the meaning."},{"mnemonic":"Think of Hagrid blocking the entrance of a door in the middle of a sandy desert.","strategy":"Hagrid represents the initial, desert as the final, blocking indicates falling tone, while entrance links to the meaning of door."},{"mnemonic":"Envision Hagrid dramatically closing a door between himself and the vast desert.","strategy":"Hagrid encodes the initial, desert stands for the final, closing indicates falling tone, and between links to the meaning of household."}]],
 ["手",[{"mnemonic":"Shrek raises his hand while climbing up the edge of a canyon, then dips down to wave.","strategy":"Shrek signifies the initial 'sh', the canyon indicates the final 'ou', and the action of climbing and dipping reflects the fall-rise motion of tone 3."},{"mnemonic":"Shrek's hand sways playfully in the canyon breeze as he bounces between high and low rocky outcrops.","strategy":"Shrek as 'sh', canyon as 'ou', and swaying with bouncing encapsulates the dip and rise of tone 3."},{"mnemonic":"Shrek lifts his hand up while descending into a valley of the canyon.","strategy":"Initial 'sh' is Shrek, final 'ou' is canyon, and lifting while descending fits the fall-rise action of tone 3."},{"mnemonic":"Shrek gestures with his hand in the canyon as he goes from up high to down low.","strategy":"Shrek stands for 'sh', canyon for 'ou', and the gesture of going up and down matches tone 3."},{"mnemonic":"Shrek waves his hand happily while balancing on the edge of the canyon, bouncing back and forth.","strategy":"Shrek embodies 'sh', the canyon gives 'ou', and the balancing action connects to tone 3's fall and rise."}]],
 ["支",[{"mnemonic":"Zeus holds up the entire valley with a steady posture, flat and unyielding.","strategy":"Zeus represents 'zh', valley signifies 'i', and holding steadily matches the calm action of tone 1."},{"mnemonic":"Zeus stands firmly in the valley, uplifting the sky above him without flinching.","strategy":"Initial 'zh' as Zeus, final 'i' as valley, and the steady lifting displays the flat tone of 1."},{"mnemonic":"In the valley, Zeus powers up, holding the sun flat above him, supporting all life.","strategy":"Zeus for 'zh', valley for 'i', and lifting the sun steadily conveys the calm, flat tone 1."},{"mnemonic":"Zeus balances the weight of the valley on his hands, demonstrating unwavering support.","strategy":"Zeus embodies 'zh', valley signifies 'i', and balancing without moving embodies tone 1's flatness."},{"mnemonic":"Zeus remains stable in the valley, raising his arms horizontally to provide support.","strategy":"Zeus indicates 'zh', the valley highlights 'i', and the horizontal action represents the calm of tone 1."}]],
 ["攴",[{"mnemonic":"Pocahontas stands confidently at the volcano, preparing to strike down some vines growing around.","strategy":"Pocahontas (p) at a volcano (o) represents the visual part of the character, depicting a calm scene as she strikes."},{"mnemonic":"Imagine Pocahontas gently tapping on the side of the volcano, creating a calm eruption.","strategy":"Using the volcanic imagery helps visualize the action of striking with clarity linked to tone 1's calmness."},{"mnemonic":"Picture Pocahontas calmly walking around the volcano, her hand poised to strike at any troublesome plants.","strategy":"Calm and steady action while incorporating the cultural association."},{"mnemonic":"While adventuring near a volcano, Pocahontas strikes a pose illustrating her readiness.","strategy":"This portrays both the action required (striking) and her character in a steady scene."},{"mnemonic":"Visualize Pocahontas gracefully striking the lush vegetation at the base of the volcano.","strategy":"Combines the meaning with initial imagery, emphasizing calmness amidst the nature theme."}]],
 ["文",[{"mnemonic":"Wonder Woman rises majestically above the forest, wielding a pen like her lasso.","strategy":"Wonder Woman (w) in a forest (en) shows her rising in stature, symbolizing writing."},{"mnemonic":"Visualize Wonder Woman ascending high above the forest, where she writes the stories of the wildlife.","strategy":"The action of rising combined with writing connects the character’s essence with the natural setting."},{"mnemonic":"Imagine Wonder Woman effortlessly floating upward, jotting down thoughts inspired by the beautiful forest.","strategy":"Emphasizes the rising tone while linking to nature and the meaning of literature."},{"mnemonic":"Picture Wonder Woman soaring over the forest, her pen drawing glowing words in the air.","strategy":"Combines the natural environment with a creative action, enhancing memorability."},{"mnemonic":"As Wonder Woman climbs a treetop in the forest, she records her observations about nature.","strategy":"This links the action of writing while emphasizing the visual theme of the character."}]],
 ["斗",[{"mnemonic":"David Attenborough dips down into the canyon to explore the wildlife and struggles against adversity.","strategy":"David Attenborough (d) juxtaposed against a canyon (ou) matches with the tone’s rise and dip."},{"mnemonic":"Imagine David Attenborough gracefully dipping into the canyon to observe wild animals engaging in struggle.","strategy":"The action of dipping and rising conveys the natural beauty as well as the meaning."},{"mnemonic":"Visualize David Attenborough rising from the canyon, explaining how creatures struggle to survive.","strategy":"Combines the action of rising with the struggle connecting visuals to the character."},{"mnemonic":"Picture David Attenborough crossing the edge of the canyon, where species fight for survival.","strategy":"Focuses on struggle which aligns beautifully with both the action and meaning aspects."},{"mnemonic":"As David descends into the canyon, he recounts the stories of survival and conflict among the inhabitants.","strategy":"Incorporating struggle and action into this scenic visualization helps with recall."}]],
 ["斤",[{"mnemonic":"Jane Goodall calmly uses a tool to cut through the rough tundra to collect samples.","strategy":"Jane Goodall (j) in the tundra (in) shows a steady and serene scene, relevant to cutting."},{"mnemonic":"Visualize Jane gently slicing through the tundra to reveal the rich ecosystems beneath.","strategy":"The calm action corresponds with the meaning of cutting while emphasizing her character."},{"mnemonic":"Picture Jane meticulously cutting through layers of tundra, showcasing her knowledge of the environment.","strategy":"The steady action highlights her commitment and the significance of her work."},{"mnemonic":"Imagine Jane Goodall softly cutting away brush in the tundra while observing wildlife.","strategy":"Focuses on both her calm precision and the beauty of the natural surroundings."},{"mnemonic":"As Jane surveys the tundra, she cuts through ice with a steady hand, studying the land.","strategy":"Combines the action of cutting with the visual element of the tundra, enhancing recall."}]],
 ["方",[{"mnemonic":"Frodo stands firmly in a volcano crater, showing directions by pointing his sword steadily. ","strategy":"Frodo represents 'f' as he stands firmly (flat tone) in a volcano crater (ang), symbolizing strength and stability which links to the meaning of 'square' or 'direction.'"},{"mnemonic":"Frodo draws a square on the ground at the edge of a volcano crater, maintaining a calm and steady posture.","strategy":"Frodo's calm action (flat tone) signifies 'square' while the setting of the volcano crater represents the 'ang' final."},{"mnemonic":"Frodo maps out a plan on the ground in the volcano crater, defining the square boundaries.","strategy":"The action of mapping out (flat tone) represents 'method' and the crater signifies the environmental aspect for 'ang.'"},{"mnemonic":"In the volcano crater, Frodo demonstrates the square shape by using rocks to create a stable platform.","strategy":"The action of creating (flat tone) symbolizes 'square' and 'ang' reflects the location related to magma."},{"mnemonic":"Frodo stands in a square formation with his friends in the crater of the volcano, showcasing strategy.","strategy":"The formation (flat tone) reflects 'method' and the enclosing volcano crater showcases the environmental aspect."}]],
 ["无",[{"mnemonic":"Wonder Woman raises her lasso high in the desert, signifying the absence of obstacles.","strategy":"The rising motion of Wonder Woman (tone 2) in the desert symbolizes 'not' or 'nothing,' linking to the visual of emptiness found in a desert."},{"mnemonic":"In the vast desert, Wonder Woman lifts a banner claiming 'nothing is here!' to signal the emptiness.","strategy":"The lifting action (tone 2) signifies absence while the desert emphasizes the meaning of 'nothing.'"},{"mnemonic":"Wonder Woman climbs the tall dunes in the desert, yelling, 'There is nothing to see!' as she rises.","strategy":"Climbing (tone 2) mirrors the meaning of lacking, while the desert embodies the setting."},{"mnemonic":"Wonder Woman arches over the sand dunes, momentarily saying 'There is no treasure here!' as she rises.","strategy":"The arching upwards (tone 2) relates to 'have not,' while the surrounding desert environment parallels the meaning."},{"mnemonic":"With her arms raised high in the desert, Wonder Woman declares '无' (nothing).","strategy":"The action of raising her arms (tone 2) embodies the concept of nothingness amidst the vast desert."}]],
 ["日",[{"mnemonic":"Robin Hood stands atop a valley, pointing downward at the sun shining ostentatiously in the sky.","strategy":"The downward pointing (tone 4) reflects the powerful brilliance of the sun which correlates with the character's meaning."},{"mnemonic":"Standing on the valley's edge, Robin Hood dramatically gestures towards the sun glaring down.","strategy":"The dramatic gesture (tone 4) showcases the brightness of the sun, linking the meaning with the valley below."},{"mnemonic":"Robin Hood shoots an arrow upward into the sun above the valley, letting out an excited yell.","strategy":"Shooting upward (tone 4) captures the essence of day, while the valley supports the environmental aspect."},{"mnemonic":"Robin Hood spreads his arms wide at the valley's crest as he basks in the sunlight.","strategy":"The action of spreading arms (tone 4) signifies the concept of 'day,' while the valley enhances the natural setting."},{"mnemonic":"From a high point in the valley, Robin Hood throws a gleaming coin straight down at the sun's reflection.","strategy":"Throwing down (tone 4) emphasizes the character's meaning of 'sun,' capturing a specific moment of brightness."}]],
 ["曰",[{"mnemonic":"Yoda climbs slowly up a glacier, proclaiming wise sayings as he engages his audience.","strategy":"The rising action (tone 2) represents 'to say' while the glacier signifies the environment reflecting clarity of speech."},{"mnemonic":"At the edge of the glacier, Yoda raises his hand and speaks, echoing across the cold surface.","strategy":"The raising hand (tone 2) embodies the act of speaking, while the glacier underlines the coolness of communication."},{"mnemonic":"As Yoda ascends the icy glacier, he shouts, 'This is what I say!' echoing through the cold air.","strategy":"The ascending action (tone 2) signifies utterance while also linking Yoda's teachings symbolically through the glacier."},{"mnemonic":"Yoda slowly slides down the glacier, whispering secrets as he goes.","strategy":"Sliding down (tone 2) depicts gentle speech in contrast with the sturdy, unforgiving glacier backdrop."},{"mnemonic":"With a determined stride on the glacier, Yoda declares 'I say, understand you must!' loudly.","strategy":"Declaring (tone 2) represents affirmation, while the glacier enhances the natural setting conducive to speech."}]],
 ["月",[{"mnemonic":"Yoda stands on the Misty Hills, suddenly pointing down at the beautiful moon.","strategy":"Yoda represents the initial 'y', the Misty Hills is for the final '-ue', and the action of pointing down illustrates the falling tone, while the moon is the meaning."},{"mnemonic":"Yoda levitates on the Misty Hills, then suddenly drops to the ground while gazing at the moon.","strategy":"The visual of Yoda levitating represents 'y', with Misty Hills under him representing '-ue'. His sudden drop signifies a sharp tone, and the moon embodies the meaning."},{"mnemonic":"Yoda, in a focused stance on the Misty Hills, sharply descends while marveling at the glowing moon.","strategy":"Yoda illustrates the initial, Misty Hills signifies the final, and a sharp descent captures the tone. The glowing moon highlights its meaning."},{"mnemonic":"Yoda stands firmly on the Misty Hills, then with a sudden motion gestures downward towards the full moon.","strategy":"The firmness of Yoda represents the initial while Misty Hills symbolizes the final. The motion of pointing downward captures the tone, and the moon is the meaning."},{"mnemonic":"Yoda is caught off guard on the Misty Hills as he points down, mesmerized by the bright moon.","strategy":"Yoda represents 'y'; the Misty Hills are the environment. The motion of pointing down fulfills the falling tone, and the moon enhances the meaning."}]],
 ["木",[{"mnemonic":"Moana swiftly drops a wooden surfboard on the Desert ground.","strategy":"Moana represents initial 'm', the Desert conveys final '-u', and dropping the surfboard evokes a sharp descent, while wood is the meaning."},{"mnemonic":"Moana stands bold in the Desert, suddenly dropping a large wooden crate.","strategy":"Moana embodies 'm', the Desert illustrates '-u', and the dropping action captures the sharp tone, whereas the wooden crate represents the meaning."},{"mnemonic":"While exploring the Desert, Moana abruptly tosses a piece of wood to the ground.","strategy":"Moana symbolizes the initial, the Desert is the final, tossing wood represents a sharp action, and wood conveys meaning."},{"mnemonic":"Moana, feeling adventurous in the Desert, makes a sudden drop-leap with a piece of wood.","strategy":"Moana illustrates the 'm', Desert signifies the '-u', and the sudden drop-leap captures the sharp tone with the piece of wood embodying the meaning."},{"mnemonic":"Moana finds a tree in the Desert and makes a swift motion to drop the wood.","strategy":"Moana is for 'm', the Desert is the final, and the swift drop captures the falling tone, with the tree symbolizing the meaning of wood."}]],
 ["欠",[{"mnemonic":"Quasimodo bounces joyfully in the Meadow, as he realizes he still owes a favor.","strategy":"Quasimodo represents 'q', the Meadow illustrates the '-ian', his joyfully bouncing conveys the fall-rise tone, while the concept of owing is the meaning."},{"mnemonic":"In the Meadow, Quasimodo dips down and then rises up, realizing he owes a friend a visit.","strategy":"Quasimodo symbolizes 'q', the Meadow for '-ian', the dipping and rising motion represents the tone, with the act of owing for meaning."},{"mnemonic":"Quasimodo hops in the Meadow, bouncing while remembering he owes his friend a letter.","strategy":"Quasimodo represents the initial, the Meadow is for the final, bouncing captures the fall-rise tone, while the owed letter signifies meaning."},{"mnemonic":"Quasimodo playfully dips low in the Meadow, then bounces back, thinking of what he owes.","strategy":"Quasimodo is for 'q', the Meadow symbolizes '-ian', and the playful dip-bounce fits the tone, with the notion of owing highlighting the meaning."},{"mnemonic":"While in the Meadow, Quasimodo bends down and springs back up, reflecting on a debt he owes.","strategy":"Quasimodo embodies 'q', the Meadow illustrates the final '-ian', the downward motion followed by a bounce illustrates the tone, and reflecting on debt expresses the meaning."}]],
 ["止",[{"mnemonic":"Zorro suddenly halts at the edge of the Valley, his sword drawn for a stopping pose.","strategy":"Zorro represents 'z', the Valley illustrates '-i', and the halting action captures the sharp falling tone, while 'to stop' conveys the meaning."},{"mnemonic":"Zorro skids to a stop at the Valley's entrance, creating a sharp cloud of dust.","strategy":"Zorro symbolizes the initial, the Valley represents the final, and skidding to a stop embodies the tone, while stopping captures the meaning."},{"mnemonic":"In classic style, Zorro comes to an abrupt stop in the Valley, sword raised.","strategy":"Zorro is for 'z', the Valley symbolizes '-i', the abrupt stop embodies a sharp tone, while the raised sword highlights the meaning of stopping."},{"mnemonic":"As Zorro sprints into the Valley, he suddenly stops, leaving his mark in the sand.","strategy":"Zorro represents 'z', the Valley is the final, sudden stopping illustrates the tone, and leaving a mark captures the concept of stopping."},{"mnemonic":"Zorro quickly rushes into the Valley, then suddenly halts to observe the surroundings.","strategy":"Zorro embodies 'z', the Valley for '-i', and the sudden halt captures the sharp fall, as the act of stopping captures its meaning."}]],
 ["歹",[{"mnemonic":"David Attenborough dramatically announces the news of death on a mysterious Island.","strategy":"David represents 'd', the Island illustrates '-ai', and the dramatic announcement captures the sharp falling tone while death conveys the meaning."},{"mnemonic":"On the Island, David Attenborough sadly recounts a story of death.","strategy":"David represents the initial 'd', the Island is for final '-ai', and his sadness evokes a sharp action while death conveys the meaning."},{"mnemonic":"While exploring the Island, David Attenborough delivers a sharp warning about death in nature.","strategy":"David symbolizes 'd', the Island is the final, and the sharp warning fits the tone while death is the essence of meaning."},{"mnemonic":"David Attenborough stands solemnly on the Island, his voice falling as he speaks of death.","strategy":"David represents 'd', Island signifies '-ai', and the solemn falling voice illustrates the tone while death embodies the meaning."},{"mnemonic":"On the Island, David Attenborough stops suddenly to address the serious topic of death.","strategy":"David for 'd'; Island for '-ai'; the sudden stop brings a sharp tone, and the topic of death captures its meaning."}]],
 ["殳",[{"mnemonic":"Imagine Tarzan swinging up in the air to strike a target in the vast Desert.","strategy":"Tarzan represents 't', the Desert is 'u', and the swinging up action shows the rising tone."},{"mnemonic":"Visualize Tarzan climbing a cactus in the Desert before making a swift strike.","strategy":"Tarzan maintains the 't' association; the cactus represents 'u', and climbing illustrates the rising tone."},{"mnemonic":"Picture Tarzan rising above the dunes in the Desert, ready to strike down.","strategy":"This employs Tarzan (t), the Desert (u), and the readiness to strike emphasizes the rising tone."},{"mnemonic":"Imagine Tarzan standing atop a sandy hill in the Desert, raising his weapon to prepare for a strike.","strategy":"Tarzan captures 't', the hill represents 'u', and the upward motion conveys the rising tone."},{"mnemonic":"Picture Tarzan jumping up from the Desert floor to make a powerful strike.","strategy":"This keeps the initial 't' in focus, the Desert as 'u', and highlights the ascending action for the tone."}]],
 ["毋",[{"mnemonic":"Picture Moana gently gliding over a calm Volcano, lightly saying 'no' to anyone nearby.","strategy":"Moana represents 'm', the Volcano exhibits the 'o', and the gentle gliding suggests a neutral tone."},{"mnemonic":"Imagine Moana resting at the edge of a Volcano, softly shaking her head.","strategy":"Moana captures 'm', Volcano represents 'o', and the soft shake reflects the neutral tone."},{"mnemonic":"Visualize Moana steering her boat near a Volcano, gently signaling 'not' with her hand.","strategy":"This associates Moana with 'm', Volcano with 'o', and the gentle signaling captures the neutral essence."},{"mnemonic":"Imagine Moana hovering playfully around a steamy Volcano, lightly saying 'no' to the heat.","strategy":"Moana remains 'm', the Volcano embodies 'o', and the playful motion indicates the light, neutral tone."},{"mnemonic":"Envision Moana taking a light stroll near a dormant Volcano, softly saying 'no' to explorers.","strategy":"Moana links to 'm', the Volcano shows 'o', and the stroll is reflective of the neutral, gentle tone."}]],
 ["比",[{"mnemonic":"Picture Bilbo Baggins dramatically comparing two treasures at the edge of a Valley, making a sharp gesture.","strategy":"Bilbo corresponds to 'b', the Valley is 'i', and the dramatic gesture signifies the falling tone."},{"mnemonic":"Imagine Bilbo standing in a Valley, suddenly pointing sharply to showcase a comparison.","strategy":"Bilbo embodies 'b', the Valley stands for 'i', with the sharp point illustrating the falling tone."},{"mnemonic":"Visualize Bilbo gesturing with excitement in the Valley as he makes a stark comparison.","strategy":"Bilbo represents 'b', the Valley as 'i', and the gesturing relates to the sharp falling tone."},{"mnemonic":"Envision Bilbo at the Valley’s edge, sharply drawing comparisons between two paths with his finger.","strategy":"This line keeps Bilbo (b) and the Valley (i), while the drawing action highlights the falling tone."},{"mnemonic":"Imagine Bilbo surrounded by hills in the Valley, quickly making sharp comparisons as he speaks.","strategy":"Here, Bilbo continues to signify 'b', the Valley maintains 'i', and the quick action captures the falling tone."}]],
 ["毛",[{"mnemonic":"Picture Moana climbing up a sparkling waterfall, her long hair flowing behind her.","strategy":"Moana represents the initial 'm', the waterfall represents the '-ao' final, and 'climbing' encodes the rising tone."},{"mnemonic":"Imagine Moana brushing her curly hair while standing at the edge of a majestic waterfall.","strategy":"Moana signifies 'm', the waterfall gives the '-ao', and the action of brushing hair reflects the rising tone."},{"mnemonic":"Visualize Moana swinging from vines above a waterfall, her hair shining in the sunlight.","strategy":"Moana is the person for 'm', the waterfall for '-ao', and swinging depicts the rising action."},{"mnemonic":"Envision Moana playing with her hair as she gazes at the falling water, feeling uplifted.","strategy":"Moana for 'm', waterfall for '-ao', and 'feeling uplifted' captures the tone."},{"mnemonic":"Imagine Moana swimming near the waterfall, her hair floating in the current.","strategy":"Moana symbolizes 'm', water falls represent '-ao', and the peaceful swimming reflects the rising tone."}]],
 ["氏",[{"mnemonic":"Visualize Shrek shouting out his family name while standing at the edge of a steep valley.","strategy":"Shrek signifies 'sh', the valley reflects the '-i', and shouting represents the sharp falling tone."},{"mnemonic":"Picture Shrek dramatically falling into a valley while yelling his family name.","strategy":"Shrek stands for 'sh', the valley denotes '-i', and 'dramatic falling' indicates the tone."},{"mnemonic":"Imagine Shrek sliding down the hill into the valley, roaring his family name.","strategy":"Shrek for 'sh', valley for '-i', and sliding represents the sharp falling action."},{"mnemonic":"Envision Shrek struggling to climb back up the steep valley, huffing out his family name.","strategy":"Shrek for 'sh', valley for '-i', and huffing emphasizes the falling tone."},{"mnemonic":"Imagine Shrek sharply leaning over a valley cliff to declare his last name.","strategy":"Shrek represents 'sh', the valley is the '-i', and leaning sharply captures the tone."}]],
 ["气",[{"mnemonic":"Imagine Quasimodo gasping at the bottom of a deep valley, talking about the air.","strategy":"Quasimodo captures 'q', the valley denotes '-i', and gasping conveys the sharp falling tone."},{"mnemonic":"Visualize Quasimodo climbing out of a valley while struggling to get more air.","strategy":"Quasimodo for 'q', valley for '-i', and struggling represents the sharp tone."},{"mnemonic":"Envision Quasimodo shouting in surprise about the fresh air at the top of a valley.","strategy":"Quasimodo denotes 'q', the valley signifies '-i', and shouting is a sharp action that indicates tone."},{"mnemonic":"Picture Quasimodo leaning over the valley edge to catch the breeze, gasping at its freshness.","strategy":"Quasimodo for 'q', valley for '-i', and gasping reflects the sharp tone."},{"mnemonic":"Imagine Quasimodo trying to breathe deeply at the bottom of a valley during a storm.","strategy":"Quasimodo captures 'q', valley represents '-i', and trying to breathe conveys the falling tone."}]],
 ["水",[{"mnemonic":"Visualize Shrek bouncing on the waves in a bay, laughing and splashing water.","strategy":"Shrek represents 'sh', bay signifies '-ui', and bouncing captures the fall-rise tone."},{"mnemonic":"Imagine Shrek splashing in water as he bounces up and down at the bay.","strategy":"Shrek stands for 'sh', the bay indicates '-ui', and bouncing represents the fall-rise action."},{"mnemonic":"Picture Shrek joyfully floating on a bay's surface, while water bounces around him.","strategy":"Shrek for 'sh', bay for '-ui', and floating relates to the fall-rise tone."},{"mnemonic":"Envision Shrek riding the strong waves in the bay, rising and lowering with the water.","strategy":"Shrek signifies 'sh', bay indicates '-ui', and riding the waves reflects the bouncing tone."},{"mnemonic":"Imagine Shrek playfully dipping into the water, experiencing a gentle rise at the bay.","strategy":"Shrek is for 'sh', bay is '-ui', and the gentle rise depicts the fall-rise tone."}]],
 ["火",[{"mnemonic":"Hagrid throws a blazing fireball into the desert.","strategy":"Hagrid represents the initial 'h', the desert symbolizes the final 'uo', and the action of throwing a fireball portrays the sharp, falling tone."},{"mnemonic":"In the desert, Hagrid’s campfire suddenly flares up.","strategy":"The sudden flare illustrates the sharp tone, while involving Hagrid and the desert to represent the character’s meaning of fire."},{"mnemonic":"Hagrid stomps the ground, causing fire to erupt in the desert.","strategy":"Stomping shows a downward action (falling tone), integrating the character of Hagrid in a fiery desert scenario."},{"mnemonic":"Hagrid warns everyone as flames shoot up from the desert floor.","strategy":"The downward shooting flames depict a sharp falling tone while connecting Hagrid with his representation of fire in the desert."},{"mnemonic":"Hagrid creates a fire, which crackles loudly as night falls in the desert.","strategy":"The imagery of crackling flames and falling night conveys a sharp sound-action, reinforcing the representation of fire and environment."}]],
 ["爪",[{"mnemonic":"Zorro uses his claws to bounce off the rocks near the waterfall.","strategy":"Zorro represents 'z', the waterfall illustrates 'ao', and the bouncing action connects with the fall-rise tone pattern associated with claws."},{"mnemonic":"At the waterfall, Zorro playfully scratches the surface with his claws.","strategy":"The playful scratching depicts a fall-rise action, integrating Zorro's character and the environment with claw imagery."},{"mnemonic":"As Zorro leaps from the ledge, his claws catch the mist from the waterfall.","strategy":"The leap conveys a dip and rise (fall-rise tone), tying in Zorro and the natural waterfall environment."},{"mnemonic":"Zorro's claws glisten as he dances around the waterfall's edge.","strategy":"The dancing conveys a rising action while emphasizing both the character and the environmental waterfall aspect as it relates to claws."},{"mnemonic":"Zorro swings down from the tree, his claws grazing the water as he lands near the waterfall.","strategy":"The grazing depicts a light fall-rise motion while connecting Zorro to the claw theme and the waterfall backdrop."}]],
 ["父",[{"mnemonic":"Frodo suddenly tumbles down a sharp cliff in the desert, calling for his father.","strategy":"Frodo (initial 'f') represents the character, the desert (final 'u') sets the location, and the sudden action captures the falling tone."},{"mnemonic":"Frodo swiftly leaps into the desert at dawn, desperately seeking his father.","strategy":"Frodo (initial 'f') represents the character, the desert (final 'u') sets the environment, and the swift leap matches the sharpness of tone 4."},{"mnemonic":"Frodo shouts for his father while falling rapidly in the sandy desert.","strategy":"Frodo (initial 'f') stands for the character, and the desert (final 'u') associates with the final while emphasizing the sharpness of tone 4."},{"mnemonic":"In the desert, Frodo's cry for his father echoes sharply as he jumps off a ledge.","strategy":"Frodo (initial 'f') represents the character, the desert (final 'u') provides the setting, and the echo captures the falling tone."},{"mnemonic":"Frodo dives down into the treacherous desert, yearning for his father.","strategy":"Frodo (initial 'f') reflects the character, the desert (final 'u') sets the scene, and the dive corresponds to the sudden action of tone 4."}]],
 ["爻",[{"mnemonic":"Yoda gracefully ascends towards the roaring waterfall, representing the changes of the Force.","strategy":"Yoda (initial 'y') signifies the character, the waterfall (final 'ao') describes the scene, and the ascending action reflects the rising tone."},{"mnemonic":"Yoda climbs up the slippery rocks towards the waterfall as he transforms into a Jedi Master.","strategy":"Yoda (initial 'y') represents the character, the waterfall (final 'ao') gives the environment, and the climbing corresponds to the rising tone."},{"mnemonic":"Yoda floats up towards the waterfall, witnessing the changes around him.","strategy":"Yoda (initial 'y') indicates the character, the waterfall (final 'ao') provides a visual, and the floating is indicative of the rising action."},{"mnemonic":"As Yoda rises beside the waterfall, he feels the transformative energy of nature.","strategy":"Yoda (initial 'y') evokes the character, the waterfall (final 'ao') indicates the place, while the rising feeling corresponds to the tone."},{"mnemonic":"Yoda levitates upwards in front of a majestic waterfall, embodying transformation.","strategy":"Yoda (initial 'y') relates to the character, the waterfall (final 'ao') sets the scene, and the levitation pairs with the rising tone."}]],
 ["爿",[{"mnemonic":"Pocahontas dips down into the volcano crater, then rises with branches that split the air.","strategy":"Pocahontas (initial 'p') signifies the character, the volcano crater (final 'ang') provides the setting, and the dipping and rising movement corresponds to the fall-rise tone."},{"mnemonic":"Pocahontas bends to gather flowers at the edge of the volcano crater, then rises up with a split branch.","strategy":"Pocahontas (initial 'p') represents the character, the volcano crater (final 'ang') gives an environment, while the bending and rising actions reflect the tone."},{"mnemonic":"Pocahontas hops down into the volcano crater, then rises out with a two-part branch.","strategy":"Pocahontas (initial 'p') embodies the character, the volcano crater (final 'ang') sets the geographic scene, and the hopping fits the fall-rise tone."},{"mnemonic":"In the volcano crater, Pocahontas lowers herself to split a vine, then rises with her catch.","strategy":"Pocahontas (initial 'p') relates to the character, the volcano crater (final 'ang') describes the location, and the lowering followed by rising captures the tone."},{"mnemonic":"Pocahontas skillfully dips into the volcano crater, then swiftly rises with a forked stick.","strategy":"Pocahontas (initial 'p') indicates the character, the volcano crater (final 'ang') provides environmental context, and the movements match the tone's characteristics."}]],
 ["片",[{"mnemonic":"Pocahontas swiftly slices through the wetlands with a sharp blade, creating a piece of the land.","strategy":"Pocahontas (initial 'p') signifies the character, the wetlands (final 'an') provide a rich environment, and the sudden slicing action reflects the falling tone."},{"mnemonic":"In the wetlands, Pocahontas sharply divides the water with her spear, revealing a piece of earth.","strategy":"Pocahontas (initial 'p') indicates the character, the wetlands (final 'an') set the scene, and the dividing action captures the tone's sharpness."},{"mnemonic":"Pocahontas quickly cuts through the reeds in the wetlands, making a clean slice.","strategy":"Pocahontas (initial 'p') embodies the character, the wetlands (final 'an') describe the environment, and the act of slicing aligns with the sharp tone."},{"mnemonic":"Pocahontas dashes across the flooded wetlands, slicing through the surface like a piece of fabric.","strategy":"Pocahontas (initial 'p') represents the character, the wetlands (final 'an') provide context, while the dashing motion corresponds to the tone."},{"mnemonic":"In the wetlands, Pocahontas sharpens a wood piece by slicing through the water.","strategy":"Pocahontas (initial 'p') signifies the character, the wetlands (final 'an') set the background, and the sharpening aligns with the falling tone."}]],
 ["牙",[{"mnemonic":"Imagine Yoda discovering a tooth in the Savanna as he climbs up a hill, looking as if he's found something precious.","strategy":"Yoda represents the initial 'y' and the Savanna is the location for the final 'a'. The action of climbing suggests the rising tone (2), while the meaning of 'tooth' emphasizes the visual aspect of the character, which resembles a tooth."},{"mnemonic":"Picture Yoda teaching about teeth while standing on a hill in the Savanna, as the sun rises behind him.","strategy":"The upward motion symbolizes the rising tone, reinforcing the meaning of 'tooth' as Yoda shares knowledge about it in a Savanna setting."},{"mnemonic":"Visualize Yoda chewing on grass in the Savanna, his large tooth glistening as he rises in excitement.","strategy":"Yoda highlights the 'y', while the chewed grass relates back to the concept of a tooth. Rising excitement connects with the tone."},{"mnemonic":"Imagine Yoda using his wisdom to help animals in the Savanna with their dental hygiene as he climbs gently upward.","strategy":"This reinforces the meaning of 'tooth' and maintains the rising emotional tone while using the environment of the Savanna."},{"mnemonic":"See Yoda lift a giant tooth high in the Savanna as he teaches others about strong teeth, his spirit rising.","strategy":"The lifting action suggests a rising tone and captures both the visual aspect of the character and the meaning related to 'tooth'."}]],
 ["牛",[{"mnemonic":"Envision Nemo happily swimming in a clear valley while a giant cow rises gracefully from the water.","strategy":"Nemo provides the initial 'n', the valley sets the location for 'iu', and the image of a cow rising suggests an uplifting tone related to the meaning."},{"mnemonic":"Picture Nemo discovering a cow grazing in a deep valley, swimming upward with joy as he floats to the surface.","strategy":"Nemo's initial links to 'n', while the valley ties back to 'iu'. The playful action represents the rising tone, emphasizing the meaning of a cow."},{"mnemonic":"Imagine Nemo inviting a friendly cow to join him in the valley, with their spirits rising as they play in the water.","strategy":"The rising action relates to the tone depictions and combines gracefully with the cow's meaning."},{"mnemonic":"Visualize Nemo swimming up to the surface of the valley to greet a smiling cow, both rising with glee.","strategy":"This incorporates the characters and emphasizes the uplifting emotion tied to the sound and meaning."},{"mnemonic":"See Nemo lead a cow in the valley towards a bright sunset, both figures rising toward the colorful skyline.","strategy":"Nemo embodies the initial 'n', the valley is a stunning visual aspect for the final 'iu', and the upward movement represents the tone."}]],
 ["犬",[{"mnemonic":"Imagine Quasimodo bouncing playfully around the sand dunes as a happy dog barks with joy.","strategy":"Quasimodo represents 'q', while the sand dune embodies 'uan'. The bouncing action illustrates the fall-rise tone and directly relates to the concept of a dog."},{"mnemonic":"Picture Quasimodo soaring down the sand dunes, with a dog chasing him up and down, their energy bouncing together.","strategy":"This portrays the characters vividly, the bouncing action connects with the tone and reinforces the meaning of dog."},{"mnemonic":"Envision Quasimodo and a playful dog hopping around the soft sand dunes, the excitement rising and falling beautifully.","strategy":"The action incorporates the fall-rise tone and links back to the character and meaning effectively."},{"mnemonic":"See Quasimodo throwing a ball in the air, with a dog leaping after it across the sand dunes, their movements light and bouncy.","strategy":"Connecting the character to the meaning through dynamic action creates a memorable visual effect."},{"mnemonic":"Visualize Quasimodo tumbling playfully down the sand dune as his dog joyfully follows, marking the excitement of their bond.","strategy":"This illustrates the fall and rise, connecting movement slips directly to the essence of a dog in a fun setting."}]],
 ["玄",[{"mnemonic":"Imagine Xena ascending a sand dune, revealing a mysterious dark cave.","strategy":"Xena represents the initial 'x', the sand dune symbolizes 'uan', and the rising tone matches her ascension to the cave."},{"mnemonic":"Visualize Xena climbing up a dune, where shadows hint at something mysterious.","strategy":"The climbing reflects the rising tone, with the dark shadows connected to the meaning of mystery."},{"mnemonic":"Picture Xena looking up at the dark skies while standing on a sand dune.","strategy":"'Looking up' matches the rising tone and incorporates both locations and the mysterious aspect."},{"mnemonic":"Envision Xena rising from the shadows toward the top of a sand dune.","strategy":"This rising action fits the tone while also emphasizing the darkness associated with the character's meaning."},{"mnemonic":"Think of Xena triumphantly standing atop a sand dune, with dark clouds swirling around her.","strategy":"The triumph reflects a rising action, with sand dune for final and darkness for meaning."}]],
 ["玉",[{"mnemonic":"Imagine Yoda throwing a precious piece of jade into the desert at sunset.","strategy":"The action of 'throwing' reflects the sharp falling tone, with Yoda for the initial and desert representing 'u'."},{"mnemonic":"Visualize Yoda dropping jade into the hot desert sand, watching it vanish.","strategy":"The dropping action aligns with the falling tone, while Yoda and desert symbolize the respective components."},{"mnemonic":"Picture Yoda presenting a jade stone to travelers lost in the desert.","strategy":"This visual links the precious meaning with the falling action of presenting it dramatically."},{"mnemonic":"Envision Yoda signaling for attention before dropping a jade stone in the sparkling desert.","strategy":"The signaling builds anticipation before the sharp fall of the stone, maintaining the tone's essence."},{"mnemonic":"Think of Yoda glaring sharply at someone who dares to take jade from the desert.","strategy":"The glare fits the sharp action of tone 4, while combining the character's context and location."}]],
 ["瓜",[{"mnemonic":"Imagine Gandalf calmly resting on a sand dune, slicing a juicy melon.","strategy":"The character '瓜' starts with 'g' for Gandalf, is linked to 'ua' for Sand Dune, has a steady tone representing the calmness of Gandalf and conveys the meaning of 'melon' through the action of slicing."},{"mnemonic":"Visualize Gandalf, standing firmly on a sand dune, holding a watermelon as the sun sets.","strategy":"Gandalf captures the 'g' initial, while the sand dune represents 'ua'. The sunset tone symbolizes calmness, linking to the meaning of 'melon' through the visual of the watermelon."},{"mnemonic":"Picture Gandalf meditating on a sand dune surrounded by ripe melons basking in the sunlight.","strategy":"The meditation represents calmness which corresponds with the tone 1, linking 'g' to Gandalf and 'ua' to Sand Dune, emphasizing the relaxation and visualization of melons."},{"mnemonic":"Imagine Gandalf throwing a melon from the top of a sand dune, as it rolls gently down.","strategy":"The action of throwing (not sharp) indicates a steady tone 1, with 'g' linking to Gandalf and 'ua' to Sand Dune while visualizing the rolling melon."},{"mnemonic":"Visualize Gandalf picnic on a sand dune, feasting on assorted melons.","strategy":"The picnic is a calm and steady action, solidifying the initial 'g' with Gandalf, using the sand dune for the final and the melons emphasize the meaning."}]],
 ["瓦",[{"mnemonic":"Imagine Wonder Woman flying over the savanna, her lasso weaving down to pick up a gleaming tile.","strategy":"The character '瓦' starts with 'w' for Wonder Woman, connects to 'a' for Savanna, and the rising and dipping motion of flying matches tone 3 while emphasizing the meaning as the tile is collected."},{"mnemonic":"Picture Wonder Woman gracefully soaring above the savanna, gathering colorful tiles as she swoops down.","strategy":"The swooping action embodies tone 3's rise and fall, uses 'w' for Wonder Woman and 'a' for Savanna, depicting the meaning of 'tile' in a vibrant way."},{"mnemonic":"Visualize Wonder Woman defending the savanna, using tiles as shields that she can dip and rise in battle.","strategy":"The shield action aligns with tone 3, linking 'w' to Wonder Woman and 'a' to Savanna while reinforcing the meaning as she defends with tiles."},{"mnemonic":"Imagine Wonder Woman playfully tossing tiles to the ground from the air as she flies high above the savanna.","strategy":"The playful tossing indicates the rise and fall of tone 3, and connects 'w' with Wonder Woman, 'a' with Savanna, and illustrates the meaning of tiles."},{"mnemonic":"Picture Wonder Woman crafting a mosaic of tiles on the savanna, dipping to pick the right pieces.","strategy":"The crafting action describes dipping and rising for tone 3, associating 'w' with Wonder Woman, 'a' with Savanna, and tile making reflects the meaning."}]],
 ["甘",[{"mnemonic":"Visualize Gandalf strolling through the wetlands, tasting the sweetness of ripe berries.","strategy":"The initial 'g' for Gandalf, the wetlands for 'an', and the steady walking action aligns with tone 1 while depicting the meaning of 'sweet' through the taste."},{"mnemonic":"Imagine Gandalf calmly meditating in the wetlands while surrounded by blooming sweet flowers.","strategy":"The meditation is a calm action for tone 1, linking 'g' to Gandalf, 'an' to Wetlands, and emphasizing sweetness through the flowers."},{"mnemonic":"Picture Gandalf harvesting honey from a tree in the wetlands, enjoying its sweet taste.","strategy":"Harvesting highlights a calm and steady action, associates 'g' with Gandalf and 'an' with Wetlands, directly linking to the meaning of sweetness."},{"mnemonic":"Imagine Gandalf creating a sweet potion from the plants found in the wetlands.","strategy":"The potion-making process aligns with the calmness of tone 1, while 'g' connects with Gandalf, 'an' with Wetlands, and emphasizes sweetness."},{"mnemonic":"Visualize Gandalf gently floating a sweet leaf sample on a calm wetland pond.","strategy":"The floating leaf elucidates a calm action for tone 1, linking 'g' to Gandalf, 'an' to Wetlands, reinforcing the meaning with the visual of sweetness."}]],
 ["生",[{"mnemonic":"Imagine Shrek nurturing a small garden at the base of a mountain, promoting life and growth.","strategy":"The initial 'sh' for Shrek, the mountain for 'eng', with the calm nurturing action aligns with tone 1 and reinforces the meaning of growth and life."},{"mnemonic":"Visualize Shrek peacefully planting seeds on a mountainside, watching them grow.","strategy":"The planting action indicates a calm and steady process, linking 'sh' to Shrek, 'eng' to Mountain, while emphasizing the growth aspect of life."},{"mnemonic":"Picture Shrek watering plants in his mountain garden, cherishing the cycle of life.","strategy":"The act of watering represents calm and steady attention to growth, connecting 'sh' with Shrek, 'eng' to Mountain, and depicting the essence of life."},{"mnemonic":"Imagine Shrek surrounded by life as he climbs the mountain, tending to wildflowers as a sign of growth.","strategy":"Climbing is a steady action aligning with tone 1, while 'sh' connects to Shrek, 'eng' to Mountain, with life symbolized by the wildflowers."},{"mnemonic":"Visualize Shrek nurturing a mountain forest full of vibrant life.","strategy":"The nurturing action resonates with calmness in tone 1, linking 'sh' to Shrek and 'eng' to Mountain, with the forest representing growth and life."}]],
 ["用",[{"mnemonic":"Picture Yoda suddenly diving into a lagoon to retrieve a tool he needs to use.","strategy":"The initial 'y' for Yoda, 'ong' for Lagoon, and the diving action connects with tone 4 indicating sharpness while emphasizing the meaning of use."},{"mnemonic":"Visualize Yoda quickly jumping into the lagoon, demonstrating how to use the Force.","strategy":"Yoda represents 'y', the lagoon stands for 'ong', and the jump portrays the sudden action of tone 4, linking to the meaning of utilizing the Force."},{"mnemonic":"Imagine Yoda sending a quick splash into the lagoon to show how to use an object underwater.","strategy":"The splash represents a sharp action aligning with tone 4, connecting 'y' with Yoda, 'ong' to Lagoon, accentuating the concept of use."},{"mnemonic":"Picture Yoda using a paddle to navigate swiftly through the lagoon water.","strategy":"The paddling motion denotes a sudden action for tone 4, linking 'y' to Yoda, 'ong' to Lagoon, directly illustrating the idea of 'to use.'"},{"mnemonic":"Visualize Yoda summoning items from the bottom of the lagoon that he needs to use.","strategy":"The summoning action emphasizes a sharp, quick downward motion for tone 4, while 'y' links with Yoda, 'ong' with Lagoon, portraying the essence of use."}]],
 ["田",[{"mnemonic":"Tarzan climbs up a tree in a lush meadow full of fields.","strategy":"This mnemonic uses Tarzan (initial 't') to represent a person, the meadow (final 'ian') to represent the location, and the action of climbing up to match the rising tone (tone 2). The field's meaning is visualized through the setting."},{"mnemonic":"Tarzan swings high over a green meadow, exemplifying the abundance of fields.","strategy":"Here, Tarzan again represents the initial 't', with 'meadow' as the final. The swinging high action fits the rising tone while emphasizing the meaning of the character as it relates to fields."},{"mnemonic":"Tarzan hops joyfully in a sunny meadow filled with golden fields.","strategy":"The joy of hopping conveys the rising tone, while connecting Tarzan and the meadow effectively illustrates the character's meaning."},{"mnemonic":"Tarzan climbs a tall hill in a workman's field full of crops.","strategy":"This imagery includes a hill in the meadow representing the initial and final, aligning the action with the tone to visualize the meaning."},{"mnemonic":"Tarzan takes a deep breath of fresh air in a peaceful field.","strategy":"This mnemonic incorporates Tarzan and the meadow again, enhancing the tone with a calm action while reinforcing the character's association with land."}]],
 ["疋",[{"mnemonic":"Pocahontas suddenly tosses a piece of cloth down into a valley.","strategy":"Pocahontas represents the initial 'p', while the valley symbolizes the final 'i'. The sudden toss fits the falling tone, and the cloth matches the meaning."},{"mnemonic":"Pocahontas drops a colorful piece of cloth as she glides down into the valley.","strategy":"In this variant, the action of gliding reflects the falling tone (tone 4), connecting Pocahontas and the valley to represent the character's meaning."},{"mnemonic":"Pocahontas flings a vibrant piece of cloth that spirals down into the valley.","strategy":"The spiraling motion matches the sudden action of tone 4, while the mention of vibrant cloth directly links to the meaning."},{"mnemonic":"Pocahontas throws a piece of cloth from the top of the valley, showcasing her craft.","strategy":"The throw signifies the sharp falling tone, and the focus on Pocahontas's craftsmanship connects well to the character's meaning."},{"mnemonic":"Pocahontas swiftly drops a piece of cloth that flutters down into the lush valley.","strategy":"Swift dropping signifies the tone, and the lush valley reinforces the final while highlighting the piece of cloth's relevance."}]],
 ["疒",[{"mnemonic":"Nemo suddenly rushes out of the jungle, feeling sick.","strategy":"Nemo represents the initial 'n', while the jungle symbolizes the final 'ang'. The sudden rush conveys the falling tone and relates to the meaning of sickness."},{"mnemonic":"Nemo quickly swims away from the jungle, avoiding illness.","strategy":"The swift movement aligns with the urgent tone while indirectly referencing the illness and emphasizing Nemo's association."},{"mnemonic":"Nemo dives under water to escape the jungle's sickness.","strategy":"Here, the action of diving under water conveys the desperate urgency of tone 4 while linking back to the meaning through the jungle."},{"mnemonic":"Nemo feels a wave of sickness as he darts out of the jungle.","strategy":"The abrupt feeling of sickness fits the falling tone and portrays Nemo's rush as he exits the environment."},{"mnemonic":"Nemo sprints from the jungle, struggling against sudden sickness.","strategy":"Sudden action reflects tone 4 and reinforces the connection to the character’s meaning amidst the environment."}]],
 ["癶",[{"mnemonic":"Tarzan leaps up onto a stone in the steppe, emphasizing his strong feet.","strategy":"Tarzan represents the initial 't', and the steppe signifies the final 'eng'. The upward leap fits the rising tone and highlights the meaning of foot."},{"mnemonic":"Tarzan climbs higher on the rocks in the steppe, using his powerful feet.","strategy":"The climbing action captures the rising tone while linking Tarzan and the steppe to the meaning of foot."},{"mnemonic":"Tarzan raises one foot up on a boulder in the expansive steppe.","strategy":"Raising a foot conveys the uplifting motion representative of tone 2 while connecting to the visual through the environment."},{"mnemonic":"Tarzan hops excitedly across the steppe, his feet patting the ground.","strategy":"The action of hopping conveys the rising tone and emphasizes foot-related activities in the steppe."},{"mnemonic":"Tarzan balances on one foot at the edge of the steppe, showcasing his agility.","strategy":"Balancing represents a steady rise in action, coupling all elements cleanly while visualizing the concept associated with the character."}]],
 ["白",[{"mnemonic":"Imagine Bilbo Baggins, climbing up the green hills of an island, feeling the cool breeze as the sun sets making everything glow white.","strategy":"Bilbo represents the initial 'b', the island represents the final 'ai', and the upward climb embodies the rising tone. The white glow symbolizes the meaning of the character."},{"mnemonic":"See Bilbo standing on a snowy island, slowly ascending a white mountain.","strategy":"Bilbo stands for the 'b' initial, the snow represents the white meaning, and the ascent signifies the rising tone."},{"mnemonic":"Bilbo is exploring a white sandy beach on a tropical island, where the sun shines bright.","strategy":"This imagery connects Bilbo with 'b', the beach's brightness corresponds to 'white', and the uplifting vibe reflects the rising tone."},{"mnemonic":"Picture Bilbo running joyfully across an island covered in a white mist.","strategy":"Bilbo captures the initial, the mist represents the color white, and the joyfully running depicts the rising tone."},{"mnemonic":"Envision Bilbo reaching the top of a snow-covered hill on an island, seeing a white owl fly up.","strategy":"Bilbo for 'b', the snowy hill for 'white', and the ascension of the owl indicates the rising tone."}]],
 ["皮",[{"mnemonic":"Visualize Pocahontas standing at the edge of a lush valley, her skin glowing under the sun as she watches the colorful flowers bloom.","strategy":"Pocahontas represents 'p', the valley reflects 'i', and the vibrant growth indicates the rising tone while the glow symbolizes skin."},{"mnemonic":"Imagine Pocahontas swimming in a clear stream flowing through a valley, her skin shimmering with the sunlight.","strategy":"Pocahontas captures the initial, the stream illustrates 'valley', and the shimmering effect portrays the rising tone linked to skin."},{"mnemonic":"Picture Pocahontas running through a valley, noticing the soft texture of her skin contrasting against the green grass.","strategy":"Pocahontas personifies 'p', the valley captures 'i', and the action shows the rising tone alongside the meaning of skin."},{"mnemonic":"See Pocahontas climbing to a higher spot in the valley, feeling the warmth of the sun on her skin.","strategy":"Pocahontas for 'p', the valley for 'i', with the climbing representing the rising tone, while the warmth relates to skin."},{"mnemonic":"Imagine Pocahontas painting her face in the valley, showing the beautiful texture of her skin under the afternoon sun.","strategy":"Pocahontas embodies the initial, the valley the final, and the painting act riding the rising tone connects all elements."}]],
 ["皿",[{"mnemonic":"Picture Moana gently scooping water into a shallow dish found in a valley, dipping her hands and watching the water bounce back.","strategy":"Moana represents 'm', the dish connects to 'i', and the dipping action signifies the fall-rise tone, while the valley embodies the surrounding environment."},{"mnemonic":"Envision Moana creating a dish from clay in a valley, where the clay dips and bubbles up as she molds it.","strategy":"Moana illustrates 'm', the dish corresponds to 'i', and molding the clay represents the motion of the fall-rise tone."},{"mnemonic":"Imagine Moana exploring a valley with a dish filled with fruits, where she dips to pick them up, then rises back up to admire them.","strategy":"Moana captures 'm', the fruits connect to the final 'i', and the picking action indicates the fall-rise tone."},{"mnemonic":"See Moana dancing in the valley, dipping down to lift a dish of treasures from the clean water, then rising again.","strategy":"The dance signifies Moana as 'm', the dish as 'i', and the motion of dipping up aligns with the fall-rise tone."},{"mnemonic":"Visualize Moana brilliantly painting a dish placed on a table in the valley, dipping her brush into paint and lifting it up.","strategy":"Moana is for 'm', the colorful dish for 'i', with the dipping brush representing the fall-rise tone in her masterpiece."}]],
 ["目",[{"mnemonic":"Imagine Moana standing in the desert, directly looking at a sunken eye symbol painted on the ground, as she suddenly blinks downwards.","strategy":"Moana for 'm', the desert represents 'u', and the sharp blink down evokes the falling tone with emphasis on the meaning of eye."},{"mnemonic":"Picture Moana gazing sharply at the horizon from a sand dune in the desert, feeling her eyes dry from the heat.","strategy":"Moana stands for 'm', the sand dune represents 'u', and the sharp gaze reflects the falling tone illustrating the meaning."},{"mnemonic":"See Moana quickly squinting her eyes as she walks through the shimmering desert, noticing an eye-catching oasis in the distance.","strategy":"Moana captures 'm', the desert defines 'u', and the sudden squinting conveys the falling tone towards the eye's focus."},{"mnemonic":"Envision Moana crouching low on the sandy desert floor, peering downwards through her eyelashes like a sharp eye of an eagle.","strategy":"Moana for 'm', the desert for 'u', with the crouching action providing a sharp visual cue for the falling tone linked to eye."},{"mnemonic":"Visualize Moana in the desert, suddenly looking directly down at a bright pair of eyes drawn in the sand.","strategy":"Moana illustrates 'm', the desert for 'u', and the direct downwards gaze represents the sharpness of the falling tone related to eye."}]],
 ["矛",[{"mnemonic":"Moana climbs up a waterfall with her spear.","strategy":"Moana represents the initial 'm', the waterfall relates to the final 'ao', and her action of climbing captures tone 2."},{"mnemonic":"Moana holds her spear high as she ascends the waterfall.","strategy":"The image depicts Moana (initial 'm') using the spear (meaning) at a waterfall (final 'ao') while rising (tone 2)."},{"mnemonic":"As Moana approaches the waterfall, she raises her spear like a triumphant warrior.","strategy":"This maintains the essence of Moana (initial 'm'), the waterfall (final 'ao'), and conveys a rising triumph (tone 2)."},{"mnemonic":"Moana's spear sparkles as she climbs the refreshing waterfall.","strategy":"The sparkle symbolizes the clarity of purpose (meaning), the climbing action indicates rising (tone 2), aligning with Moana (initial 'm') and 'ao' (waterfall)."},{"mnemonic":"Moana's spear glints in the sun as she ascends the cascading waterfall.","strategy":"This visual connects Moana with the 'm' initial, represents the action of ascending for tone 2, and illustrates the meaning effectively."}]],
 ["矢",[{"mnemonic":"Shrek shoots an arrow down into the valley.","strategy":"Shrek represents the 'sh' initial, the valley corresponds to the 'i' final, and shooting down matches the falling motion of tone 4."},{"mnemonic":"As Shrek aims, his arrow dives sharply into the valley below.","strategy":"This keeps Shrek (initial 'sh'), the valley (final 'i'), and the sharp downward action (tone 4) together while emphasizing the meaning."},{"mnemonic":"Shrek releases his arrow which plummets down into the valley.","strategy":"The plummet conveys tone 4's quick descent, retains Shrek's character for the initial, and connects with the arrow's meaning."},{"mnemonic":"In a fit of laughter, Shrek lets loose an arrow that falls sharply into the valley.","strategy":"The emotion connects to the character (initial 'sh'), the falling action denotes tone 4, and the arrow signifies the meaning."},{"mnemonic":"Shrek stands atop the valley, releasing an arrow that drops rapidly.","strategy":"This imagery captures the 'sh' character, 'i' valley final, and a sharp fall indicating tone 4 while linking to the meaning of an arrow."}]],
 ["石",[{"mnemonic":"Shrek discovers a stone rising from the valley.","strategy":"Shrek is the representation of 'sh', the valley correlates with 'i', and the rising action captures tone 2."},{"mnemonic":"As Shrek walks in the valley, he watches a stone ascend magically.","strategy":"This keeps Shrek (initial 'sh'), the valley (final 'i'), and the magic of rising signifies tone 2, while conveying the meaning of stone."},{"mnemonic":"Shrek excitedly points at the stone that is elevating from the valley.","strategy":"This action of pointing relates to the initial 'sh', the valley for the final 'i', and the exciting elevation corresponds to tone 2."},{"mnemonic":"In awe, Shrek sees a stone float up from the valley ground.","strategy":"This imagery combines Shrek (initial 'sh'), the valley (final 'i'), and the upward motion for tone 2, emphasizing the stone's meaning."},{"mnemonic":"Amidst the valley, Shrek observes a stone rising towards the sky.","strategy":"Here, Shrek represents the initial, the valley acts as the final, with the rising action portraying tone 2 while highlighting the meaning of stone."}]],
 ["示",[{"mnemonic":"Shrek dramatically shows his friends the valley.","strategy":"Shrek captures the 'sh' initial, valley relates to 'i', and the dramatic action signifies the sharp motion of falling (tone 4)."},{"mnemonic":"Shrek makes a grand gesture to show the valley's wonders.","strategy":"This mnemonic emphasizes the action of showing with Shrek (initial 'sh'), the valley (final 'i'), and a sharp motion (tone 4)."},{"mnemonic":"With a broad gesture, Shrek shows the hidden treasures of the valley.","strategy":"The broad gesture implies a vivid show (meaning), retains Shrek for the initial, valley for the final, and the falling motion for tone 4."},{"mnemonic":"Shrek points sharply downwards to show the valley below.","strategy":"This sharp pointing action indicates falling (tone 4), Shrek is the initial, and the valley connects with the final, relating to the meaning."},{"mnemonic":"As Shrek reveals the valley, he suddenly drops his hand to show the splendor.","strategy":"The sudden drop captures tone 4, connects Shrek with 'sh', the valley as 'i', while highlighting the meaning of showing."}]],
 ["禸",[{"mnemonic":"Imagine Robin Hood, the legendary archer, quickly dropping down into a canyon to follow a mysterious footprint.","strategy":"Using Robin Hood for 'r', the canyon for 'ou', and the action of falling to convey tone 4."},{"mnemonic":"Picture Robin Hood rappelling down the canyon's steep walls while searching for a footprint of a lost treasure.","strategy":"Maintains the character of Robin Hood and the canyon scenery, with a falling action to match the tone."},{"mnemonic":"Visualize Robin Hood tracing a footprint as he tumbles and rolls down the canyon.","strategy":"Incorporates Robin Hood's persona, a canyon setting, and a sharp action to reflect the character's meaning."},{"mnemonic":"Think of Robin Hood swiftly diving into a canyon, trying to catch the elusive footprint.","strategy":"Emphasizes the falling motion with Robin Hood and the canyon as the backdrop to the mnemonic."},{"mnemonic":"Imagine Robin Hood plummeting into a canyon where he spots a strange footprint on the ground.","strategy":"Utilizes the visual action of falling to connect with the character and meaning of footprint."}]],
 ["禾",[{"mnemonic":"Visualize Hagrid planting seeds that grow into grains as they rise up against the backdrop of a shimmering glacier.","strategy":"Combines Hagrid for 'h', the glacier for 'e', and the rising action to illustrate growth associated with grain."},{"mnemonic":"Picture Hagrid watching as grain stalks reach upward towards the ice peaks of a glacier.","strategy":"Incorporates the character of Hagrid in a glacier setting with an uplifting gesture matching tone 2."},{"mnemonic":"Imagine Hagrid feeding grains to a giant creature while standing on a glacier with the grains rising from his palms.","strategy":"Reflects the meaning of grain via interaction with Hagrid, using a glacier setting and a rising portrayal."},{"mnemonic":"Think of Hagrid shouting joyfully as he sees grains sprouting up towards the towering glacier above.","strategy":"Focuses on the emotive reaction of joy, Hagrid's character, and the environmentally-dominant glacier."},{"mnemonic":"Imagine Hagrid attempting to harvest grains from beneath a glacier, which he sees towering above him.","strategy":"Uses the action of yearning to rise from the glacier setting with an aspect of grain harvesting."}]],
 ["穴",[{"mnemonic":"Picture Xena, the warrior princess, dramatically plunging into a dark cave that opens into a serene bay.","strategy":"Xena represents the initial 'x', the bay the final 'ue', combined with a downward motion for the tone."},{"mnemonic":"Imagine Xena diving headfirst into a cave, discovering a hidden bay with sparkling waters at the bottom.","strategy":"Captures the essence of the cave and bay setting linked by Xena and a sharp downward action."},{"mnemonic":"Visualize Xena hiking along the bay's shores, then unexpectedly slipping into a cave that emerges beneath the waves.","strategy":"Integrates Xena’s character with the falling dynamic of slipping into a cave while maintaining the bay's environment."},{"mnemonic":"Envision Xena scaling the cliff by the bay when she suddenly falls into a mysterious cave below.","strategy":"Focuses on a sudden motion connected to Xena, guiding into the cave and bay scene effectively."},{"mnemonic":"Imagine Xena heroically plunging into a cave that has a beautiful view of the bay inside.","strategy":"Maintains the dramatic action of falling, with the cave and bay combined to convey the overall meaning."}]],
 ["立",[{"mnemonic":"Visualize Legolas quickly standing firm on a cliff above a valley, ready to shoot arrows down.","strategy":"Legolas symbolizes the initial 'l', while the valley represents 'i', and the act of falling matches the tone."},{"mnemonic":"Imagine Legolas standing gracefully at the edge of the valley, where he suddenly loses his footing and tumbles down.","strategy":"Focuses on standing action of Legolas, the valley context, and the falling tone."},{"mnemonic":"Picture Legolas establishing a small camp in a valley, only to be surprised by a sudden fall.","strategy":"Describes the essence of standing while establishing the location and action of falling."},{"mnemonic":"Think of Legolas standing tall as he gazes into the beautiful valley when a sudden gale knocks him off balance.","strategy":"Connects the standing action of Legolas with the valley scenery, emphasizing action as tone."},{"mnemonic":"Imagine Legolas poised to stand guard over the valley when a strong wind sends him tumbling down.","strategy":"Emphasizes the action of falling combining with Legolas’s character and valley visuals."}]],
 ["竹",[{"mnemonic":"Picture Zorro riding on horseback through a vast desert, where bamboo plants suddenly spring up around him.","strategy":"Zorro signifies 'z', desert for 'u', with bamboo rising up to represent tone 2."},{"mnemonic":"Imagine Zorro twirling his sword as he unexpectedly sees bamboo shoots rising among the sand dunes of the desert.","strategy":"Maintains Zorro in action, set against a desert backdrop with bamboo plants emphasizing rising dynamics."},{"mnemonic":"Visualize Zorro planting bamboo seeds in the desert, watching as they bloom and rise high into the air.","strategy":"Combines Zorro's nature, the desert environment, and planting action to fit tone and meaning."},{"mnemonic":"Think of Zorro laughing as he witnesses the bamboo growing rapidly in the sandy desert, reaching for the sun.","strategy":"Incorporates Zorro's playful character, desert context, and an uplifting portrayal of bamboo."},{"mnemonic":"Envision Zorro surrounding himself with bamboo as he rides through the wilderness of the desert, feeling joyful.","strategy":"Captures the joyfulness of Zorro amidst bamboo rising in the expansive desert landscape."}]],
 ["米",[{"mnemonic":"Moana dips her hand into the valley, scooping up shimmering grains of rice that rise like waves.","strategy":"Moana for the initial 'm', the valley for the final 'i', and the action of scooping up rice represents the tone 3, which involves a dip and rise."},{"mnemonic":"Picture Moana sailing through a valley filled with rice crops, bending over to collect as the sun sets, creating a warm glow.","strategy":"Moana symbolizes the initial, the valley captures the final, and the action captures the essence of rice."},{"mnemonic":"Visualize Moana hopping from grain to grain of rice in the valley, making them bounce up as she goes.","strategy":"This representation combines Moana's character, the valley environment, and a playful bouncing motion, linking to the final aspect."},{"mnemonic":"Moana triumphantly raises a handful of rice from the valley as she celebrates her harvest.","strategy":"The act of raising the rice integrates the meaning into the visual and contextual aspect of the mnemonic."},{"mnemonic":"Moana listens carefully as the wind rustles through the valley of rice, dipping low then rising high.","strategy":"The sound of rice swaying mirrors the concept of rising, enhancing the mnemonic's connection to the tone."}]],
 ["糸",[{"mnemonic":"Simba fiercely pounces down into a valley covered in glistening silk threads.","strategy":"Simba symbolizes the initial 's', the valley gives the location, and Simba's sudden pounce represents the tone 4 action linked to silk."},{"mnemonic":"Picture Simba weaving through the valley, leaving a trail of shimmering silk strands behind him.","strategy":"Simba is the character for the initial, the valley serves as the final, and the weaving motion embodies the meaning of silk."},{"mnemonic":"Simba stands in the valley, suddenly catching the light as silk sways in the wind.","strategy":"The visual of silk in motion conveys its meaning while connecting Simba to the initial and valley to the final."},{"mnemonic":"Imagine Simba climbing over the valley, snapping silk threads as he goes with a sharp movement.","strategy":"Simba's climbing activity represents the initial and mirrors the action of breaking silk threads, creating a cohesive story."},{"mnemonic":"Simba tugs at a piece of silk hanging in the valley, pulling it sharply downward.","strategy":"This emotive action uses the tone 4 to reinforce the connection to silk via a downward motion."}]],
 ["缶",[{"mnemonic":"King Kong bangs a jar against the canyon wall, the sound echoing sharply.","strategy":"King Kong for the initial 'k', canyon as the final 'ou', and banging represents a sudden action correlating nicely with the character's meaning."},{"mnemonic":"Imagine King Kong holding a huge jar, poised to drop it into the canyon below.","strategy":"This visualizes the character and integrates both the tone and meaning seamlessly into context."},{"mnemonic":"King Kong runs through the canyon with a jar, suddenly stopping to pound it against the rock.","strategy":"The sudden action is representative of the falling tone while incorporating the character and its surrounding environment."},{"mnemonic":"Visualize King Kong lifting a jar high above the canyon, then crashing it down to the ground.","strategy":"The action aligns with the character's persona while directly connecting with the jar's representation."},{"mnemonic":"King Kong roars as he shakes a jar violently near the canyon's edge, causing all to tremble.","strategy":"This emphasizes the sharpness of King Kong's action, resonating with both the tone and the meaning of the jar."}]],
 ["网",[{"mnemonic":"Wonder Woman gracefully swoops down into a volcanic crater to catch butterflies in her net.","strategy":"This mnemonic connects Wonder Woman (representing 'w') with a vivid action of swooping down into the location of a volcanic crater (representing 'ang'), matching the falling-rising tone (3) as she dips and rises while catching butterflies, thereby visually emphasizing the character's meaning of 'net'."},{"mnemonic":"Imagine Wonder Woman throwing a net over the edge of a volcano, skillfully pulling the net back up.","strategy":"This variation highlights the action of throwing and pulling back the net in the context of a volcano, emphasizing the character's role and reinforcing the visual association with '网'."},{"mnemonic":"Wonder Woman stands at the top of a volcano, letting her net flutter in the warm breeze.","strategy":"This representation utilizes the static visual of Wonder Woman at the volcano, linking the gentle motion of the net with the concept of '网' while maintaining the associations."},{"mnemonic":"Wonder Woman dips her net into a volcanic crater, ready to snag the elusive fire sprites.","strategy":"This mnemonic creates a vivid image of action as Wonder Woman interacts directly with the net in the setting of a volcano, reinforcing the essence of her character and the meaning of '网'."},{"mnemonic":"In the lava landscape of the volcano, Wonder Woman casts her net among the glowing embers.","strategy":"This scene combines the fiery environment of the volcano and the visual specificity of the net, linking back to '网' through the imagery of glowing embers and strong actions."}]],
 ["羊",[{"mnemonic":"Yoda climbs up to the top of the volcano, a fluffy sheep perched on his shoulder.","strategy":"This mnemonic depicts Yoda in a climbing action (rising tone 2) while directly associating the imagery of a sheep with the meaning of '羊'."},{"mnemonic":"Imagine Yoda ascending the volcano with a string of goats following him up the rocky path.","strategy":"Directly linking Yoda's upward journey provides both action and meaning, fitting the character's design with '羊'."},{"mnemonic":"Yoda stands on the rim of the volcano, raising a sheep high above his head.","strategy":"This captures the rising action while focusing on the visual pairing of Yoda and the sheep, reinforcing the character association."},{"mnemonic":"As Yoda gazes into the volcano, sheep emerge from the smoke, gradually rising into view.","strategy":"Creating a mystical imagery combines the rising action with the setting while highlighting the meaning of sheep."},{"mnemonic":"Picture Yoda gently lifting a fluffy sheep up the slope of the volcano, guiding it wisely.","strategy":"This illustrates both the friendly tone and the representation of a sheep, ensuring clear visual association."}]],
 ["羽",[{"mnemonic":"Yoda suddenly leaps into the rainforest, a feather fluttering sharply from his hand.","strategy":"Yoda's sudden action represents the initial and tone, while the rainforest illustrates the location of the final."},{"mnemonic":"In the rainforest, Yoda deftly slices through the air, a sudden plume of feathers filling the space.","strategy":"The sharpness of the action accentuates the meaning of 'feather,' linking all elements."},{"mnemonic":"Yoda catches a feather in the rainforest, making a sharp, sudden movement as birds take flight.","strategy":"This emphasizes the character of Yoda while referencing both the action and the visual aspect."},{"mnemonic":"Yoda suddenly stops in the rainforest as feathers swirl around him, a sharp reminder of wings.","strategy":"The suddenness and sharp visual represent both the character and the meaning effectively."},{"mnemonic":"Yoda commands the rainforest to unleash a storm of feathers, suddenly flying around him.","strategy":"The commanding tone evokes a sharp action, reinforcing the meaning of 'wing' or 'feather.'"}]],
 ["老",[{"mnemonic":"Legolas gazes at the waterfall, the water dipping and rising, reminding him of the age of the trees.","strategy":"Legolas represents the initial, the waterfall for the final, and the up-and-down motion reflects the meaning of old age."},{"mnemonic":"In the forest, Legolas listens as the old waterfall dips and rises quietly through the ages.","strategy":"This connects the age connotation of the meaning with nature visually through the waterfall."},{"mnemonic":"Legolas stands by the waterfall, observing how the constant flow reminds him of the ancient wisdom of the elders.","strategy":"The action resonates with the tone of dip and rise, reinforcing the meaning of 'old'."},{"mnemonic":"As the waterfall cascades down, Legolas contemplates the age-old tales whispered by the flowing water.","strategy":"The waterfall's sound represents time, while Legolas symbolizes youth juxtaposed with age."},{"mnemonic":"Legolas watches the old waterfall, dipping low, before rising back up again, echoing the passage of time.","strategy":"The visual of the waterfall complements the meaning of old, establishing a clear mnemonic."}]],
 ["而",[{"mnemonic":"Robin Hood strolls along the riverbend, lightly flowing between 'and' and 'but' like a gentle breeze.","strategy":"Robin Hood indicates the initial, the riverbend captures the final, and the motion mimics the light tone."},{"mnemonic":"At the riverbend, Robin Hood effortlessly skips stones, each shift representing 'and' or 'but' in conversation.","strategy":"The action of skipping reflects the gentle nature of tone five, weaving in the meaning."},{"mnemonic":"Robin Hood rests by the riverbend, pondering a light, fleeting thought connecting 'and' with 'but'.","strategy":"This mnemonic connects the light motion to the passage of thought between the words."},{"mnemonic":"As he walks along the riverbend, Robin Hood senses a gentleness that weaves 'and' into 'but' effortlessly.","strategy":"The seamless transition aligns with the essence of the character's common usage."},{"mnemonic":"Robin Hood watches water flow at the riverbend, where every ripple illustrates the nuances of 'and' and 'but'.","strategy":"The flowing action visually encapsulates the meaning while keeping the character and sound intact."}]],
 ["耒",[{"mnemonic":"Imagine Legolas standing on an Island, suddenly plowing through the sand with his sharp arrows.","strategy":"Legolas represents the initial 'l', the Island symbolizes the final 'ai', the action of plowing matches the sharp tone 4, and the meaning relates to agriculture."},{"mnemonic":"Picture Legolas, with a determined look, suddenly plunging his sword into the ground at an Isle, turning it into furrows.","strategy":"Visualizing Legolas engaging in an action on an island connects the character and motion."},{"mnemonic":"Visualize Legolas casually plowing an Island, as a wave crashes over him, symbolizing a decisive action.","strategy":"Combines a calm image with a sharp action to symbolize tone and maintain character relevance."},{"mnemonic":"Think of Legolas fiercely creating long lines in the sand of the Island as if he were plowing.","strategy":"The fierce image reinforces the meaning while the location and character solidify the auditory aspects."},{"mnemonic":"Imagine Legolas swiftly plowing the soil of an Island, while his arrows cut through the sky.","strategy":"This pairs motion with character and location effectively, while aligning with the character's meaning."}]],
 ["耳",[{"mnemonic":"Picture Robin Hood stealthily crouching in a Valley, listening closely with his ears perked.","strategy":"Robin Hood represents the initial 'r', the Valley symbolizes the final 'i', the ear aligns with the meaning, and the attentive action conveys the tone."},{"mnemonic":"Imagine Robin Hood in a Valley, suddenly raising and lowering his bow to listen for sounds.","strategy":"The motion of the bow helps depict the tone while retaining the theme of listening."},{"mnemonic":"Visualize Robin Hood with big ears peeking out from behind a rock in a Valley, avidly listening.","strategy":"Uses sounds and visual aspects to embed both the meaning and appearance into the mnemonic."},{"mnemonic":"See Robin Hood slowly nodding his head in a Valley, implying he can hear the whispers of nature.","strategy":"Movement in a natural setting enhances the meaning while portraying a calm and attentive demeanor."},{"mnemonic":"Consider Robin Hood with exaggerated ear sizes, perking them up in the Valley at any sound.","strategy":"Exaggeration aids memory while tying in character, meaning, and environment."}]],
 ["聿",[{"mnemonic":"Imagine Yoda swiftly sketching in the desert sand with a brush, his motions quick and precise.","strategy":"Yoda represents 'y', the Desert symbolizes the final 'u', the sharp motion aligns with tone 4, and the idea of writing relates to the character's meaning."},{"mnemonic":"Visualize Yoda wielding a paintbrush in the Desert, creating intricate designs on the sand.","strategy":"Painting with such precision reinforces both the action and purpose of the character."},{"mnemonic":"Think of Yoda gracefully sweeping his brush over the sand, creating figures that seem to come alive.","strategy":"The graceful motion contrasts with the sharpness of the tone, providing a memorable visual."},{"mnemonic":"Picture Yoda quickly crafting a scroll with his brush in the Desert, each stroke sharp and intentional.","strategy":"This combines his character with the final location while also communicating the urgency of writing."},{"mnemonic":"Imagine Yoda in an expansive Desert, using his brush to mark his path as a desert painter.","strategy":"The path implies direction and motion, reinforcing the writing aspect while binding the mnemonic elements."}]],
 ["肉",[{"mnemonic":"Imagine Robin Hood descending sharply into a canyon filled with delicious meats.","strategy":"Robin Hood represents the 'r' initial; the canyon symbolizes the '-ou' final, and the sharp descent reflects the tone 4."},{"mnemonic":"Robin Hood dropped down into a canyon, hunting for a big feast of meat.","strategy":"The character and action reflect 'r' for Robin Hood and the 'meat' meaning, with the location and action tied to tone."},{"mnemonic":"Picture Robin Hood's arrow dropping into a canyon full of barbecued meats.","strategy":"Combining the arrow as a sharp action with the food in the canyon directly connects to the character's meaning and tone."},{"mnemonic":"Robin Hood dives into the canyon's dark depths to find succulent meat.","strategy":"The diving action mirrors tone 4 while emphasizing the meaning of meat in the visual representation."},{"mnemonic":"Visualize Robin Hood suddenly rising from below the canyon, holding juicy meat.","strategy":"The sharp action combined with Robin Hood and the meat situates tone 4 vividly alongside the character meaning."}]],
 ["臣",[{"mnemonic":"Captain Planet climbs towards a forest, where minsters gather to discuss plans.","strategy":"Captain Planet symbolizes the 'c' initial, the forest represents the '-en' final, and the climbing motion captures tone 2."},{"mnemonic":"Imagine Captain Planet uplifting a group of ministers, guiding them into the forest.","strategy":"The uplifting action reflects tone 2, connecting the character to the setting and meaning."},{"mnemonic":"Visualize Captain Planet rising from the treetops of a forest to speak with a minister.","strategy":"The rising motion indicates tone 2 while capturing the essence of the minister as a central figure."},{"mnemonic":"Picture Captain Planet ascending a hill in the forest, where ministers wait to hear his message.","strategy":"The climb and meeting highlight the ministerial aspect relative to the character and setting."},{"mnemonic":"Captain Planet soars toward a forest where he supervises the ministers' gathering.","strategy":"Soaring action provides a clear visual while connecting with tone 2 and reinforcing the character's meaning."}]],
 ["自",[{"mnemonic":"Zorro slices down into the valley, declaring his independence and self-reliance.","strategy":"Zorro embodies 'z', the valley stands for '-i', and the downward slice captures tone 4."},{"mnemonic":"Imagine Zorro diving sharply into a valley, proclaiming his identity and self-worth.","strategy":"The action's sharpness reflects tone 4, while emphasizing the self aspect and the valley context."},{"mnemonic":"Visualize Zorro's sword falling into the valley as he asserts himself.","strategy":"The sword slice represents a sharp action linked to self-definition through visual and meaning."},{"mnemonic":"Zorro drops dramatically into the valley, symbolizing a descent into self-discovery.","strategy":"The dramatic drop connects tone 4 with self-driven identity and visual representation."},{"mnemonic":"Picture Zorro in the valley, brandishing his sword downward, marking his territory of self.","strategy":"The action connects tone's sharpness with the visual representation of self, further ingraining the concept."}]],
 ["至",[{"mnemonic":"Zeus descends from the sky into the valley, demonstrating power as he arrives.","strategy":"Zeus represents 'zh', the valley symbolizes '-i', and the sharp drop evokes tone 4."},{"mnemonic":"Imagine Zeus casting his thunderbolt sharply into the valley, signifying his arrival.","strategy":"The thunderbolt's action reflects tone 4, highlighting the powerful sense of arriving."},{"mnemonic":"Visualize Zeus landing heavily in the valley, shaking the ground as he comes to visit.","strategy":"The landing emphasis aligns with sharp actions and context of arrival, representing the essence."},{"mnemonic":"Zeus strikes downward into the valley, arriving with thunderous impact.","strategy":"The striking action embodies tone 4, solidifying the visual and meaning through arrival."},{"mnemonic":"Picture Zeus standing in the valley, declaring his arrival with a booming voice.","strategy":"The declaration aligns with sharp tone 4 while anchoring the central idea of arrival."}]],
 ["臼",[{"mnemonic":"Imagine Jane Goodall, the famous primatologist, suddenly dropping a mortar in a canyon with a great thud.","strategy":"Jane Goodall represents the 'j' sound, the canyon represents 'ou', and the action of dropping conveys the sharp falling tone."},{"mnemonic":"Visualize Jane resting a large mortar at the edge of a steep canyon, then it suddenly tips over and crashes to the bottom.","strategy":"The resting represents the shape, and the tipping action relates to the tone."},{"mnemonic":"Picture Jane observing her mortar from a height, then it abruptly falls into a canyon.","strategy":"Observing represents stabilization (the flat of the action), and the abruptness provides the falling tone."},{"mnemonic":"Envision Jane hiking through a canyon carrying a mortar, but then she trips and it falls suddenly.","strategy":"Tripping encapsulates the action character for falling, while the canyon symbolizes the final."},{"mnemonic":"Jane is seen meditating calmly with her mortar beside her when suddenly a rock falls into the canyon, creating a loud noise.","strategy":"Meditating represents calmness, and the loud noise conveys the sudden falling action."}]],
 ["舌",[{"mnemonic":"Imagine Shrek sitting on a glacier, his tongue stretching upwards towards the sky as he smiles.","strategy":"Shrek embodies the 'sh', the glacier forms the 'e', and the action of stretching conveys the rising tone."},{"mnemonic":"Visualize Shrek tasting the cool water from a melting glacier, and as he does so his tongue dramatically rises up.","strategy":"Tasting connects to the meaning of tongue, with the rising action matching the tone."},{"mnemonic":"Picture Shrek sliding down a glacier with his tongue extended, as if to lick the ice, rising with excitement.","strategy":"Sliding adds mobility and excitement, capturing the tone's rising action."},{"mnemonic":"Envision Shrek at the glacier, where he lets out a big laugh that makes his tongue rise up in joy.","strategy":"Laughing conveys upliftment, and his presence solidifies the initial and final."},{"mnemonic":"Shrek plays with his tongue as he walks on a glacier, gradually raising it while taking in the view.","strategy":"Walking denotes action, with the glacier representing the environment and the tongue rising portraying the tone."}]],
 ["舛",[{"mnemonic":"Envision Chun-Li sprinting across a sand dune, then suddenly slipping and falling down the slope.","strategy":"Chun-Li symbolizes 'ch', the sand dune is the 'uan', and slipping showcases the sharp falling action."},{"mnemonic":"Chun-Li jumps from one side of the sand dune to the other, her movement suddenly halting mid-air.","strategy":"The jump embodies crossing, while the abrupt halt captures the tone."},{"mnemonic":"Imagine Chun-Li making great strides across a sand dune when an avalanche of sand suddenly buries her.","strategy":"Strides emphasize forward movement (crossing), while the avalanche illustrates the falling feeling."},{"mnemonic":"Picture Chun-Li executing a powerful kick on a sand dune, causing it to crumble away underneath her suddenly.","strategy":"The kick represents crossing/quick motion, with the sudden collapsing sand symbolizing the tone."},{"mnemonic":"Chun-Li navigates two dunes but suddenly trips between them, bouncing back to re-cross.","strategy":"Navigating shows crossing, while the sudden trip emphasizes the sharpness of tone four."}]],
 ["舟",[{"mnemonic":"Imagine Zeus calmly floating on a boat down a tranquil canyon river, enjoying the view.","strategy":"Zeus represents the 'zh', the canyon symbolizes 'ou', and the calm floating reflects the flat tone."},{"mnemonic":"Visualize Zeus steering his boat gently through a wide canyon, unbothered by any waves.","strategy":"Steering emphasizes control, and the serene canyon maintains the calmness associated with tone one."},{"mnemonic":"Picture Zeus resting on his elaborate boat as it drifts peacefully along a canyon, underlining his calm demeanor.","strategy":"Resting illustrates tranquility, while the boat connects meaning with the visual appearance."},{"mnemonic":"Envision Zeus casting a gentle spell that makes his boat glide smoothly across a placid canyon.","strategy":"Casting magic depicts tranquility, and the gliding movement aligns with the flat tone."},{"mnemonic":"Zeus can be seen fishing off the side of his boat in a calm canyon environment, representing stability.","strategy":"Fishing illustrates a steady and calm action, while the canyon symbolizes the final."}]],
 ["艮",[{"mnemonic":"Imagine Gandalf abruptly stopping a group of travelers in a dark forest with a sharp gesture.","strategy":"Gandalf represents the 'g', the forest symbolizes 'en', and the sudden stop captures the sharpness of the tone."},{"mnemonic":"Visualize Gandalf blocking passage in the forest with his staff, creating a sudden halt to forward movement.","strategy":"Blocking conveys cessation, while the sharp action aligns with the falling tone."},{"mnemonic":"Picture Gandalf pointing toward a dangerous path in the forest, suddenly commanding everyone to stop.","strategy":"Pointing indicates a sudden action, and commanding reflects the urgency of halting."},{"mnemonic":"Envision Gandalf raising his staff suddenly, casting a spell that creates an abrupt stop in the forest.","strategy":"Raising denotes action, with the spell reflecting sharpness that matches the tone."},{"mnemonic":"Gandalf stands guard at the entrance of the forest, making a sudden motion that warns all to cease.","strategy":"Standing guard represents vigilance, while the warning action emphasizes the sharp, falling tone."}]],
 ["色",[{"mnemonic":"Imagine Simba suddenly diving into a colorful glacier, representing different colors of ice.","strategy":"The character '色' (color) is visualized with Simba (s) at a glacier (e) making a sharp dive (tone 4)."},{"mnemonic":"Picture Simba standing on a vibrant glacier, striking a powerful pose filled with colors.","strategy":"This visualizes Simba (s) on a glacier (e), using his energy in a sudden, strong manner (tone 4)."},{"mnemonic":"Visualize Simba painting a colorful glacier, showing various shades.","strategy":"Simba (s) painting creates an impactful action (tone 4) alongside the idea of color (meaning)."},{"mnemonic":"Envision Simba leaping off a glacier to capture the essence of color in the air.","strategy":"The leap symbolizes a sudden action (tone 4), connecting with color (meaning) at a glacier (e)."},{"mnemonic":"Think of Simba sliding down a colorful glacier where the ice reflects different hues.","strategy":"Simba (s) sliding represents tone 4's sharpness while the glacier (e) is tied to the character's meaning."}]],
 ["艸",[{"mnemonic":"Imagine Captain Planet gracefully dipping and rising through a lush grassy area near a waterfall.","strategy":"Captain Planet (c) represents the initial, moving through grass (艸) near a waterfall (ao), depicting tone 3 by dipping and rising."},{"mnemonic":"Visualize Captain Planet planting grass that waves gently as the waterfall cascades down.","strategy":"This ties together Captain Planet (c) with waterfall (ao) while the action represents the motion of growing grass (艸)."},{"mnemonic":"Picture Captain Planet riding the mist from a waterfall while grass sways all around.","strategy":"The image of lifting and swaying connects well with the idea of grass (艸) and the dynamic nature of a waterfall (ao), showing tone 3."},{"mnemonic":"Envision Captain Planet creating a thick grasslands area that leads to a magnificent waterfall.","strategy":"This action showcases the intertwining of grass (艸) and waterfall (ao), with movement representing tone 3."},{"mnemonic":"Imagine Captain Planet's powers transforming a waterfall into a grassy landscape.","strategy":"The transformation accentuates the motion needed for tone 3 while linking grass (艸) to the nature theme."}]],
 ["虍",[{"mnemonic":"Imagine Hagrid confronting a ferocious tiger on the edge of a steep mountain.","strategy":"Hagrid (h) relates to the action against a tiger (虍) at a mountain (eng) with the sudden is sharpness (tone 4)."},{"mnemonic":"Visualize Hagrid waking a tiger with a sudden roar echoing down the mountain.","strategy":"The roar signifies sudden action (tone 4), merging with the character meaning of tiger (虍) and a mountain (eng)."},{"mnemonic":"Picture Hagrid climbing a mountain with a tiger stalking behind him, creating tension.","strategy":"The climb illustrates a sharp tension (tone 4) as it intertwines Hagrid (h) and tiger (虍) among mountains (eng)."},{"mnemonic":"Envision Hagrid taming a tiger that leaps off a mountain, creating an intense scene.","strategy":"The leap adds suddenness (tone 4), and it’s connected to Hagrid (h) and the fierce imagery of tiger (虍) at mountain (eng)."},{"mnemonic":"Think of Hagrid feeding a tiger, while they both overlook a vast mountain landscape.","strategy":"This action showcases sharpness of sudden movements (tone 4) while encompassing the tiger's meaning (虍) and the mountain (eng)."}]],
 ["虫",[{"mnemonic":"Imagine Chun-Li gracefully stepping over a colorful insect on her way to an oasis.","strategy":"Chun-Li (ch) stepping symbolizes a rising action (tone 2), connecting the insect (虫) over an oasis (ong)."},{"mnemonic":"Visualize Chun-Li dancing with insects fluttering around her as she approaches an oasis.","strategy":"The dance reflects uplifting movement (tone 2) and resonates well with the insect's meaning (虫) near the oasis (ong)."},{"mnemonic":"Picture Chun-Li leaping over a grassy area full of insects to reach an oasis.","strategy":"The leap denotes rising motion (tone 2) while engaging with insects (虫) leading to the oasis (ong)."},{"mnemonic":"Envision Chun-Li training in the air as insects buzz around her by an oasis.","strategy":"Training in the air represents a rising action (tone 2), while insects link directly to their meaning and the oasis (ong)."},{"mnemonic":"Think of Chun-Li coaxing insects towards a shimmering oasis with her powerful kicks.","strategy":"This idea evokes rising energy (tone 2) and beautifully aligns the insect (虫) while highlighting the oasis (ong)."}]],
 ["血",[{"mnemonic":"Xena runs sharply through the rainforest, as the blood of her enemies spills onto the ground.","strategy":"Xena represents the initial 'x'. The rainforest symbolizes the final '-ue'. The sharp action reflects Tone 4, while 'blood' is the meaning, visualizing the spill."},{"mnemonic":"Xena dramatically drops down in the rainforest, clutching a wound where blood flows.","strategy":"Xena represents 'x', the rainforest is '-ue', dropping down matches Tone 4 and aligns with the meaning blood flowing from a wound."},{"mnemonic":"Xena slices through the dense rainforest, her sword causing blood to splatter.","strategy":"Xena symbolizes 'x', the rainforest provides '-ue', and 'slices' represents Tone 4, with blood as the central theme."},{"mnemonic":"Xena shrieks as she falls from a tree in the rainforest, landing in a pool of blood.","strategy":"The fall illustrates Tone 4, while 'blood' echoes the meaning and employs visual imagery of fallen Xena in a lush rainforest."},{"mnemonic":"Xena thrusts her sword down in the rainforest, where blood stains the roots of trees.","strategy":"The downward thrust signifies Tone 4, Xena corresponds to 'x', the rainforest to '-ue', with blood being the visual anchor."}]],
 ["行",[{"mnemonic":"Hagrid climbs up the steep sides of a volcano crater, joyfully walking towards the top.","strategy":"Hagrid symbolizes 'h', the volcano crater provides '-ang', and 'climbs' matches the rising action of Tone 2, with 'to walk' as the theme."},{"mnemonic":"Hagrid steps carefully around the edges of a volcano crater, rising higher with every step.","strategy":"The action of carefully stepping suggests rising (Tone 2), with Hagrid for 'h' and crater for '-ang', alluding to the meaning of walking."},{"mnemonic":"Hagrid raises his arms and walks exuberantly around the crater of the volcano.","strategy":"The raising action indicates Tone 2, while Hagrid represents 'h', the crater symbolizes '-ang', integrating walking as the meaning."},{"mnemonic":"Hagrid enthusiastically strolls up the sides of the volcano crater, waving to his friends below.","strategy":"The enthusiastic action shows rising in Tone 2, Hagrid zeros into 'h', the crater for '-ang', while 'to walk' fuels the scene."},{"mnemonic":"Hagrid hops up playfully around the volcano crater, showcasing his love for walking.","strategy":"The playful hops reflect rising (Tone 2), with Hagrid as 'h', crater illustrating '-ang', and 'to walk' being integral."}]],
 ["衣",[{"mnemonic":"Yoda stands calmly in a valley, wearing a long robe made of shimmering clothes.","strategy":"Yoda symbolizes 'y', the valley captures '-i', and the calm stance corresponds with Tone 1, holding onto the meaning of clothes."},{"mnemonic":"Yoda strikes a steady pose in the valley, showcasing his majestic clothes.","strategy":"The steady pose matches Tone 1 (flat), with Yoda for 'y', focusing on the valley as '-i' and 'clothes' as the center."},{"mnemonic":"Yoda floats effortlessly across the valley, his robes flowing like clothes in the wind.","strategy":"Floating indicates calm (Tone 1), with Yoda for 'y', valley for '-i', and 'clothes' as a key visual."},{"mnemonic":"Yoda meditatively walks through the valley, radiating tranquility in his traditional clothes.","strategy":"Walking meditation shows a flat, calm demeanor (Tone 1), Yoda as 'y', valley links to '-i', with clothes as the theme."},{"mnemonic":"Yoda gazes flatly across the valley, admiring the vibrant colors of his clothes.","strategy":"Gazing flatly ties to Tone 1, Yoda is 'y', valley symbolizes '-i', and clothes remain visually prominent."}]],
 ["襾",[{"mnemonic":"Yoda hovers gently over the savanna, casting a light cover with his cloak.","strategy":"Yoda signifies 'y', the savanna correlates to '-a', floating represents Tone 5, while 'to cover' illustrates the visual meaning."},{"mnemonic":"Yoda lightly drapes his cloak over a small savanna bush, providing cover.","strategy":"Lightly draping matches the fleeting feel of Tone 5, 'y' is represented by Yoda, and '-a' is the savanna, with 'to cover' in focus."},{"mnemonic":"Yoda skips lightly across the savanna, covering the ground with vibrant patches of color.","strategy":"Skipping lightly represents Tone 5, Yoda is 'y', savanna ties to '-a', while 'to cover' serves as the meaning."},{"mnemonic":"Yoda gently passes over the savanna, his cloak softly covering the grass.","strategy":"Gently passing implies a light touch (Tone 5), Yoda as 'y', savanna for '-a', connecting to 'to cover' visually."},{"mnemonic":"Yoda pauses in the savanna, his cloak sweeping down to cover the earth.","strategy":"Pausing suggests neutrality (Tone 5), represented by Yoda for 'y' and the savanna as '-a', focusing on covering."}]],
 ["見",[{"mnemonic":"Jane Goodall dips down to examine the flowers in the meadow and then rises to see the animals.","strategy":"Jane as 'j', meadow for 'ian', with the motion of dipping and rising illustrating the fall-rise tone."},{"mnemonic":"Jane bends down and rises up to see all around the beautiful meadow.","strategy":"Using Jane for the 'j', meadow for 'ian', and the bending and rising for the tone."},{"mnemonic":"Jane squats and peeks under a bush in the meadow, then rises excitedly to see what's there.","strategy":"The action of squatting and rising reflects tone 3, with Jane and meadow following the associations."},{"mnemonic":"Jane crouches low to see the tiny creatures in the meadow, then stands tall to admire the view.","strategy":"The central idea of seeing is captured through the action of crouching (fall) and standing (rise), with Jane and meadow representing the character's initials and finals."},{"mnemonic":"Jane sees both the ground and the sky as she dips down and then rises in the meadow.","strategy":"Engaging with both low and high sights reflects the fall-rise tone, with associations for 'j' and 'ian'."}]],
 ["角",[{"mnemonic":"Jane points towards the waterfall's edge where the horn-shaped rocks jut out.","strategy":"Jane represents 'j', the waterfall symbolizes 'iao', and the pointing action captures the fall-rise tone."},{"mnemonic":"Jane bends down to examine a unique angle of the waterfall, then stands back to appreciate its beauty.","strategy":"With Jane representing 'j', 'waterfall' as 'iao', and her action of bending and rising for the tone."},{"mnemonic":"As Jane sees an angular rock formation near the waterfall, she dips down and rises up in excitement.","strategy":"The action of movement encapsulates the fall-rise tone, with Jane and waterfall involved."},{"mnemonic":"Jane crouches to get a better look at the waterfall's angles, then springs up in delight.","strategy":"This illustrates a fall-rise action, with Jane for 'j' and waterfall for 'iao'—associated with the meaning."},{"mnemonic":"Jane admires the sharp angles of the rocks beside the flowing waterfall in a dip and rise motion.","strategy":"The imagery of angles follows the character's meaning, with Jane and waterfall structuring the associations."}]],
 ["言",[{"mnemonic":"Yoda rises above the wetlands, teaching the creatures to communicate with words.","strategy":"Yoda (initial y) represents a wise figure, wetlands (final an) symbolizes a place of communication, and the rising action represents tone 2."},{"mnemonic":"As Yoda hops up in the wetlands, he utters profound words to the animals.","strategy":"Hopping represents rising action (tone 2), while Yoda embodies the initial and wetlands the final."},{"mnemonic":"Yoda climbs a wetland hill, sharing wisdom through his speech.","strategy":"Climbing implies rising (tone 2), maintaining the association with Yoda and wetlands."},{"mnemonic":"With a gentle rise in his voice, Yoda speaks words of encouragement to the wetland creatures.","strategy":"Emphasizing the rising tone with Yoda reinforces the meanings of speech and the environment."},{"mnemonic":"Yoda, standing knee-deep in the wetlands, raises his hand and begins to speak.","strategy":"The action of raising his hand reinforces the rising nature of tone 2 while Yoda's presence frames both the initial and meaning."}]],
 ["谷",[{"mnemonic":"Gandalf strolls down into the gorge, then suddenly leaps up with joy at the beauty of the valley.","strategy":"The action of strolling down then leaping up visualizes the fall-rise of tone 3."},{"mnemonic":"In the valley, Gandalf dips down to examine the flowers before rising to greet the sun.","strategy":"Dipping down and rising represents tone 3 while linking Gandalf (initial) and valley (final)."},{"mnemonic":"As Gandalf ventures into the gorge, he bends down to gather herbs, then rises to continue his journey.","strategy":"Bending and rising effectively illustrate the motions of tone 3."},{"mnemonic":"Gandalf navigates the valley, bending low to touch the earth before rising up to cast a spell.","strategy":"This sequence of actions portrays the fall-rise nature of the tone."},{"mnemonic":"Delving deep into the gorge, Gandalf dashes down to grab a gem, then celebrates his find by rising up high.","strategy":"The sequence of actions encapsulates the meaning of the character and reflects tone 3."}]],
 ["豆",[{"mnemonic":"David Attenborough quickly drops a large bean into the canyon while narrating its journey.","strategy":"Dropping represents tone 4, linking Attenborough (initial) and canyon (final) to the action."},{"mnemonic":"In an excited tone, David tosses beans over the edge of the canyon, explaining their significance.","strategy":"The bean's movement downward visualizes tone 4 alongside the characters associated."},{"mnemonic":"David leans over the canyon and lets a bean fall, emphasizing the importance of nature.","strategy":"Leaning demonstrates the falling action significant to tone 4."},{"mnemonic":"With a swift motion, David drops bean seeds into the canyon, highlighting conservation.","strategy":"The abrupt action conveys the sharpness of tone 4 in connection with meaning."},{"mnemonic":"David Attenborough stands at the canyon's edge, letting beans tumble down as he discusses their role in ecosystems.","strategy":"The act of tumbling playful represents tone 4 sharply while covering all associations."}]],
 ["豕",[{"mnemonic":"Shrek happily runs up the valley, chasing after a little pig.","strategy":"Shrek (initial) represents character, elevated running embodies tone 2, with valley implying location."},{"mnemonic":"With a chuckle, Shrek dashes up the valley after a pig, uplifting the day.","strategy":"Dash encapsulates rising action (tone 2) in a playful scenario with characters."},{"mnemonic":"Shrek joyously climbs the hillside in the valley to rescue a lost pig.","strategy":"The climbing action illustrates tone 2 while Shrek and the pig's connection to meaning is clear."},{"mnemonic":"As Shrek climbs to the valley’s peak, he spots a pig below, smiling with delight.","strategy":"The climbing action reinforces the rising tone, maintaining character consistency."},{"mnemonic":"Shrek bounds up the valley, thrilled to find a pig playing in the grass.","strategy":"Bounding implies a joyful upwards movement (tone 2) as part of a narrative including meanings."}]],
 ["豸",[{"mnemonic":"Imagine Zeus throwing a bolt of lightning down on an island overrun with vermin.","strategy":"Zeus represents the pinyin initial 'zh', the island represents the final 'ai', while the action of throwing the lightning captures the falling tone and conveys the meaning of vermin as something needing to be gotten rid of."},{"mnemonic":"Zeus stands on an island, suddenly striking at the pests invading his domain.","strategy":"This reinforces 'zh' with Zeus's power and associates 'ai' with island, and the sudden action corresponds to the tone and the character's meaning."},{"mnemonic":"Zeus, in a decisive moment, clears an island of vermin with a swift gust of wind.","strategy":"This demonstrates the initial and final while embedding the concept of action and suddenness to represent tone 4."},{"mnemonic":"Picture Zeus on an island, suddenly raising a shield against relentless pests.","strategy":"Zeus as a character reinforces initial 'zh', the island for 'ai', while the shield action embodies suddenness linked to the tone."},{"mnemonic":"Zeus swiftly vanquishes the vermin on the island with a clap of thunder.","strategy":"This uses vivid imagery of Zeus for 'zh', the island for 'ai', and adds action suggesting the sudden tone, aligning it with the meaning."}]],
 ["貝",[{"mnemonic":"Bilbo Baggins suddenly unearths a shiny treasure shell at the cliffside.","strategy":"Bilbo represents the initial 'b', cliffside signifies the final 'ei', and the action of unearthing captures the sudden tone while conveying the meaning of treasure."},{"mnemonic":"Imagining Bilbo at the cliffside, he suddenly trips over a shiny shell that holds treasure.","strategy":"Combines Bilbo for 'b', cliffside for 'ei', and the sudden tripping motion corresponds with tone 4 and the character's meaning."},{"mnemonic":"Picture Bilbo swiftly digging at the cliffside and uncovering a treasure shell.","strategy":"The initial and final are represented while the digging motion conveys suddenness denoting the tone and aligns with the meaning."},{"mnemonic":"Bilbo, unexpectedly, finds a beautiful shell at the edge of a cliffside, linking it to treasure.","strategy":"Bilbo strengthens the initial, cliffside the final, and the unexpected action denotes sudden tone while reinforcing the meaning of treasure."},{"mnemonic":"Bilbo suddenly reveals a sparkling shell from behind a cliffside rock, a treasure in disguise.","strategy":"Uses Bilbo for the initial, cliffside for the final, and the revealing action reflects the suddenness of tone while highlighting the meaning."}]],
 ["赤",[{"mnemonic":"Chun-Li swiftly kicks down a red banner in the valley.","strategy":"Chun-Li represents the initial 'ch', valley signifies the final 'i', and the kicking action encapsulates the sudden tone while portraying the meaning of red."},{"mnemonic":"Chun-Li suddenly unveils the color red by flipping a massive stone in the valley.","strategy":"This imagery combines the initial with Chun-Li, the valley for the final, and the action of unveiling conveys suddenness and the color red."},{"mnemonic":"Picture Chun-Li dramatically revealing a valley filled with vibrant red flowers.","strategy":"Her action of revealing captures sudden transformation, linking it to the tone while using imagery to ground the meaning of red."},{"mnemonic":"Chun-Li performs a swift sweep to uncover a valley splashed in red paint.","strategy":"This uses the character for the initial, the valley for the final, and an action suggesting the tone while encapsulating the meaning."},{"mnemonic":"Chun-Li suddenly stands in a red valley, the color brightening around her effortlessly.","strategy":"This mnemonic highlights her for the initial, the valley for the final, and the overwhelming brightness ties in with suddenness of tone while reinforcing the meaning."}]],
 ["走",[{"mnemonic":"Zorro swiftly dashes down into a canyon, bouncing from one edge to the next.","strategy":"Zorro illustrates the initial 'z', the canyon represents the final 'ou'; the action of dashing and bouncing encapsulates the fall-rise tone while portraying running or walking."},{"mnemonic":"Picture Zorro playfully running along the canyon's edges, effortlessly springing back.","strategy":"This showcases Zorro for the initial, the canyon for the final and the playful action captures the tone while emphasizing motion."},{"mnemonic":"Zorro bounces through the canyon, making quick yet smooth steps.","strategy":"Using Zorro for 'z' and the canyon for 'ou', while the bouncing action illustrates the rise and fall tone linked to the meaning tied to motion."},{"mnemonic":"Zorro suddenly leaps to the canyon's edge, running back and forth before making a final dash.","strategy":"This uses Zorro for the initial and canyon for the final, with the dramatic leaps symbolizing the rise and fall tone to connect with the action of running."},{"mnemonic":"Zorro bounces lightly across the canyon floor, showcasing a dance of movement.","strategy":"This highlights Zorro for the initial while the canyon stands for the final, with a bouncing dance representing the vocal tone alongside the meaning of movement."}]],
 ["足",[{"mnemonic":"Zorro suddenly kicks off his boots in the desert, showcasing his bare foot.","strategy":"Zorro stands for the 'z' initial, the desert for 'u' final, while the action of kicking signifies the sudden tone emphasizing the meaning of foot."},{"mnemonic":"Picture Zorro dramatically taking off across the desert, his feet kicking up sand.","strategy":"This encompasses Zorro for the initial, desert for the final, while the kicking action denotes suddenness highlighting the meaning of foot."},{"mnemonic":"Zorro finds himself in the desert, unexpectedly planting his foot into the warm sands.","strategy":"Combines Zorro with the initial and the desert with the final, while the action illustrates the suddenness of the tone connected to the meaning."},{"mnemonic":"Zorro suddenly stops in the desert, firmly planting one foot in the ground.","strategy":"Zorro visualizes the initial, the desert signifies the final, with the planting action embodying the tone and meaning linked to足."},{"mnemonic":"Zorro kicks his foot onto the warm desert sands, summoning a quick response from the earth.","strategy":"This highlights Zorro for 'z', the desert for 'u', while the kick denotes sudden action pertaining to both the tone and meaning."}]],
 ["身",[{"mnemonic":"Shrek stands calmly in the Forest, embracing his body.","strategy":"Shrek represents the initial 'sh', the Forest denotes the final 'en', and the calm standing captures the flat motion of Tone 1, highlighting the meaning of 'body'."},{"mnemonic":"Shrek extends his arms in the Forest, showing confidence.","strategy":"Arms outstretched depict calmness (Tone 1) while Shrek and the Forest convey the initial and final seamlessly related to the concept of body."},{"mnemonic":"Shrek feels his body in the tranquil Forest.","strategy":"The action of feeling represents the calm nature of Tone 1, while Shrek and the Forest clearly connect to the character's meaning."},{"mnemonic":"Shrek strolls through the Forest, proud of his body.","strategy":"The action of strolling denotes the steady calm of Tone 1, indicating the meaning of self with Shrek and the environment as the Forest."},{"mnemonic":"Shrek relaxes in the shade of the Forest, appreciating his body.","strategy":"Relaxation underscores the flat motion of Tone 1, while Shrek shows the initial and Forest the final, alluding to the meaning of 'oneself'."}]],
 ["車",[{"mnemonic":"Chun-Li drives a sleek car across the Glacier.","strategy":"Chun-Li signifies the initial 'ch', the Glacier represents 'e', and the flat action of driving represents Tone 1, matching the meaning of 'car'."},{"mnemonic":"Chun-Li races her car, gliding over the Glacier.","strategy":"Racing suggests the calm yet steady action of Tone 1 while illustrating Chun-Li and the Glacier, encapsulating the essence of vehicle."},{"mnemonic":"Chun-Li’s car stops steadily at the edge of the Glacier.","strategy":"The action of stopping denotes steadiness (Tone 1), with Chun-Li and Glacier reinforcing the connection to the meaning of 'vehicle'."},{"mnemonic":"Chun-Li parks her car next to the majestic Glacier.","strategy":"Parking mirrors the flat nature of Tone 1 while easily integrating the character associations and meaning of 'car'."},{"mnemonic":"Chun-Li zooms over the Glacier in her fast car.","strategy":"The swift motion suggests the calm aspect of Tone 1, entwined with the character references and the vehicle meaning."}]],
 ["辛",[{"mnemonic":"Xena calmly navigates the Tundra, tasting the bitterness of her journey.","strategy":"Xena stands for the initial 'x', the Tundra signifies the final 'in', and the steady navigation summarizes Tone 1 while introducing the meaning of bitterness."},{"mnemonic":"Xena faces the Tundra's challenges, resilient and ready.","strategy":"Facing challenges embodies a calm readiness (Tone 1), while Xena and Tundra create a vivid connection to the meaning of辛苦 (hard work)."},{"mnemonic":"Xena experiences the bitter cold of the Tundra, remaining strong.","strategy":"Experiencing bitterness in a flat manner connects with Tone 1, and the blend of Xena and Tundra presents the theme connected to辛."},{"mnemonic":"Xena meditates amidst the Tundra's harsh beauty, reflecting on its bitterness.","strategy":"Meditation conveys calmness (Tone 1) while Xena and the Tundra visually link to the meaning of辛苦."},{"mnemonic":"Xena strides steadily across the Tundra, tasting life's bitter moments.","strategy":"Steady strides reflect Tone 1's flatness and connect with the character's context and meaning simultaneously."}]],
 ["辰",[{"mnemonic":"Chun-Li rises with the sun in the Forest, marking the morning.","strategy":"Chun-Li captures the initial 'ch', the Forest illustrates 'en', and the rising action complements Tone 2, denoting the essence of morning."},{"mnemonic":"Chun-Li climbs a tree in the Forest as dawn breaks.","strategy":"Climbing represents the uplifting movement of Tone 2 while connecting Chun-Li and the Forest to symbolize time and morning."},{"mnemonic":"As the sun rises, Chun-Li trains in the Forest, welcoming the morning.","strategy":"Training ties to an uplifting motion (Tone 2), while integrating the characters and their environment reflects the meaning beautifully."},{"mnemonic":"Chun-Li stretches upwards in the Forest at dawn, embracing the new day.","strategy":"Stretching upwards signifies the rising action of Tone 2, while the context of the characters ties strongly to the meaning of morning and time."},{"mnemonic":"Chun-Li welcomes the morning sun in the peaceful Forest.","strategy":"Welcoming captures the essence of upliftment (Tone 2), with Chun-Li and the Forest amplifying the day’s theme of time."}]],
 ["辵",[{"mnemonic":"Picture David Attenborough, calmly observing the majestic waterfall, before suddenly jumping off the cliff beside it.","strategy":"David represents the letter 'd'. Ao (Waterfall) is visually vivid, and the sudden action of jumping corresponds to tone 4."},{"mnemonic":"Imagine David walking along a path that leads right into a waterfall, feeling the splash as he walks.","strategy":"David for 'd', the waterfall for 'ao', and the action of walking connects to the meaning and visual of the character."},{"mnemonic":"See David navigating through the dense underbrush to reach a towering waterfall, his steps echoing.","strategy":"Again linking David for 'd' and 'ao' for waterfall, with the action of navigating linking the character's meaning."},{"mnemonic":"Visualize David Attenborough walking calmly beside a waterfall, then slipping and falling into the water.","strategy":"The action of falling illustrates the tone falling, while the visual of the waterfall is impactful."},{"mnemonic":"David walks along the path to a waterfall, feeling calm and steady until he suddenly trips and falls.","strategy":"The character's meaning is represented as walking, the tone reflects the sudden motion, all while using the location of a waterfall."}]],
 ["邑",[{"mnemonic":"Picture Yoda resting quietly in a peaceful valley, surrounded by a small town nestled in the hills.","strategy":"Yoda represents the 'y', the valley as 'i', and the neutral resting action corresponds to the tone."},{"mnemonic":"Imagine Yoda floating lightly over a valley where a charming little town is set, enjoying the tranquility.","strategy":"The light floating action matches the neutral tone while referencing the city as the meaning."},{"mnemonic":"Visualize Yoda visiting the valley town, where he sits in quiet meditation, enjoying the serene surroundings.","strategy":"Yoda for the initial, valley for the final, and the seated action captures the resting tone."},{"mnemonic":"See Yoda calmly observing the bustling life in the valley town, quietly contemplating the happenings around him.","strategy":"The visual of a town in a valley ties into the meaning, while observing reflects the neutral tone."},{"mnemonic":"Picture Yoda hovering lightly over a cozy valley, where townsfolk go about their day peacefully.","strategy":"The action of hovering and the imagery of Yoda align with the meaning of settlement and the neutral tone."}]],
 ["酉",[{"mnemonic":"Yoda hops around a canyon, collecting grapes to make wine.","strategy":"Yoda (y) is a vivid character, the canyon (ou) represents the environment, and the action of hopping reflects the tone 3's dipping and rising nature while embodying the meaning of wine."},{"mnemonic":"Yoda is floating above a canyon while pouring wine into a cup.","strategy":"The floating action resonates with tone 3, and the pouring refers to the concept of wine, with Yoda reinforcing the initial."},{"mnemonic":"Yoda climbs up a canyon wall to grab grapes for his wine.","strategy":"Climbing relates to the rise in tone 3, while the imagery of grapes connects directly to the meaning of wine, and Yoda stands for the initial."},{"mnemonic":"Yoda dances gracefully in a canyon, celebrating with a glass of wine.","strategy":"Dancing reflects the motion of tone 3, the canyon depicts the environment, and the celebration emphasizes wine as the meaning."},{"mnemonic":"Yoda gracefully glides through a canyon, holding a wine bottle.","strategy":"Gliding exemplifies the fall-rise motion of tone 3, while the canyon gives context and Yoda serves as the memorable initial."}]],
 ["釆",[{"mnemonic":"Bilbo Baggins crafts a map to distinguish one unique island from another.","strategy":"Bilbo (b) represents the character, the island (ai) provides the environmental context, and the action of crafting a map symbolizes the sharp fall of tone 4, linking to the meaning of distinguishing."},{"mnemonic":"Bilbo falls off a cliff while trying to identify a treasure on the island.","strategy":"The action of falling relates directly to tone 4, while the focus on identifying treasure connects to the meaning of distinguishing with Bilbo as the initial."},{"mnemonic":"Bilbo stands on an island, pointing decisively at the marked treasure spot.","strategy":"Pointing represents a sharp action for tone 4, the island gives location context, and distinguishing treasure connects to the meaning."},{"mnemonic":"Bilbo quickly draws an island on a map, distinguishing it from the rest.","strategy":"The action of quickly drawing reflects the downward motion of tone 4, while distinguishing the island aligns with the meaning."},{"mnemonic":"Bilbo carefully surveys the island, identifying unique features.","strategy":"Surveying invokes a sharp, decisive action consistent with tone 4, while identifying features relates to the meaning of distinguishing, with Bilbo representing the initial."}]],
 ["里",[{"mnemonic":"Legolas leaps up and down in a valley, looking for hidden treasures inside.","strategy":"Legolas (l) represents the character, the valley (i) sets the location, and the action of leaping up and down echoes the fall-rise of tone 3 while emphasizing the meaning of inside."},{"mnemonic":"Legolas kneels inside a valley, searching for something precious.","strategy":"Kneeling down presents the dip of tone 3, the valley describes the environment, and searching underscores the meaning of being inside."},{"mnemonic":"Legolas glides through the valley, peeking inside the cave.","strategy":"Gliding reflects the smooth action of tone 3, while the cave signifies a hidden inside, with Legolas as the memorable initial."},{"mnemonic":"Legolas stands at the edge of the valley, pointing inside to give directions.","strategy":"Pointing signifies a quick rise-action consistent with tone 3, the valley provides the setting, and giving directions corresponds with the meaning of inside."},{"mnemonic":"Legolas explores the valley, discovering a hidden inside area filled with light.","strategy":"Exploring conveys the ebb and flow of tone 3, the valley adds context, while finding a hidden area aligns with the meaning of inside."}]],
 ["金",[{"mnemonic":"Jane Goodall uncovers a gold coin in the icy tundra.","strategy":"Jane (j) represents the character, the tundra (in) is the environment, and the action of uncovering relates to the sharpness of tone 4, linking to the concept of gold/metal."},{"mnemonic":"Jane finds a metallic artifact falling in the tundra.","strategy":"Finding relates to tone 4's falling action, while the metallic artifact ties directly to the meaning of gold/metal, with Jane standing for the initial."},{"mnemonic":"Jane picks up golden nuggets scattered across the tundra.","strategy":"Picking up symbolizes a sudden, sharp action of tone 4, while golden nuggets directly connect to the meaning of gold, and Jane represents the initial."},{"mnemonic":"Jane surveys the tundra, identifying shimmering metals hidden in the snow.","strategy":"Surveying embodies a decisive action, aligning with tone 4, while identifying metals connects to the meaning of gold/metal, with Jane as the recognizable character."},{"mnemonic":"Jane plants a flag in the tundra where she discovers a gold mine.","strategy":"Planting a flag signifies a definitive downward action representing tone 4, while the gold mine correlates with the meaning of gold/metal and Jane signifies the initial."}]],
 ["長",[{"mnemonic":"Imagine Zeus, the mighty god, climbing up a Volcano Crater as his hair grows longer and longer.","strategy":"Zeus represents the initial 'zh'; the Volcano Crater signifies 'ang'; the rising action mirrors the tone, while the concept of growing emphasizes 'long'."},{"mnemonic":"Picture Zeus flying over a Volcano Crater with a long flowing cape, rising majestically into the air.","strategy":"Zeus captures the initial; the volcanic environment for 'ang'; rising action represents the tone; and the cape signifies length."},{"mnemonic":"Visualize Zeus stretching his arms wide at the edge of a Volcano Crater, feeling the height as he grows taller.","strategy":"Zeus acts as the initial reference, the crater fulfills the final; the action is uplifting, emphasizing the character's meaning of 'long'."},{"mnemonic":"Think of Zeus standing atop a Volcano Crater, his height impressively long as he calls out to the skies.","strategy":"In this mnemonic, Zeus provides the initial, the crater the final, with an uplifting tone reflecting the meaning of 'long'."},{"mnemonic":"Envision Zeus soaring above a tall Volcano Crater, his hair blowing long in the wind as he laughs.","strategy":"Zeus stands for the initial 'zh', the Volcano for the final 'ang'; the uplifting laughter associates with the tone while indicating growth."}]],
 ["門",[{"mnemonic":"Moana pushes open a large door made of forest vines, stepping into a lush Forest while climbing up the steps.","strategy":"Moana represents the 'm' initial; the forest serves as 'en'; the uplifting action matches the tone and signifies 'door'."},{"mnemonic":"Imagine Moana dancing through a grand gate made of tree trunks, rising through her excitement in a mystical Forest.","strategy":"Moana is the initial; the forest represents 'en'; her uplifting dance aligns with the tone while highlighting the meaning of 'gate'."},{"mnemonic":"Picture Moana at the entrance of a thriving Forest, the doors made of naturally bent trees rising as she enters.","strategy":"In this mnemonic, Moana embodies the initial; the forest evokes the final; the rising action reflects the tone and signifies entrance."},{"mnemonic":"Visualize Moana pushing aside a wooden door into a magical Forest, filled with excitement as she rises into adventure.","strategy":"Moana gives the initial, the forest serves for the final; the rising emotion aligns with the character's meaning of 'door'."},{"mnemonic":"Envision Moana standing before a grand gate surrounded by a flowering Forest, the greenery climbing towards the sky.","strategy":"Moana carries the initial; the forest connotes the final while the uplifting visual reinforces the meaning of 'gate'."}]],
 ["阜",[{"mnemonic":"Frodo stands on a sharp hill in the Desert, the peak falling down steeply behind him as he gazes at the vastness.","strategy":"Frodo signifies the 'f' initial; the desert represents 'u'; the sharp falling imagery fits the tone and conveys the meaning of 'mound'."},{"mnemonic":"Imagine Frodo sliding off a rocky hill into a steep drop within the Desert, feeling the sharp descent.","strategy":"Frodo represents the initial; the desert serves for the final; the falling action mirrors the tone, while emphasizing the hill."},{"mnemonic":"Picture Frodo at the top of a tall mound in a sun-scorched Desert, the ground dropping suddenly as he peeks over.","strategy":"Frodo embodies the initial; desert stands for final; the sharp drop captures the tone while portraying the mound."},{"mnemonic":"Visualize Frodo cautiously walking down a steep slope in the Desert, feeling the ground sharply drop away beneath him.","strategy":"In this mnemonic, Frodo is the character for the initial; the desert stands as the final; the sharpness reflects the tone and meaning of a hill."},{"mnemonic":"Envision Frodo balancing on a mound in the middle of the Desert, before it sharply falls on one side.","strategy":"Frodo gives the initial; the desert signifies the final; the sharp fall represents the tone, reinforcing the concept of a 'hill'."}]],
 ["隶",[{"mnemonic":"Imagine David Attenborough suddenly pointing sharply towards a valley as he discusses the subordination of animals in the ecosystem.","strategy":"David Attenborough represents the initial 'd', the valley reflects the final 'i', and the sharp action corresponds to the falling tone. The meaning relates to nature's hierarchy."},{"mnemonic":"Picture David Attenborough dramatically falling to the valley floor while narrating stories of the subordinate roles in nature.","strategy":"This again captures 'd', 'i', and embodies the tone 4 through the dramatic fall, emphasizing the character's meaning."},{"mnemonic":"Visualize David Attenborough standing at the edge of a valley, falling down while saying 'You are subordinate to nature!'","strategy":"The vivid image of 'd' and 'i' is enhanced with the action of falling, expressing the character's tense meaning."},{"mnemonic":"Envision David Attenborough slipping at a valley as he talks about the subservient creatures he observes.","strategy":"Combines 'd', 'i', the motion of slipping captures tone 4, while reinforcing the idea of subordination."},{"mnemonic":"Picture David Attenborough delegating work loudly at the valley to lower creatures, showing their subordination.","strategy":"This captures both the initial, final, and the meanings, as well as conveying the sharp tone action."}]],
 ["隹",[{"mnemonic":"Imagine Zeus soaring high above the misty hills, lifting a short-tailed bird into the clouds.","strategy":"Zeus represents initial 'zh', misty hills indicate final 'ui', the uplifting motion symbolizes tone 2, while the meaning related to birds is vividly depicted."},{"mnemonic":"Visualize Zeus rising dramatically above the hills, tossing a short-tailed bird gently into the air.","strategy":"This mnemonic links 'zh' and 'ui' seamlessly while illustrating the uplifting action and bird meaning."},{"mnemonic":"Envision Zeus calling a short-tailed bird to join him for a flight over the misty hills.","strategy":"Combines 'zh', 'ui', and the uplifting call, reinforcing both character meaning and tone."},{"mnemonic":"Picture Zeus triumphantly ascending over the misty hills with a small bird perched on his shoulder.","strategy":"This concept ties the initial, final, and the uplifting tone together while relating directly to the character's meaning."},{"mnemonic":"Imagine Zeus inspiring a short-tailed bird atop the misty hill to take flight joyfully.","strategy":"Matures the representation of 'zh', 'ui', and elevates it with a joyful tone capturing the essence of the character."}]],
 ["雨",[{"mnemonic":"Picture Yoda gracefully dipping and rising in a desert, causing rain to fall from the sky.","strategy":"This connects 'y' with the desert 'u', using a dipping action to embody tone 3 while visualizing rain."},{"mnemonic":"Imagine Yoda bouncing lightly in the desert, summoning drops of rain in dips and rises.","strategy":"The visual aids memory with 'y', 'u', and a playful bouncing action illustrates the character’s meaning."},{"mnemonic":"Visualize Yoda bending down and then rising up swiftly, creating a rainstorm in the desert.","strategy":"This helps register the initial 'y', final 'u', and the motion coupled with the meaning of rain."},{"mnemonic":"See Yoda's shadow dipping low in the desert to gather droplets of rain and then rising again.","strategy":"Links 'y', 'u' together with the action while representing the essence of rainfall."},{"mnemonic":"Picture Yoda swirling in the desert dipping and rising, making clouds gather and rain fall.","strategy":"It synchronizes 'y', 'u', the bouncing motion mirroring tone 3 while vividly depicting rain."}]],
 ["靑",[{"mnemonic":"Imagine Quasimodo serenely climbing a mountain, his cloak shifting between green and blue as he ascends.","strategy":"Quasimodo outlines 'q', the mountain offers 'ing', the steady ascent matches tone 1, while the colors relate to meaning."},{"mnemonic":"Visualize Quasimodo quietly meditating at the mountain summit, surrounded by lush green and blue foliage.","strategy":"Links 'q' and 'ing' with a calm scene evoking the stable tone and the meaning of colors."},{"mnemonic":"Picture Quasimodo fashioning a mountain garden in shades of green and blue that radiate calmness.","strategy":"This helps reinforce the initial, final, tone 1 with a creative representation of the meaning."},{"mnemonic":"Imagine Quasimodo planting green and blue flowers on the mountainside, feeling tranquil.","strategy":"Commemorates 'q', 'ing', with calm planting actions capturing the character's visual meaning."},{"mnemonic":"Visualize Quasimodo carrying stones of green and blue to build a serene altar on the mountain.","strategy":"Pairs 'q' and 'ing' together with a steady action implying the meaning of peace through color."}]],
 ["非",[{"mnemonic":"Frodo stands at the cliffside, suddenly pushing away the darkness, declaring, 'Not here!' as he gazes down.","strategy":"Frodo represents the initial 'f', the cliffside connects to the final 'ei', and the action of pushing away conveys the sharp, sudden nature of tone 4, while the meaning relates to negation."},{"mnemonic":"Frodo leans over the cliffside, shouting 'No!' to the approaching shadows of evil.","strategy":"Frodo for 'f', cliffside for 'ei', and the action of leaning and shouting emphasizes the falling tone, supporting the negation meaning."},{"mnemonic":"Frodo swiftly runs off the cliffside, refusing to face the dark forces behind him.","strategy":"Frodo captures 'f', cliffside embodies 'ei', and the swift motion reflects the sharp tone 4 while representing the act of negation."},{"mnemonic":"Frodo stands at the edge of a cliffside, shaking his head fiercely, saying 'Not today!'","strategy":"Frodo as 'f', cliffside for 'ei', and the shaking of the head captures the falling tone and ties back to the meaning of negation."},{"mnemonic":"Frodo gazes from the cliffside, determinedly declaring 'I will not!' as the wind rushes past.","strategy":"Frodo symbolizes 'f', the cliffside relates to 'ei', and the determined action captures the falling tone, aligning with the character's meaning."}]],
 ["面",[{"mnemonic":"Moana stands in the meadow, looking at her reflection in a pond, asserting, 'This is my face!' and the surrounding sun suddenly drops.","strategy":"Moana for initial 'm', meadow for final 'ian', while the sun's sudden drop captures the falling tone, reinforcing the concept of face and appearance."},{"mnemonic":"Moana touches her face in the sunny meadow, declaring, 'This is my true self,' as the shadows fall.","strategy":"Moana connects to 'm', meadow represents 'ian', and the action of touching her face with the shadow falling captures the meaning of surface/face and falling tone."},{"mnemonic":"In a vast meadow, Moana holds up her mirror to show 'this is my face!' just as the clouds swoop down.","strategy":"Moana for 'm', the meadow as 'ian', and the swooping clouds demonstrate the sharpness of tone 4, all relating to surface recognition."},{"mnemonic":"Moana stands in the meadow, turning her head quickly, saying 'Look at my face!' while the wind suddenly rushes.","strategy":"The quick turn signifies tone 4, Moana as 'm', and the meadow concept of 'ian' relates to the character recognition of face."},{"mnemonic":"Moana poses in the meadow, claiming confidently, 'This is how my face shines!' as the sun falls in the sky.","strategy":"Moana symbolizes 'm', the meadow reflects 'ian', and the sun's descent signifies the falling tone while highlighting the face's meaning."}]],
 ["革",[{"mnemonic":"Gandalf rises above the glacier, declaring, 'Let us reform this land!' as he lifts his staff upward.","strategy":"Gandalf for initial 'g', glacier represents 'e', and the upward lifting action reflects the rising tone correlating to the meaning of reform."},{"mnemonic":"Standing on a glacier, Gandalf shouts 'Upward we must change our fate!' as he feels the cool breeze rising beneath.","strategy":"Gandalf embodies 'g', glacier reflects 'e', and the cooling breeze action conveys the uplifting motion while signifying reform."},{"mnemonic":"Gandalf stretches out his hand above the glacier, announcing, 'It is time to reform!' with the glaciers rising suddenly.","strategy":"Gandalf symbolizes 'g', glacier signifies 'e', with the hand stretch and sudden lift indicating the rising tone linked to the character's meaning."},{"mnemonic":"On the glacier, Gandalf raises his staff high, proclaiming, 'We can reform this world!' as the ice shimmers upwards.","strategy":"Gandalf for 'g', glacier for 'e', and raising the staff captures the rising tone while supporting the meaning of reform."},{"mnemonic":"Gandalf stands firmly on the glacier, exclaiming, 'Change is upon us!' as he feels the rise of the ice beneath.","strategy":"Gandalf reflects 'g', glacier symbolizes 'e', and the rising feeling from the glacier embodies the rising tone alongside reform."}]],
 ["韋",[{"mnemonic":"Wonder Woman races up the cliffside, wielding her lasso, claiming, 'I encircle the truth!' as she climbs higher.","strategy":"Wonder Woman stands for 'w', cliffside connects to 'ei', and her action of rising while declaring captures the uplifting tone related to encircling."},{"mnemonic":"On the cliffside, Wonder Woman spins her lasso, shouting, 'I will encircle the truth!' as the sun shines down.","strategy":"Wonder Woman embodies 'w', cliffside reflects 'ei', and the spinning lasso movement conveys the rising tone while emphasizing the encircling action."},{"mnemonic":"Wonder Woman stands boldly on the cliffside, proclaiming, 'Let me encircle our strength!' as the wind rises around her.","strategy":"Wonder Woman for 'w', cliffside symbolizes 'ei', and the surrounding wind captures the rising tone resonating with encirclement."},{"mnemonic":"As she stands at the cliffside, Wonder Woman declares, 'I shall encircle any foe!' as she ascends the rocky path.","strategy":"Wonder Woman signifies 'w', cliffside as 'ei', while the ascending action portrays a rising tone in conjunction with the meaning."},{"mnemonic":"Wonder Woman climbs the cliffside, lifting her lasso high, exclaiming, 'I encircle strength and justice!' as she rises.","strategy":"Wonder Woman for 'w', cliffside represents 'ei', and the action of lifting emphasizes the rising tone aligned with the meaning."}]],
 ["韭",[{"mnemonic":"Imagine Jane Goodall carefully picking leeks that grow along the edge of a canyon while dipping and rising with the terrain.","strategy":"The mnemonic incorporates Jane Goodall for the initial 'j', the Canyon for the final 'ou', and the action of dipping and rising represents tone 3. The visual of leeks in a canyon connects to the meaning."},{"mnemonic":"Picture Jane Goodall jumping up and down to gather leeks at the canyon's edge, emphasizing the leeks' green tops.","strategy":"This variant retains the essential connections while emphasizing leeks visually, linking Jane Goodall to the action of gathering in a canyon."},{"mnemonic":"Visualize Jane Goodall standing at the canyon's rim, tossing leeks into the air and catching them as they bounce back.","strategy":"This version focuses on the bouncing action associated with tone 3 while maintaining the connection to Jane Goodall and the canyon."},{"mnemonic":"Imagine Jane Goodall researching leeks growing at the canyon, bending low to observe them as she dips then rises.","strategy":"This mnemonic builds visual depth by adding research elements related to Jane Goodall while emphasizing the movement related to tone."},{"mnemonic":"Envision Jane Goodall in a canyon, leeks all around her, as she gracefully dips and rises to collect them.","strategy":"This option strengthens the imagery of leeks and incorporates the tone action while retaining the initial and final associations."}]],
 ["音",[{"mnemonic":"Visualize Yoda standing on a tundra, teaching young Jedi about the sounds of nature while climbing uphill.","strategy":"Yoda represents the initial 'y', the tundra for the final 'in', and the action of climbing signifies tone 2. The meaning relates to the sounds heard in nature."},{"mnemonic":"Picture Yoda energetically raising his hand towards sounds echoing in the tundra as he ascends a snowy hill.","strategy":"This variation retains Yoda and the tundra, while the emphasis on energy and sound brings clarity to the meaning."},{"mnemonic":"Imagine Yoda meditating in the tundra, feeling the sounds rise as he lifts his arms into the air.","strategy":"This creates a serene visualization of Yoda with sound, emphasizing the upward motion related to tone."},{"mnemonic":"See Yoda climbing the tundra, listening carefully to the sounds of animals as he ascends further.","strategy":"This option focuses on the auditory aspect linked to the meaning while integrating the action of rising."},{"mnemonic":"Envision Yoda whispering to the tundra winds to create sound waves that rise and fall around him.","strategy":"Incorporating whispering connects the meaning directly to sound, reinforced by the motion in the tundra."}]],
 ["頁",[{"mnemonic":"Visualize Yoda dropping a page from his book during a storm as it falls down a glacier.","strategy":"Yoda represents the initial 'y', the glacier symbolizes the final 'e', and the action of dropping conveys tone 4. The page connects directly to the meaning."},{"mnemonic":"Imagine Yoda watching a page flutter away from him, plummeting off a glacier into freezing water.","strategy":"This iteration emphasizes the act of falling while maintaining strong imagery related to the meaning."},{"mnemonic":"Picture Yoda standing on a glacier, tossing pages that fall like snowflakes around him.","strategy":"This mnemonic adds a snowy visual to connect more deeply with the character's appearance and reinforces the falling action."},{"mnemonic":"Envision Yoda being surprised as a page slips from his fingers, cascading down the icy face of a glacier.","strategy":"This creates suspense and an emotional connection while aligning well with sound and motion."},{"mnemonic":"See Yoda on a glacier while pages tumble from above, creating a cascade of written knowledge all around.","strategy":"This creatively integrates the concept of pages falling, linking visually and meaningfully."}]],
 ["風",[{"mnemonic":"Imagine Frodo walking calmly across a steppe, feeling the gentle wind blowing around him.","strategy":"Frodo embodies the initial 'f', the steppe stands for the final 'eng', and the calm motion reflects tone 1. The serene breeze ties back to the meaning."},{"mnemonic":"Picture Frodo resting on a grassy mound in the steppe, meditating as a gentle wind touches his face.","strategy":"This option highlights tranquility, directly linking with the concept of wind while maintaining connections to initial and final."},{"mnemonic":"Visualize Frodo collecting herbs in the steppe while the wind sways the grass steadily around him.","strategy":"This connects everyday actions with the meaning of wind, emphasizing calmness and continuity."},{"mnemonic":"Envision Frodo with a kite on the steppe, enjoying the steady wind lifting it gently as he smiles.","strategy":"This adds an engaging action related to wind that resembles a calm, happy moment."},{"mnemonic":"See Frodo standing firm against the soft, steady wind on the steppe, embodying peace.","strategy":"Highlighting Frodo's strength in the wind adds a layer to understanding the character and its meaning."}]],
 ["飛",[{"mnemonic":"Visualize Frodo soaring up into the valley's sky, feeling exhilaration as he takes flight.","strategy":"The initial 'f' is represented by Frodo, the valley corresponds to the final 'i', and taking flight signifies tone 2. The meaning relates directly to flying."},{"mnemonic":"Picture Frodo climbing up a hill in a valley, leaping into the air with wings and rising with joy.","strategy":"This version keeps the motif of ascent and joy, directly connecting to the meaning of flying."},{"mnemonic":"Imagine Frodo spreading his arms wide as he glides over a beautiful valley, feeling the upward lift of the wind.","strategy":"This emphasizes the visual aspect of flight while retaining Yoda's essence alongside the valley context."},{"mnemonic":"Envision Frodo racing upward from the valley floor towards the clouds, filled with the thrill of flying.","strategy":"This creates a vivid sense of dynamic motion combined with the heightening experience of flight."},{"mnemonic":"See Frodo flying higher and higher above the valley, giggling with delight as he goes.","strategy":"This evokes emotions associated with flying while aligning closely with the character's initial."}]],
 ["食",[{"mnemonic":"Simba discovers a valley full of delicious food where he suddenly lunges down to eat.","strategy":"The initial 's' is associated with Simba, the final '-i' with a Valley. The tone 4 action is represented by Simba making a sharp movement to gobble up food."},{"mnemonic":"Simba climbs a valley, falls sharply and finds food waiting for him.","strategy":"Simba symbolizing 's' and the valley for '-i', paired with the sudden fall represents the tone."},{"mnemonic":"In a valley, Simba swiftly hunts for food, suddenly pouncing to grab a meal.","strategy":"The hunt in the valley links to 's' and '-i', while the pouncing represents the sharp tone action."},{"mnemonic":"Simba slopes down into the valley with excitement and swiftly eats on the spot.","strategy":"The excitement reflects the sudden action of grabbing food, expressing the sharp tone."},{"mnemonic":"Simba bounces down into the lush valley, landing suddenly right next to a feast.","strategy":"The first character links with the motion of bouncing sharply representing the tone."}]],
 ["首",[{"mnemonic":"Shrek pops his head out from a canyon, dipping below the edge then rising back up.","strategy":"Shrek's head signifies the meaning, the canyon represents the final, and the tone illustrates the motion of rising and falling."},{"mnemonic":"Shrek dips his head under the canyon and then pops back up to say hi.","strategy":"The action emphasizes the tone while visualizing Shrek's head and the canyon."},{"mnemonic":"In a canyon, Shrek nods his head playfully, dipping down and bouncing back up.","strategy":"This portrays a continuous motion that aligns with the tone while depicting Shrek and the canyon."},{"mnemonic":"Shrek's head bobs up and down as he peers around the canyon edge.","strategy":"The bobbing represents the tone while connecting it to the character and final."},{"mnemonic":"Shrek leans over the canyon, dipping his head and peeking back up.","strategy":"This action creates a vivid image tying in the meaning, tone, and visual."}]],
 ["香",[{"mnemonic":"Xena stands proudly beside a volcano crater, the scent of fragrant flowers drifting calm and steady around her.","strategy":"Xena represents the initial, while the volcano crater symbolizes the final, and the calmness reflects the first tone."},{"mnemonic":"Xena gently picks a flower next to the calm volcano crater, enjoying the sweet scent.","strategy":"The calm action fits the tone, while the characters reflect the meaning and visual."},{"mnemonic":"Xena relaxes at the rim of a volcano crater, breathing the fragrant air peacefully.","strategy":"This serene imagery combines the tone and character associations smoothly."},{"mnemonic":"Next to the volcano crater, Xena takes deep breaths of the peaceful fragrance in the air.","strategy":"The deep breathing emphasizes the calm, aligning with the character and meaning."},{"mnemonic":"Xena gracefully twirls by the volcano crater, delighting in the fragrant aromas wafting around her.","strategy":"The twirling motion keeps the calmness while connecting to the character and meaning."}]],
 ["馬",[{"mnemonic":"Moana rides a horse through the savanna, dipping down to avoid bushes and rising back up on its back.","strategy":"Moana symbolizes the initial, the savanna represents the final, and the riding motion fits the tone."},{"mnemonic":"Moana gallops across the savanna, dipping and rising with the horse as they navigate terrain.","strategy":"The galloping action connects with the meaning while illustrating the tone."},{"mnemonic":"Moana's horse jumps smooth hills on the savanna, dipping low and rising high.","strategy":"The jumps showcase the continual motion matching the tone with associated visuals."},{"mnemonic":"Moana enjoys a soft rhythm as the horse moves through the savanna, dipping gently and rising in tune.","strategy":"The sound of the movement ties in with both the action of the character and the gentle tone."},{"mnemonic":"Moana confidently rides her horse, dipping under branches and rising with the landscape of the savanna.","strategy":"This ride blends the tone of motion with the imagery of the character and meaning."}]],
 ["骨",[{"mnemonic":"Imagine Gandalf bouncing on the hot sands of a desert, gathering ancient bones from long-lost animals.","strategy":"Gandalf represents the initial 'g', the desert depicts the final '-u', and the action of bouncing captures the tone 3."},{"mnemonic":"Picture Gandalf carefully balancing a bone while hopping up and down in a shimmering desert.","strategy":"This imagery includes the visual of the character (bone) along with the climate of a desert, reinforcing the tone."},{"mnemonic":"Gandalf is casting a spell that makes bones bounce gently on the sandy desert floor.","strategy":"The spell symbolizes the tone, and the desert landscape highlights the final sound."},{"mnemonic":"Visualize Gandalf diving into a bone pit, rising and falling like the dunes of a desert.","strategy":"The action incorporates the tone while directly correlating with the meaning through the bone."},{"mnemonic":"Gandalf collects sparkling bones hidden in the desert, springing from a crouch.","strategy":"The crouch to spring movement reflects the tone while linking the character and the final vividly."}]],
 ["高",[{"mnemonic":"Envision Gandalf standing flat and steady by a majestic waterfall, admiring its height.","strategy":"Gandalf represents the initial 'g', the waterfall corresponds to the final '-ao', and the calmness reflects tone 1."},{"mnemonic":"Imagine Gandalf casting a spell that makes the waterfall rise even higher and higher, while he maintains his composure.","strategy":"The imagery combines the height concept, tone, and visual elements harmoniously."},{"mnemonic":"Gandalf, calm and steady, gazes at the towering waterfall, its height urging him towards mastery.","strategy":"This mnemonic emphasizes the action (gazing calmly) while reinforcing the meaning through the visual of the tall waterfall."},{"mnemonic":"Picture Gandalf lifting a massive stone, standing by the large waterfall, signifying strength and height.","strategy":"The stone lifting is the flat action relating to tone 1, paired with the height concept from the waterfall imagery."},{"mnemonic":"Visualize Gandalf showing a child how to measure height at the edge of a waterfall, tranquil and collected.","strategy":"The clear visual of peace at height conveys both the meaning and the tone effectively."}]],
 ["髟",[{"mnemonic":"Picture Bilbo Baggins brushing his long hair calmly by the tranquil lagoon.","strategy":"Bilbo represents the initial 'b', the lagoon connects with the final '-iao', and the calm hair brushing reflects tone 1."},{"mnemonic":"Imagine Bilbo weaving flower crowns into his long hair near a peaceful lagoon.","strategy":"This scene emphasizes the peaceful activity reflecting tone 1 and connecting visual with action."},{"mnemonic":"Envision Bilbo sitting peacefully at a lagoon, his long hair floating in the water like a serene reflection.","strategy":"The calm setting emphasizes the first tone along with the visual meaning tied to hair."},{"mnemonic":"Visualize Bilbo collecting shells with long hair cascading over his shoulders at the lagoon's edge.","strategy":"This scene captures a tranquil bond with the water and a flat action, bridging meaning and tone effectively."},{"mnemonic":"Bilbo stands peacefully, letting his long hair sway in the lagoon's gentle breeze.","strategy":"This imagery imparts a flowing calmness related to hair and the serene atmosphere of the lagoon."}]],
 ["鬥",[{"mnemonic":"Picture David Attenborough narrating a fierce struggle between animals, as they tumble down a canyon.","strategy":"David represents 'd', the canyon aligns with the final '-ou', and the action of tumbling signifies a sharp fall."},{"mnemonic":"Imagine David capturing the dramatic moments as two creatures wrestle on the edge of a canyon.","strategy":"This captures the tone's falling action while vividly connecting with the idea of struggle."},{"mnemonic":"Envision David watching a fight unfold with sharp movements leading both competitors towards the canyon below.","strategy":"The harsh dive illustrates tone 4, while the battling instinct emphasizes the meaning of the character."},{"mnemonic":"Visualize David pointing out the aggressive behaviors of wildlife next to a steep canyon, reflecting their struggles.","strategy":"This concept combines the sharp action with a strong setting that underscores the character's meaning."},{"mnemonic":"David is broadcasting a battle with intense movements as both opponents roll towards the canyon's edge.","strategy":"The strong imagery of conflict ties together the falling tone and the location effectively."}]],
 ["鬯",[{"mnemonic":"Chun-Li kicks sharply down into a Volcano Crater filled with sour fruit.","strategy":"Chun-Li represents the 'ch' initial, the Volcano Crater represents '-ang', and the sharp kick captures the falling tone and the concept of sourness visually."},{"mnemonic":"Chun-Li jumps down swiftly into a smelly Volcano Crater of sourness.","strategy":"The swift motion portrays the falling action of tone 4 while emphasizing sourness through the visual cue of a smelly crater."},{"mnemonic":"Chun-Li lands decisively on a sour Volcano Crater, making the ground shake.","strategy":"The decisiveness in her landing reflects the sharp aspect of tone 4, reinforcing the meaning related to sourness."},{"mnemonic":"Chun-Li performs a downward strike into a sizzling Volcano Crater, unleashing sour fumes.","strategy":"The downward strike emphasizes the sharpness of tone 4 while the notion of sourness is conveyed through the fumes."},{"mnemonic":"Chun-Li swiftly defeats her opponent by throwing them into a sour Volcano Crater.","strategy":"The action of throwing links to the sharp falling tone, while the unique location provides a vivid understanding of sour."}]],
 ["鬲",[{"mnemonic":"Gandalf rises up from a Glacier, holding a three-legged cooking pot.","strategy":"Gandalf represents the 'g' initial, the Glacier represents the '-e' final, and the uplifting motion of rising captures the rising tone and the meaning."},{"mnemonic":"Gandalf lifts a three-legged pot above his head while standing on a Glacier.","strategy":"The lifting action signifies a rising tone, and the visual of the Glacier links to the cooking pot's meaning."},{"mnemonic":"Gandalf conjures warmth from his three-legged pot on a frozen Glacier.","strategy":"The magical conjuring conveys an uplifting action, while the cold setting of a Glacier makes the concept tangible."},{"mnemonic":"Gandalf places his three-legged cooking pot gently on a melting Glacier.","strategy":"The gentle placement reflects the rising tone, while the significance of cooking highlights the character's meaning."},{"mnemonic":"Gandalf ascends a Glacier, carrying a shimmering three-legged pot.","strategy":"The ascent provides a strong visual related to the rising tone, enriching the connection to the character's meaning."}]],
 ["鬼",[{"mnemonic":"Gandalf dips into a foggy Valley where ghosts whisper eerily.","strategy":"Gandalf stands for the 'g' initial, the Valley for the '-ui' final, and the dipping motion evokes the fall-rise tone, with ghosts encapsulating the meaning."},{"mnemonic":"Gandalf glides low into the Valley, encountering a ghostly figure.","strategy":"The act of gliding low represents the action of dipping, while the Valley enhances the visual of the ghost connection."},{"mnemonic":"Gandalf's staff glows as he dips into the Valley, illuminating spirits.","strategy":"Dipping into the Valley conveys the fall-rise aspect of tone 3, and illuminating spirits connects to the meaning of ghost."},{"mnemonic":"Gandalf tiptoes cautiously through a haunted Valley filled with ghostly whispers.","strategy":"The caution of tiptoeing symbolizes the fall-rise of tone 3, while the Valley deepens the ghostly theme."},{"mnemonic":"Gandalf hovers in a misty Valley, watching as ghosts emerge.","strategy":"The image of hovering captures the fall-rise tone, and the misty Valley reinforces the meaning of ghost."}]],
 ["魚",[{"mnemonic":"Yoda climbs upwards in a Desert, searching for elusive fish.","strategy":"Yoda embodies the 'y' initial, the Desert illustrates the '-u' final, and the climbing action captures the rising tone and the fish theme."},{"mnemonic":"Yoda leaps high in the Desert, casting his line for fish.","strategy":"The high leap signifies the rising action, linking to the meaning of fish in a dry environment."},{"mnemonic":"Yoda floats above the Desert sands, watching schools of fish beneath the surface.","strategy":"Floating supports the rising tone while visually conveying the connection between a Desert and fish in a unique, imaginative way."},{"mnemonic":"Yoda gestures as he climbs the sand dunes of the Desert, hoping to catch fish.","strategy":"Climbing the dunes connects to rising tone 2, with the hope of catching fish reinforcing the character's meaning."},{"mnemonic":"Yoda communes with the spirits of fish while being lifted by the Desert winds.","strategy":"The winds lifting him captures the essence of rising, while the spiritual connection to fish complements the meaning."}]],
 ["鳥",[{"mnemonic":"Nemo dives into the waters surrounding an Island, observing colorful birds flying overhead.","strategy":"Nemo represents the 'n' initial, the Island illustrates the '-iao' final, and the diving motion evokes the fall-rise tone, tying in the theme of birds."},{"mnemonic":"Nemo swims under an Island, watching birds dip and rise.","strategy":"The observation of birds dipping provides a direct illustration of the fall-rise tone as well as the character's meaning."},{"mnemonic":"Nemo twirls below the surface of the water near an Island while birds swoop low.","strategy":"The twirling movement visualizes the dip and rise, connecting with both the tone and the birds' actions."},{"mnemonic":"Nemo surfaces near an Island, startled by the sudden fall of a bird.","strategy":"The idea of being startled links well with the fall-rise action, strengthening the theme around birds."},{"mnemonic":"Nemo races towards an Island as flocks of birds dive downwards.","strategy":"The action of racing conveys the idea of falling and rising, cementing the visual of birds in an Island setting."}]],
 ["鹵",[{"mnemonic":"Imagine Legolas gracefully bouncing over the desert, sprinkling salt on the sands.","strategy":"Legolas (initial) represents agility, while the desert (final) indicates the environment. The bouncing action reflects the third tone, and the image of salt reinforces the meaning."},{"mnemonic":"Legolas dances lightly across a salt flat, with a playful bounce.","strategy":"Here, Legolas embodies the initial, and salt flats depict the final environment, emphasizing the saltiness meaning through his dance."},{"mnemonic":"Picture Legolas scooping salt out of a desert oasis and tossing it in the air.","strategy":"Legolas illustrates the initial, an oasis the final. Scooping conveys the tone, and the salt directly connects to the meaning."},{"mnemonic":"Legolas jumps over a sparkling saltwater lake in the desert.","strategy":"Legolas represents the initial, while the saltwater lake suggests the salty meaning, with the jumping action fitting the tone."},{"mnemonic":"Legolas finds a hidden salt mine in the desert, bouncing around excitedly.","strategy":"The excitement of the character represents the tone, while the salt mine ties into the meaning of 'salty'."}]],
 ["鹿",[{"mnemonic":"Legolas strikes a pose as a deer suddenly darts through the desert.","strategy":"Legolas captures the initial, while the deer represents the meaning. A sudden dash signifies the fourth tone."},{"mnemonic":"Imagine Legolas swiftly shooting an arrow as a deer bolts away in the desert.","strategy":"Legolas (initial) portrays skill, and the darting deer (meaning) illustrates the action's sharpness reflecting the tone."},{"mnemonic":"Legolas quickly spins to catch sight of a startled deer in the desert.","strategy":"The sharp turning action fits the tone while linking Legolas and the deer to their respective parts."},{"mnemonic":"As Legolas shouts ‘stop’, a deer suddenly freezes in the desert sand.","strategy":"Legolas initiates action, the frozen deer depicts the meaning, with the sudden stop matching the tone."},{"mnemonic":"Legolas leaps as a deer bolts past, the desert sand flying up around him.","strategy":"The leap signifies suddenness, while the imagery ties in the environment, initial, and meaning."}]],
 ["麥",[{"mnemonic":"Moana suddenly discovers a field of wheat on her island.","strategy":"Moana as the initial represents adventure, while the island shows the environment. The sharp discovery links to the tone, and wheat depicts the meaning."},{"mnemonic":"Picture Moana slicing through tall stalks of wheat as she races across the island.","strategy":"Slicing reflects the sharp action of the fourth tone, and the wheat connects to the character's meaning."},{"mnemonic":"Moana dodges wheat stalks that suddenly block her path on the island.","strategy":"The sudden block mirrors the tone, with Moana and the wheat collaboratively illustrating the character."},{"mnemonic":"Moana jumps back as a sudden wind blows through the wheat field on the island.","strategy":"The jump represents the tone, while wind through wheat reflects the character’s initial and final associations."},{"mnemonic":"Moana stands up quickly as a wave of wind sweeps over the wheat on the island.","strategy":"Standing sharply relates to the tone, while the setting provides context for the meaning."}]],
 ["麻",[{"mnemonic":"Moana climbs upward, discovering hemp plants growing in the savanna.","strategy":"Moana illustrates the initial, the hemp plants tie to the meaning, and the climbing action represents the rising tone."},{"mnemonic":"In the savanna, Moana gathers hemp as she climbs up a hill with excitement.","strategy":"The hill climbing action connects to the tone, while all elements merge into a vivid story."},{"mnemonic":"Moana ascends a slope, rejoicing at the sight of hemp swaying in the savanna breeze.","strategy":"The joy reflects the rising tone, differentiating the savanna scenery and hemp's meaning."},{"mnemonic":"Picture Moana celebrating as she finds a large patch of hemp in the savanna, climbing higher.","strategy":"Celebration embodies the rising emotion, enhancing the visual connection to the meaning."},{"mnemonic":"Moana gathers her energy as she ascends to collect hemp in the savanna.","strategy":"Gathering strength indicates rise in the tone, while the savanna and hemp tie the story together."}]],
 ["黃",[{"mnemonic":"Hagrid cheerfully climbs out of a yellow volcano crater, amazed at the brightness.","strategy":"Hagrid represents the initial, the yellow crater ties to the meaning, and the joyful climb reflects the rising tone."},{"mnemonic":"Imagine Hagrid gathering yellow rocks from the bottom of a volcano crater as he ascends.","strategy":"Gathering signifies the tone, while the crater presents the environment enriched by the color."},{"mnemonic":"Hagrid grapples with a yellow flower as he climbs out of a volcano crater.","strategy":"The flower’s color indicates the meaning, while grappling upward represents the action in the rising tone."},{"mnemonic":"Hagrid excitedly ascends rocks in a yellow volcano crater, overwhelmed by its beauty.","strategy":"Excitement conveys the rising nature, while the crater and color connect all meanings."},{"mnemonic":"Hagrid’s laughter echoes as he climbs a yellow hill in a volcano crater.","strategy":"The laughter raises the tone's connotation, connecting the crush of nature and color with the initial."}]],
 ["黍",[{"mnemonic":"Shrek rushes across the Desert to gather glutinous millet after a strong wind blows it away.","strategy":"Shrek symbolizes the initial 'sh', the desert represents the final 'u', and his rush conveys the sharp tone."},{"mnemonic":"As Shrek sprints through the Desert, he scoops up glutinous millet that the caravans have dropped.","strategy":"The action of Shrek sprinting mirrors the sudden action of the tone, linking the visual and meaning together."},{"mnemonic":"In a rush, Shrek collects glutinous millet blown across the Desert by a fierce gust.","strategy":"The rush reflects the tone, while the desert and the character relate to the final and initial respectively."},{"mnemonic":"Shrek's sudden leap in the Desert sends glutinous millet flying in the air.","strategy":"The sharp action in the tone connects with Shrek's movement, linking visualization with the character's meaning."},{"mnemonic":"Shrek dives into the Desert to dive for glutinous millet, feeling the sharpness of the sun.","strategy":"This mnemonic uses the action of diving to reflect the tone and visually tie back to the meanings."}]],
 ["黑",[{"mnemonic":"Hagrid paints the Cliffside a deep black as he climbs down suddenly.","strategy":"Hagrid represents 'h', the cliffside represents '-ei', and the sudden painting indicates the sharp tone."},{"mnemonic":"Hagrid's sudden fall from the Cliffside as he spills black paint everywhere.","strategy":"The action illustrates the tone while intertwining Hagrid and the visual setting."},{"mnemonic":"Hagrid abruptly splatters black paint against the Cliffside as he stumbles.","strategy":"The sharpness of the stumble conveys the tone, connecting the character and location with the meaning."},{"mnemonic":"Hagrid, in a rush, blackens the Cliffside with his magical concoction.","strategy":"This mnemonic invokes Hagrid's character in a fitting context, showing a falling action related to the tone."},{"mnemonic":"As Hagrid paints the Cliffside black, he falls back with surprise.","strategy":"The surprise fall enhances the tone while the characters and environment relate to the initial and final."}]],
 ["黹",[{"mnemonic":"Zeus dips and rises his needle in the Valley as he embroiders clouds.","strategy":"Zeus represents 'zh', the valley stands for '-i', and the dipping action captures the tone."},{"mnemonic":"As Zeus dips his needle into the valley floor, he rises with a thread to embroider sunlight.","strategy":"The alternating action depicts the tone while linking Zeus and the imagery of embroidery."},{"mnemonic":"Zeus skillfully dips and raises his needle, drawing a beautiful scene in the Valley.","strategy":"The action of embroidery relates to the tone, while Zeus and the valley represent the associations."},{"mnemonic":"With a graceful rhythm, Zeus dips and rises in the Valley while embroidering the skies.","strategy":"The action conveys the fall-rise tone, visually tying Zeus to the act of embroidery."},{"mnemonic":"Zeus dives into the Valley, rising with patterns as he embroiders a tapestry.","strategy":"This visual action connects the character's identity to the meaning and tone of the character."}]],
 ["黽",[{"mnemonic":"Moana suddenly jumps into the muddy Tundra, splashing everywhere.","strategy":"Moana symbolizes 'm', the tundra connects to '-in', and her sudden jump correlates with the falling tone."},{"mnemonic":"In a leap, Moana falls into the mud of the Tundra, splattering it around.","strategy":"The action illustrates the sharpness of the tone while connecting Moana's identity and environment."},{"mnemonic":"Moana quickly dives into a muddy patch in the Tundra, making things wild.","strategy":"The quickness reflects a sudden action that relates back to the meaning of mud."},{"mnemonic":"With a swift plunge, Moana muddies the Tundra as she plays.","strategy":"This mnemonic activates the visual and auditory sense, linking actions to character and meaning."},{"mnemonic":"Moana suddenly creates a mess in the muddy Tundra.","strategy":"Her sudden action captures the tone while the visual aids in recognizing the character's significance."}]],
 ["鼎",[{"mnemonic":"David Attenborough suddenly places a tripod cauldron by the Oasis.","strategy":"David represents 'd', the oasis denotes '-ing', and the action mirrors a sudden placement."},{"mnemonic":"As David Attenborough films by the Oasis, he swiftly sets down his tripod cauldron.","strategy":"The swift motion adds a sharpness that aligns with the fall tone while emphasizing the meaning."},{"mnemonic":"David Attenborough quickly places the tripod cauldron at the Oasis to capture a moment.","strategy":"The quick placement connects his identity with the character's structure."},{"mnemonic":"In a rush, David Attenborough arranges a tripod cauldron near the Oasis for filming.","strategy":"The rush highlights the sharpness of the tone, relating to both character and object."},{"mnemonic":"David Attenborough abruptly sets the tripod cauldron by the tranquil Oasis.","strategy":"This mnemonic uses the contrasting action to enhance tone, connecting all elements vividly."}]],
 ["鼓",[{"mnemonic":"Gandalf is joyfully juggling drums in the Desert, bouncing them up and down.","strategy":"Gandalf represents the initial 'g', the Desert refers to the final '-u', and the bouncing action reflects the fall-rise tone while drumming signifies the meaning."},{"mnemonic":"Imagine Gandalf beating a drum lightly in the Desert, letting the sound rise and fall.","strategy":"Gandalf illustrates the initial, the Desert denotes the final, and the action of beating and letting the sound wave heighten captures the tone and meaning."},{"mnemonic":"Gandalf creates a rhythm on his drum while hopping around in the Desert.","strategy":"Initial 'g' is for Gandalf, '-u' is for Desert, the hopping indicates the fall-rise tone, and the drumming showcases the meaning."},{"mnemonic":"Gandalf’s drum echoes in the Desert while he bounces up energetically.","strategy":"Initial 'g' for Gandalf, 'Desert' as the final, and the energetic bouncing shows the tonal action they signify."},{"mnemonic":"Gandalf dances as he plays his drum in the Desert, bouncing lightly.","strategy":"The visual of dancing with a drum aligns with the meaning, while Gandalf provides the initial, the Desert gives the final, and the bouncy motion fits the tone."}]],
 ["鼠",[{"mnemonic":"Shrek chases a bouncing mouse through the Desert, watching it rise and fall.","strategy":"Shrek as 'sh' denotes the initial, the Desert represents the final '-u', and the chasing motion matches the fall-rise tone while focusing on the mouse meaning."},{"mnemonic":"Imagine Shrek trying to catch a tiny mouse that bounces in the Desert.","strategy":"Shrek illustrates the initial, the Desert signifies the final, and the motion of bouncing fits the tonal representation with the focus on the mouse."},{"mnemonic":"Shrek jumps to catch a mouse softly bouncing around in the Desert.","strategy":"The action of jumping corresponds with the fall-rise tone, and the visual inside the Desert reinforces the initial 'sh' and meaning."},{"mnemonic":"Shrek laughs as he follows a lively mouse that bounces across the Desert.","strategy":"Laughter implies the fun of chasing while 'sh' brings in Shrek, 'Desert' gives the final, and bouncing fits the tone."},{"mnemonic":"Shrek sits quietly, watching a mouse bounce effortlessly in the Desert.","strategy":"This serene moment emphasizes the bouncing movement representing the tone, with the initial 'sh' and final '-u' depicting the character."}]],
 ["鼻",[{"mnemonic":"Bilbo Baggins looks up at a beautiful valley while sniffing the fresh air with his nose.","strategy":"Bilbo represents the initial 'b', the Valley for the final '-i', and the action of looking up matches the rising tone connected with the meaning."},{"mnemonic":"Bilbo excitedly climbs to a peak in the Valley, breathing deeply through his nose.","strategy":"This climbing action encapsulates the uplifting tone while 'b' signifies Bilbo and 'Valley' serves as the final."},{"mnemonic":"Bilbo stands at the edge of a Valley, his nose twitching from the scents of flowers.","strategy":"The twitching nose captures the character's meaning while 'b' for Bilbo and 'Valley' define the initial and final."},{"mnemonic":"Bilbo inhales sharply, his nose pointed towards the warm breeze in the Valley.","strategy":"The sharp inhale represents the rising tone, while Bilbo provides the initial and Valley as the geographical final."},{"mnemonic":"Bilbo Baggins happily sniffs childhood scents wafting up from the Valley.","strategy":"The act of sniffing aligns with the nose's meaning, 'b' for Bilbo recalls the initial, and 'Valley' provides the final while uplifting the imagery."}]],
 ["齊",[{"mnemonic":"Quasimodo arranges flowers neatly together in a blooming Valley, each petal rising cheerfully.","strategy":"Quasimodo for initial 'q', Valley for the final, while the action of arranging captures the uplifting tone with the meaning of togetherness."},{"mnemonic":"Quasimodo leads villagers to gather in a neat circle in the Valley.","strategy":"The circle formation reflects togetherness meaning, while 'q' with Quasimodo begins it and Valley represents the ending."},{"mnemonic":"Imagine Quasimodo ensuring everything is synchronously placed in the Valley, all lined up.","strategy":"Neat alignment shows the meaning while 'q' connects to Quasimodo, and 'Valley' indicates the final in an uplifting manner."},{"mnemonic":"Quasimodo smiles, as everyone dances together smoothly in the Valley.","strategy":"Dancing together illustrates the character’s meaning, with 'q' for Quasimodo and the Valley as the environment spot."},{"mnemonic":"Quasimodo organizes a gathering in the Valley, making sure everyone aligns well.","strategy":"The organizing act reflects neatness, with Quasimodo representing the initial 'q' while Valley fulfills the environment and uplifting tone."}]],
 ["齒",[{"mnemonic":"Zorro dances playfully in the Valley, showcasing the sharpness of his toothy grin as he dips and rises with enthusiasm.","strategy":"Zorro represents the initial 'z', the Valley is a visual representation of the final 'i', and the action of dancing playfully encodes the fall-rise tone, emphasizing the character's meaning related to teeth."},{"mnemonic":"Zorro jumps off a cliff in the Valley, revealing his bright, white teeth as he falls and then rises again.","strategy":"The jump action illustrates the fall-rise tone, while Zorro and the Valley establish the initials and finals respectively, connecting to the meaning of 'tooth.'"},{"mnemonic":"In the Valley, Zorro gathers flowers for his teeth and bounces between the foliage, showing his bright smile.","strategy":"This variation combines the action of gathering (indicating the character's meaning) with the visual landscape and Zorro's association, while fitting the tone's movement."},{"mnemonic":"Zorro performs acrobatics in the Valley, doing flips while displaying his sharp white teeth.","strategy":"The flips showcase the fall-rise action, linking the vibrant scenery and Zorro to the meaning of 'tooth.'"},{"mnemonic":"Zorro stands proudly on a rocky ledge in the Valley, brushing his teeth with a giant tooth brush, dipping into the river and rising back up.","strategy":"This incorporates a clear visual representation of the meaning, while maintaining the character associations and the dynamic of the fall-rise tone."}]],
 ["龍",[{"mnemonic":"Legolas climbs a palm tree in the Oasis, trying to spot the rising dragon overhead.","strategy":"Legolas is the initial 'l', the Oasis captures the final 'ong', and the action of climbing tall encodes the rising tone, connecting to the dragon's imagery."},{"mnemonic":"In the Oasis, Legolas sees a shadow of a dragon rising from the sands.","strategy":"This version presents a direct visual representation of the dragon and hints at the character's meaning while utilizing Legolas for the initial and Oasis for the final."},{"mnemonic":"Legolas sprints up a sand dune in the Oasis, chasing the rising cloud of a dragon.","strategy":"This mnemonic connects the dynamic action to the rising tone, while tying together the character associations and thematic imagery."},{"mnemonic":"Legolas plays with a young dragon by the Oasis, both rising joyfully off the ground.","strategy":"The playful action portrays rising emotion, with Legolas and the Oasis embodying the initial and final components, while the dragon's meaning is preserved."},{"mnemonic":"Legolas takes flight on the back of a dragon emerging from the Oasis, climbing into the sky.","strategy":"This highlights the rising action of the tone while visualizing Legolas in a central role connected to the dragon's meaning and Oasis's final."}]],
 ["龜",[{"mnemonic":"Gandalf calmly admires the turtles slowly moving across the flat Misty Hills.","strategy":"Gandalf represents the initial 'g', the Misty Hills correlate with the final 'ui', while the steady action fits the flat tone, encompassing the meaning of 'turtle.'"},{"mnemonic":"Gandalf hovers over the Misty Hills, watching the turtle meander without a care.","strategy":"This mnemonic emphasizes the calm, flat action while integrating Gandalf and the hills clearly linked to the character's meaning."},{"mnemonic":"Gandalf sits on a rock among the Misty Hills, contemplating his life as turtles stroll around him.","strategy":"By incorporating a static action and visual scenery, this keeps the tone flat, linking back to the meaning of 'turtle.'"},{"mnemonic":"Gandalf wanders peacefully over the Misty Hills, observing the slow and steady turtles.","strategy":"The peaceful wandering harmonizes with the flat tone while maintaining the character associations succinctly."},{"mnemonic":"Gandalf stands like a guardian over a pond in the Misty Hills, where turtles glide serenely through the water.","strategy":"This image captures the essence of flatness and serenity, connecting to the meaning while referencing visual elements."}]],
 ["龠",[{"mnemonic":"Yoda plays a tune on his pipe as he falls into the deep Canyon, the sound echoing sharply off the walls.","strategy":"Yoda embodies the initial 'y', the Canyon represents the final 'ue', and the action of falling captures the sharp, sudden nature of the tone, while relating to the meaning of 'pipe.'"},{"mnemonic":"As Yoda falls from a ledge into the Canyon, he uses his pipe to create a musical sound that reverberates downward.","strategy":"The falling action symbolizes the tone, while Yoda and the Canyon link the associations back to the meaning of pipe."},{"mnemonic":"Yoda tumbles into the Canyon, his pipe slipping from his grasp and clattering against the rocks.","strategy":"This narrative emphasizes the sudden falling motion, linking all elements together to visually express the meaning."},{"mnemonic":"Yoda sways at the edge of the Canyon, letting his pipe slip and fall into the abyss below, creating a loud thud.","strategy":"The action of swaying and dropping captures the essence of the falling tone, with Yoda and the Canyon painting the image of 'pipe.'"},{"mnemonic":"While Yoda plays joyful notes on his pipe, he unexpectedly tumbles downwards into the Canyon, descending swiftly.","strategy":"This captures the sharpness of the tone through suddenness while connecting Yoda and the Canyon with the character's meaning."}]]
]