import { invariant } from "@haohaohow/lib/invariant";

interface WordDatum {
  text: string;
  mnemonic?: string;
  names: string | string[];
  pronunciations?: string[];
  characters?: string[];
}

export interface Word {
  text: string;
  mnemonic?: string;
  name: string;
  nameAlts?: string[];
  pronunciations?: string[];
  characters?: string[];
}

const wordData: WordDatum[] = [
  { text: `一`, names: [`one`], characters: [`一`] },
  { text: `丨`, names: [`line`], characters: [`丨`] },
  { text: `丶`, names: [`dot`], characters: [`丶`] },
  { text: `丿`, names: [`slash`], characters: [`丿`] },
  { text: `乙`, names: [`second`], characters: [`乙`] },
  { text: `亅`, names: [`hook`], characters: [`亅`] },
  { text: `二`, names: [`two`], characters: [`二`] },
  { text: `亠`, names: [`lid`], characters: [`亠`] },
  { text: `人`, names: [`man`], characters: [`人`] },
  { text: `儿`, names: [`son,legs`], characters: [`儿`] },
  { text: `入`, names: [`enter`], characters: [`入`] },
  { text: `八`, names: [`eight`], characters: [`八`] },
  { text: `冂`, names: [`wide`], characters: [`冂`] },
  { text: `冖`, names: [`cloth cover`], characters: [`冖`] },
  { text: `冫`, names: [`ice`], characters: [`冫`] },
  { text: `几`, names: [`table`], characters: [`几`] },
  { text: `凵`, names: [`receptacle`], characters: [`凵`] },
  { text: `刀`, names: [`knife`], characters: [`刀`] },
  { text: `力`, names: [`power`], characters: [`力`] },
  { text: `勹`, names: [`wrap`], characters: [`勹`] },
  { text: `匕`, names: [`spoon`], characters: [`匕`] },
  { text: `匚`, names: [`box`], characters: [`匚`] },
  { text: `匸`, names: [`hiding enclosure`], characters: [`匸`] },
  { text: `十`, names: [`ten`], characters: [`十`] },
  { text: `卜`, names: [`divination`], characters: [`卜`] },
  { text: `卩`, names: [`seal (device)`], characters: [`卩`] },
  { text: `厂`, names: [`cliff`], characters: [`厂`] },
  { text: `厶`, names: [`private`], characters: [`厶`] },
  { text: `又`, names: [`again`], characters: [`又`] },
  { text: `口`, names: [`mouth`], characters: [`口`] },
  { text: `囗`, names: [`enclosure`], characters: [`囗`] },
  { text: `土`, names: [`earth`], characters: [`土`] },
  { text: `士`, names: [`scholar`], characters: [`士`] },
  { text: `夂`, names: [`go`], characters: [`夂`] },
  { text: `夊`, names: [`go slowly`], characters: [`夊`] },
  { text: `夕`, names: [`evening`], characters: [`夕`] },
  { text: `大`, names: [`big`], characters: [`大`] },
  { text: `女`, names: [`woman`], characters: [`女`] },
  { text: `子`, names: [`child`], characters: [`子`] },
  { text: `宀`, names: [`roof`], characters: [`宀`] },
  { text: `寸`, names: [`inch`], characters: [`寸`] },
  { text: `小`, names: [`small`], characters: [`小`] },
  { text: `尢`, names: [`lame`], characters: [`尢`] },
  { text: `尸`, names: [`corpse`], characters: [`尸`] },
  { text: `屮`, names: [`sprout`], characters: [`屮`] },
  { text: `山`, names: [`mountain`], characters: [`山`] },
  { text: `巛`, names: [`river`], characters: [`巛`] },
  { text: `工`, names: [`work`], characters: [`工`] },
  { text: `己`, names: [`oneself`], characters: [`己`] },
  { text: `巾`, names: [`turban`], characters: [`巾`] },
  { text: `干`, names: [`dry`], characters: [`干`] },
  { text: `幺`, names: [`short thread`], characters: [`幺`] },
  { text: `广`, names: [`dotted cliff`], characters: [`广`] },
  { text: `廴`, names: [`long stride`], characters: [`廴`] },
  { text: `廾`, names: [`arch`], characters: [`廾`] },
  { text: `弋`, names: [`shoot`], characters: [`弋`] },
  { text: `弓`, names: [`bow`], characters: [`弓`] },
  { text: `彐`, names: [`snout`], characters: [`彐`] },
  { text: `彡`, names: [`bristle`], characters: [`彡`] },
  { text: `彳`, names: [`step`], characters: [`彳`] },
  { text: `心`, names: [`heart`], characters: [`心`] },
  { text: `戈`, names: [`halberd`], characters: [`戈`] },
  { text: `戶`, names: [`door`], characters: [`戶`] },
  { text: `手`, names: [`hand`], pronunciations: [`shǒu`], characters: [`手`] },
  { text: `支`, names: [`branch`], characters: [`支`] },
  { text: `攴`, names: [`rap, tap`], characters: [`攴`] },
  { text: `文`, names: [`script`], characters: [`文`] },
  { text: `斗`, names: [`dipper`], characters: [`斗`] },
  { text: `斤`, names: [`axe`], characters: [`斤`] },
  { text: `方`, names: [`square`], characters: [`方`] },
  { text: `无`, names: [`not`], characters: [`无`] },
  { text: `日`, names: [`sun`], characters: [`日`] },
  { text: `曰`, names: [`say`], characters: [`曰`] },
  { text: `月`, names: [`moon`], characters: [`月`] },
  { text: `木`, names: [`tree`], characters: [`木`] },
  { text: `欠`, names: [`lack`], characters: [`欠`] },
  { text: `止`, names: [`stop`], characters: [`止`] },
  { text: `歹`, names: [`death`], characters: [`歹`] },
  { text: `殳`, names: [`weapon`], characters: [`殳`] },
  { text: `毋`, names: [`do not`], characters: [`毋`] },
  { text: `比`, names: [`compare`], characters: [`比`] },
  { text: `毛`, names: [`fur`], characters: [`毛`] },
  { text: `氏`, names: [`clan`], characters: [`氏`] },
  { text: `气`, names: [`steam`], characters: [`气`] },
  { text: `水`, names: [`water`], characters: [`水`] },
  { text: `火`, names: [`fire`], characters: [`火`] },
  { text: `爪`, names: [`claw`], characters: [`爪`] },
  { text: `父`, names: [`father`], characters: [`父`] },
  { text: `爻`, names: [`Trigrams`], characters: [`爻`] },
  { text: `爿`, names: [`split wood`], characters: [`爿`] },
  { text: `片`, names: [`slice`], characters: [`片`] },
  { text: `牙`, names: [`fang`], characters: [`牙`] },
  { text: `牛`, names: [`cow`], characters: [`牛`] },
  { text: `犬`, names: [`dog`], characters: [`犬`] },
  { text: `玄`, names: [`profound`], characters: [`玄`] },
  { text: `玉`, names: [`jade`], characters: [`玉`] },
  { text: `瓜`, names: [`melon`], characters: [`瓜`] },
  { text: `瓦`, names: [`tile`], characters: [`瓦`] },
  { text: `甘`, names: [`sweet`], characters: [`甘`] },
  { text: `生`, names: [`life`], characters: [`生`] },
  { text: `用`, names: [`use`], characters: [`用`] },
  { text: `田`, names: [`field`], characters: [`田`] },
  { text: `疋`, names: [`bolt of cloth`], characters: [`疋`] },
  { text: `疒`, names: [`sickness`], characters: [`疒`] },
  { text: `癶`, names: [`footsteps`], characters: [`癶`] },
  { text: `白`, names: [`white`], characters: [`白`] },
  { text: `皮`, names: [`skin`], characters: [`皮`] },
  { text: `皿`, names: [`dish`], characters: [`皿`] },
  { text: `目`, names: [`eye`], characters: [`目`] },
  { text: `矛`, names: [`spear`], characters: [`矛`] },
  { text: `矢`, names: [`arrow`], characters: [`矢`] },
  { text: `石`, names: [`stone`], characters: [`石`] },
  { text: `示`, names: [`spirit`], characters: [`示`] },
  { text: `禸`, names: [`track`], characters: [`禸`] },
  { text: `禾`, names: [`grain`], characters: [`禾`] },
  { text: `穴`, names: [`cave`], characters: [`穴`] },
  { text: `立`, names: [`stand`], characters: [`立`] },
  { text: `竹`, names: [`bamboo`], characters: [`竹`] },
  { text: `米`, names: [`rice`], characters: [`米`] },
  { text: `糸`, names: [`silk`], characters: [`糸`] },
  { text: `缶`, names: [`jar`], characters: [`缶`] },
  { text: `网`, names: [`net`], characters: [`网`] },
  { text: `羊`, names: [`sheep`], characters: [`羊`] },
  { text: `羽`, names: [`feather`], characters: [`羽`] },
  { text: `老`, names: [`old`], characters: [`老`] },
  { text: `而`, names: [`and`], characters: [`而`] },
  { text: `耒`, names: [`plough`], characters: [`耒`] },
  { text: `耳`, names: [`ear`], characters: [`耳`] },
  { text: `聿`, names: [`brush`], characters: [`聿`] },
  { text: `肉`, names: [`meat`], characters: [`肉`] },
  { text: `臣`, names: [`minister`], characters: [`臣`] },
  { text: `自`, names: [`self`], characters: [`自`] },
  { text: `至`, names: [`arrive`], characters: [`至`] },
  { text: `臼`, names: [`mortar`], characters: [`臼`] },
  { text: `舌`, names: [`tongue`], characters: [`舌`] },
  { text: `舛`, names: [`oppose`], characters: [`舛`] },
  { text: `舟`, names: [`boat`], characters: [`舟`] },
  { text: `艮`, names: [`stopping`], characters: [`艮`] },
  { text: `色`, names: [`colour`], characters: [`色`] },
  { text: `艸`, names: [`grass`], characters: [`艸`] },
  { text: `虍`, names: [`tiger`], characters: [`虍`] },
  { text: `虫`, names: [`insect`], characters: [`虫`] },
  { text: `血`, names: [`blood`], characters: [`血`] },
  { text: `行`, names: [`walk enclosure`], characters: [`行`] },
  { text: `衣`, names: [`clothes`], characters: [`衣`] },
  { text: `襾`, names: [`cover`], characters: [`襾`] },
  { text: `見`, names: [`see`], characters: [`見`] },
  { text: `角`, names: [`horn`], characters: [`角`] },
  { text: `言`, names: [`speech`], characters: [`言`] },
  { text: `谷`, names: [`valley`], characters: [`谷`] },
  { text: `豆`, names: [`bean`], characters: [`豆`] },
  { text: `豕`, names: [`pig`], characters: [`豕`] },
  { text: `豸`, names: [`badger`], characters: [`豸`] },
  { text: `貝`, names: [`shell`], characters: [`貝`] },
  { text: `赤`, names: [`red`], characters: [`赤`] },
  { text: `走`, names: [`run`], characters: [`走`] },
  { text: `足`, names: [`foot`], characters: [`足`] },
  { text: `身`, names: [`body`], characters: [`身`] },
  { text: `車`, names: [`cart`], characters: [`車`] },
  { text: `辛`, names: [`bitter`], characters: [`辛`] },
  { text: `辰`, names: [`morning`], characters: [`辰`] },
  { text: `辵`, names: [`walk`], characters: [`辵`] },
  { text: `邑`, names: [`city`], characters: [`邑`] },
  { text: `酉`, names: [`wine`], characters: [`酉`] },
  { text: `釆`, names: [`distinguish`], characters: [`釆`] },
  { text: `里`, names: [`village`], characters: [`里`] },
  { text: `金`, names: [`gold`], characters: [`金`] },
  { text: `長`, names: [`long`], characters: [`長`] },
  { text: `門`, names: [`gate`], characters: [`門`] },
  { text: `阜`, names: [`mound`], characters: [`阜`] },
  { text: `隶`, names: [`slave`], characters: [`隶`] },
  { text: `隹`, names: [`short-tailed bird`], characters: [`隹`] },
  { text: `雨`, names: [`rain`], characters: [`雨`] },
  { text: `靑`, names: [`blue`], characters: [`靑`] },
  { text: `非`, names: [`wrong`], characters: [`非`] },
  { text: `面`, names: [`face`], characters: [`面`] },
  { text: `革`, names: [`leather`], characters: [`革`] },
  { text: `韋`, names: [`tanned leather`], characters: [`韋`] },
  { text: `韭`, names: [`leek`], characters: [`韭`] },
  { text: `音`, names: [`sound`], characters: [`音`] },
  { text: `頁`, names: [`leaf`], characters: [`頁`] },
  { text: `風`, names: [`wind`], characters: [`風`] },
  { text: `飛`, names: [`fly`], characters: [`飛`] },
  { text: `食`, names: [`eat`], characters: [`食`] },
  { text: `首`, names: [`head`], characters: [`首`] },
  { text: `香`, names: [`fragrant`], characters: [`香`] },
  { text: `馬`, names: [`horse`], characters: [`馬`] },
  { text: `骨`, names: [`bone`], characters: [`骨`] },
  { text: `高`, names: [`tall`], characters: [`高`] },
  { text: `髟`, names: [`hair`], characters: [`髟`] },
  { text: `鬥`, names: [`fight`], characters: [`鬥`] },
  { text: `鬯`, names: [`sacrificial wine`], characters: [`鬯`] },
  { text: `鬲`, names: [`cauldron`], characters: [`鬲`] },
  { text: `鬼`, names: [`ghost`], characters: [`鬼`] },
  { text: `魚`, names: [`fish`], characters: [`魚`] },
  { text: `鳥`, names: [`bird`], characters: [`鳥`] },
  { text: `鹵`, names: [`salt`], characters: [`鹵`] },
  { text: `鹿`, names: [`deer`], characters: [`鹿`] },
  { text: `麥`, names: [`wheat`], characters: [`麥`] },
  { text: `麻`, names: [`hemp`], characters: [`麻`] },
  { text: `黃`, names: [`yellow`], characters: [`黃`] },
  { text: `黍`, names: [`millet`], characters: [`黍`] },
  { text: `黑`, names: [`black`], characters: [`黑`] },
  { text: `黹`, names: [`embroidery`], characters: [`黹`] },
  { text: `黽`, names: [`frog`], characters: [`黽`] },
  { text: `鼎`, names: [`tripod`], characters: [`鼎`] },
  { text: `鼓`, names: [`drum`], characters: [`鼓`] },
  { text: `鼠`, names: [`rat`], characters: [`鼠`] },
  { text: `鼻`, names: [`nose`], characters: [`鼻`] },
  { text: `齊`, names: [`even`], characters: [`齊`] },
  { text: `齒`, names: [`tooth`], characters: [`齒`] },
  { text: `龍`, names: [`dragon`], characters: [`龍`] },
  { text: `龜`, names: [`turtle`], characters: [`龜`] },
  { text: `龠`, names: [`flute`], characters: [`龠`] },
];

// Transform data into an easier shape to work with.
export const words = wordData.map(
  ({ text: char, names, pronunciations, mnemonic, characters: radicals }) => {
    const [name, ...altNames] = names;
    invariant(name !== undefined, `expected at least one name`);

    const word: Word = {
      text: char,
      name,
    };

    if (altNames.length > 0) {
      word.nameAlts = altNames;
    }

    if (pronunciations !== undefined && pronunciations.length > 0) {
      word.pronunciations = pronunciations;
    }

    if (mnemonic !== undefined) {
      word.mnemonic = mnemonic;
    }

    if (radicals !== undefined && radicals.length > 0) {
      word.characters = radicals;
    }

    return word;
  },
);

/**
 * Lookup by the word's characters.
 */
export const wordLookupByHanzi: ReadonlyMap<string, Word> = new Map(
  words.map((w) => [w.text, w]),
);

// prettier-ignore
export const hsk1Words = [`爱`,`爱好`,`八`,`爸爸｜爸`,`吧`,`白（形）`,`白天`,`百`,`班`,`半`,`半年`,`半天`,`帮`,`帮忙`,`包`,`包子`,`杯`,`杯子`,`北`,`北边`,`北京`,`本（量）`,`本子`,`比`,`别（副）`,`别的`,`别人`,`病`,`病人`,`不大`,`不对`,`不客气`,`不用`,`不`,`菜`,`茶`,`差`,`常`,`常常`,`唱`,`唱歌`,`车`,`车票`,`车上`,`车站`,`吃`,`吃饭`,`出`,`出来`,`出去`,`穿`,`床`,`次（量）`,`从`,`错`,`打（动）`,`打车`,`打电话`,`打开`,`打球`,`大`,`大学`,`大学生`,`到`,`得到`,`地`,`的`,`等（动）`,`地`,`地点`,`地方`,`地上`,`地图`,`弟弟｜弟`,`第（第二）`,`点`,`电`,`电话`,`电脑`,`电视`,`电视机`,`电影`,`电影院`,`东`,`东边`,`东西`,`动`,`动作`,`都`,`读`,`读书`,`对（形）`,`对不起`,`多（形、代）`,`多少`,`饿`,`儿子`,`二`,`饭`,`饭店`,`房间`,`房子`,`放`,`放假`,`放学`,`飞`,`飞机`,`非常`,`分（名、量）`,`风`,`干`,`干净`,`干`,`干什么`,`高`,`高兴`,`告诉`,`哥哥｜哥`,`歌`,`个`,`给`,`跟`,`工人`,`工作`,`关（动）`,`关上`,`贵`,`国`,`国家`,`国外`,`过`,`还`,`还是`,`还有`,`孩子`,`汉语`,`汉字`,`好（形）`,`好吃`,`好看`,`好听`,`好玩儿`,`号`,`喝`,`和`,`很`,`后`,`后边`,`后天`,`花（名）`,`话`,`坏`,`还`,`回（动）`,`回答`,`回到`,`回家`,`回来`,`回去`,`会（动）`,`火车`,`机场`,`机票`,`鸡蛋`,`几`,`记`,`记得`,`记住`,`家`,`家里`,`家人`,`间`,`见`,`见面`,`教`,`叫（动）`,`教学楼`,`姐姐｜姐`,`介绍`,`今年`,`今天`,`进`,`进来`,`进去`,`九`,`就`,`觉得`,`开`,`开车`,`开会`,`开玩笑`,`看`,`看病`,`看到`,`看见`,`考`,`考试`,`渴`,`课`,`课本`,`课文`,`口`,`块`,`快`,`来`,`来到`,`老（形）`,`老人`,`老师`,`了`,`累`,`冷`,`里`,`里边`,`两（数）`,`零｜〇`,`六`,`楼`,`楼上`,`楼下`,`路`,`路口`,`路上`,`妈妈｜妈`,`马路`,`马上`,`吗`,`买`,`慢`,`忙`,`毛（量）`,`没`,`没关系`,`没什么`,`没事儿`,`没有`,`妹妹｜妹`,`门`,`门口`,`门票`,`们（朋友们）`,`米饭`,`面包`,`面条儿`,`名字`,`明白`,`明年`,`明天`,`拿`,`哪`,`哪里`,`哪儿`,`哪些`,`那（代）`,`那边`,`那里`,`那儿`,`那些`,`奶`,`奶奶`,`男`,`男孩儿`,`男朋友`,`男人`,`男生`,`南`,`南边`,`难`,`呢`,`能`,`你`,`你们`,`年`,`您`,`牛奶`,`女`,`女儿`,`女孩儿`,`女朋友`,`女人`,`女生`,`旁边`,`跑`,`朋友`,`票`,`七`,`起`,`起床`,`起来`,`汽车`,`前`,`前边`,`前天`,`钱`,`钱包`,`请`,`请假`,`请进`,`请问`,`请坐`,`球`,`去`,`去年`,`热`,`人`,`认识`,`认真`,`日`,`日期`,`肉`,`三`,`山`,`商场`,`商店`,`上`,`上班`,`上边`,`上车`,`上次`,`上课`,`上网`,`上午`,`上学`,`少`,`谁`,`身上`,`身体`,`什么`,`生病`,`生气`,`生日`,`十`,`时候`,`时间`,`事`,`试`,`是`,`是不是`,`手`,`手机`,`书`,`书包`,`书店`,`树`,`水`,`水果`,`睡`,`睡觉`,`说`,`说话`,`四`,`送`,`岁`,`他`,`他们`,`她`,`她们`,`太`,`天`,`天气`,`听`,`听到`,`听见`,`听写`,`同学`,`图书馆`,`外`,`外边`,`外国`,`外语`,`玩儿`,`晚`,`晚饭`,`晚上`,`网上`,`网友`,`忘`,`忘记`,`问`,`我`,`我们`,`五`,`午饭`,`西`,`西边`,`洗`,`洗手间`,`喜欢`,`下（名、动）`,`下班`,`下边`,`下车`,`下次`,`下课`,`下午`,`下雨`,`先`,`先生`,`现在`,`想`,`小`,`小孩儿`,`小姐`,`小朋友`,`小时`,`小学`,`小学生`,`笑`,`写`,`谢谢`,`新`,`新年`,`星期`,`星期日`,`星期天`,`行`,`休息`,`学`,`学生`,`学习`,`学校`,`学院`,`要（动）`,`爷爷`,`也`,`页`,`一`,`衣服`,`医生`,`医院`,`一半`,`一会儿`,`一块儿`,`一下儿`,`一样`,`一边`,`一点儿`,`一起`,`一些`,`用`,`有`,`有的`,`有名`,`有时候｜有时`,`有（一）些`,`有用`,`右`,`右边`,`雨`,`元`,`远`,`月`,`再`,`再见`,`在`,`在家`,`早`,`早饭`,`早上`,`怎么`,`站（名）`,`找`,`找到`,`这`,`这边`,`这里`,`这儿`,`这些`,`着`,`真`,`真的`,`正（副）`,`正在`,`知道`,`知识`,`中`,`中国`,`中间`,`中文`,`中午`,`中学`,`中学生`,`重`,`重要`,`住`,`准备`,`桌子`,`字`,`子（桌子）`,`走`,`走路`,`最`,`最好`,`最后`,`昨天`,`左`,`左边`,`坐`,`坐下`,`做`].filter(x => x.length <= 2);
// prettier-ignore
export const hsk2Words = [`啊`,`爱情`,`爱人`,`安静`,`安全`,`白色`,`班长`,`办`,`办法`,`办公室`,`半夜`,`帮助`,`饱`,`报名`,`报纸`,`北方`,`背（动）`,`比如`,`比如说`,`笔`,`笔记`,`笔记本`,`必须`,`边`,`变`,`变成`,`遍`,`表`,`表示`,`不错`,`不但`,`不够`,`不过`,`不太`,`不要`,`不好意思`,`不久`,`不满`,`不如`,`不少`,`不同`,`不行`,`不一定`,`不一会儿`,`部分`,`才（副）`,`菜单`,`参观`,`参加`,`草`,`草地`,`层`,`查`,`差不多`,`长`,`常见`,`常用`,`场`,`超过`,`超市`,`车辆`,`称¹（动）`,`成（动）`,`成绩`,`成为`,`重复`,`重新`,`出发`,`出国`,`出口（名）`,`出门`,`出生`,`出现`,`出院`,`出租`,`出租车`,`船`,`吹`,`春节`,`春天`,`词`,`词典`,`词语`,`从小`,`答应`,`打工`,`打算`,`打印`,`大部分`,`大大`,`大多数`,`大海`,`大家`,`大量`,`大门`,`大人`,`大声`,`大小`,`大衣`,`大自然`,`带`,`带来`,`单位`,`但`,`但是`,`蛋`,`当`,`当时`,`倒`,`到处`,`倒`,`道`,`道理`,`道路`,`得`,`得出`,`的话`,`得`,`灯`,`等（助、名）`,`等到`,`等于`,`低`,`地球`,`地铁`,`地铁站`,`点头`,`店`,`掉`,`东北`,`东方`,`东南`,`冬天`,`懂`,`懂得`,`动物`,`动物园`,`读音`,`度`,`短`,`短信`,`段`,`队`,`队长`,`对（介、动）`,`对话`,`对面`,`多（副）`,`多久`,`多么`,`多数`,`多云`,`而且`,`发`,`发现`,`饭馆`,`方便`,`方便面`,`方法`,`方面`,`方向`,`放下`,`放心`,`分（动）`,`分开`,`分数`,`分钟`,`份`,`封（量）`,`服务`,`复习`,`该（动）`,`改`,`改变`,`干杯`,`感到`,`感动`,`感觉`,`感谢`,`干活儿`,`刚`,`刚才`,`刚刚`,`高级`,`高中`,`个子`,`更`,`公共汽车`,`公交车`,`公斤`,`公里`,`公路`,`公平`,`公司`,`公园`,`狗`,`够`,`故事`,`故意`,`顾客`,`关机`,`关心`,`观点`,`广场`,`广告`,`国际`,`过来`,`过年`,`过去（动）`,`过`,`海`,`海边`,`喊`,`好（副）`,`好处`,`好多`,`好久`,`好人`,`好事`,`好像`,`合适`,`河`,`黑`,`黑板`,`黑色`,`红`,`红色`,`后来`,`忽然`,`湖`,`护照`,`花（动）`,`花园`,`画`,`画家`,`画儿`,`坏处`,`坏人`,`欢迎`,`换`,`黄`,`黄色`,`回（量）`,`回国`,`会（名）`,`活动`,`或`,`或者`,`机会`,`鸡`,`级`,`急`,`计划`,`计算机`,`加`,`加油`,`家（科学家）`,`家庭`,`家长`,`假`,`假期`,`检查`,`见到`,`见过`,`件`,`健康`,`讲`,`讲话`,`交`,`交给`,`交朋友`,`交通`,`角`,`角度`,`饺子`,`脚`,`叫作`,`教师`,`教室`,`教学`,`教育`,`接`,`接到`,`接受`,`接下来`,`接着`,`街`,`节（名、量）`,`节目`,`节日`,`结果`,`借`,`斤`,`今后`,`进入`,`进行`,`近`,`经常`,`经过`,`经理`,`酒`,`酒店`,`就要`,`举`,`举手`,`举行`,`句`,`句子`,`卡`,`开机`,`开心`,`开学`,`看法`,`考生`,`靠`,`科`,`科学`,`可爱`,`可能`,`可怕`,`可是`,`可以`,`克`,`刻（量）`,`客人`,`课堂`,`空气`,`哭`,`快餐`,`快点儿`,`快乐`,`快要`,`筷子`,`拉`,`来自`,`蓝`,`蓝色`,`篮球`,`老（副）`,`老（老王）`,`老年`,`老朋友`,`老是`,`离`,`离开`,`礼物`,`里头`,`理想`,`例如`,`例子`,`脸`,`练`,`练习`,`凉`,`凉快`,`两（量）`,`亮`,`辆`,`零下`,`留`,`留下`,`留学生`,`流`,`流利`,`流行`,`路边`,`旅客`,`旅行`,`旅游`,`绿`,`绿色`,`卖`,`满`,`满意`,`猫`,`米（量）`,`面¹（名、量）`,`面²（名）`,`面前`,`名`,`名称`,`名单`,`明星`,`目的`,`拿出`,`拿到`,`那（连）`,`那会儿`,`那么`,`那时候｜那时`,`那样`,`南方`,`难过`,`难看`,`难受`,`难题`,`难听`,`能够`,`年级`,`年轻`,`鸟`,`弄`,`努力`,`爬`,`爬山`,`怕（动）`,`排（名、量）`,`排队`,`排球`,`碰`,`碰到`,`碰见`,`篇`,`便宜`,`片`,`漂亮`,`平`,`平安`,`平常`,`平等`,`平时`,`瓶`,`瓶子`,`普通`,`普通话`,`其他`,`其中`,`骑`,`骑车`,`起飞`,`气`,`气温`,`千`,`千克`,`前年`,`墙`,`青年`,`青少年`,`轻`,`清楚`,`晴`,`晴天`,`请客`,`请求`,`秋天`,`求`,`球场`,`球队`,`球鞋`,`取`,`取得`,`全`,`全部`,`全国`,`全家`,`全年`,`全身`,`全体`,`然后`,`让`,`热情`,`人口`,`人们`,`人数`,`认为`,`日报`,`日子`,`如果`,`入口`,`商量`,`商人`,`上周`,`少数`,`少年`,`身边`,`什么样`,`生（动）`,`生词`,`生活`,`声音`,`省（名）`,`省（动）`,`十分`,`实际`,`实习`,`实现`,`实在`,`实在`,`食物`,`使用`,`市`,`市长`,`事情`,`收`,`收到`,`收入`,`手表`,`受到`,`舒服`,`熟`,`数`,`数字`,`水平`,`顺利`,`说明`,`司机`,`送到`,`送给`,`算`,`虽然`,`随便`,`随时`,`所以`,`所有`,`它`,`它们`,`太太`,`太阳`,`态度`,`讨论`,`套`,`特别`,`特点`,`疼`,`提`,`提出`,`提到`,`提高`,`题`,`体育`,`体育场`,`体育馆`,`天上`,`条`,`条件`,`听讲`,`听说`,`停`,`停车`,`停车场`,`挺（副）`,`挺好`,`通`,`通过`,`通知`,`同时`,`同事`,`同样`,`头（名、量）`,`头（里头）`,`头发`,`图片`,`推`,`腿`,`外地`,`外卖`,`完`,`完成`,`完全`,`晚安`,`晚报`,`晚餐`,`晚会`,`碗`,`万`,`网`,`网球`,`网站`,`往`,`为`,`为什么`,`位`,`味道`,`喂（叹）`,`温度`,`闻`,`问路`,`问题`,`午餐`,`午睡`,`西北`,`西餐`,`西方`,`西南`,`西医`,`习惯`,`洗衣机`,`洗澡`,`下（量）`,`下雪`,`下周`,`夏天`,`相同`,`相信`,`响`,`想到`,`想法`,`想起`,`向`,`相机`,`像（动）`,`小（小王）`,`小声`,`小时候`,`小说`,`小心`,`小组`,`校园`,`校长`,`笑话`,`笑话儿`,`鞋`,`心里`,`心情`,`心中`,`新闻`,`信（名）`,`信号`,`信息`,`信心`,`信用卡`,`星星`,`行动`,`行人`,`行为`,`姓`,`姓名`,`休假`,`许多`,`选`,`学期`,`雪`,`颜色`,`眼`,`眼睛`,`养`,`样子`,`要求`,`药`,`药店`,`药片`,`药水`,`也许`,`夜`,`夜里`,`一部分`,`一定`,`一共`,`一会儿（副）`,`一路平安`,`一路顺风`,`已经`,`以后`,`以前`,`以上`,`以外`,`以为`,`以下`,`椅子`,`一般`,`一点点`,`一生`,`一直`,`亿`,`意见`,`意思`,`因为`,`阴`,`阴天`,`音节`,`音乐`,`音乐会`,`银行`,`银行卡`,`应该`,`英文`,`英语`,`影片`,`影响`,`永远`,`油`,`游客`,`友好`,`有空儿`,`有人`,`有（一）点儿`,`有意思`,`又`,`鱼`,`语言`,`原来`,`原因`,`院`,`院长`,`院子`,`愿意`,`月份`,`月亮`,`越`,`越来越`,`云`,`运动`,`咱`,`咱们`,`脏`,`早餐`,`早晨`,`早就`,`怎么办`,`怎么样`,`怎样`,`占`,`站（动）`,`站住`,`长`,`长大`,`找出`,`照顾`,`照片`,`照相`,`这么`,`这时候｜这时`,`这样`,`真正`,`正常`,`正好`,`正确`,`正是`,`直接`,`只`,`只能`,`只要`,`纸`,`中餐`,`中级`,`中年`,`中小学`,`中心`,`中医`,`重点`,`重视`,`周`,`周末`,`周年`,`主人`,`主要`,`住房`,`住院`,`装`,`准确`,`自己`,`自行车`,`自由`,`字典`,`走过`,`走进`,`走开`,`租`,`组`,`组成`,`组长`,`嘴`,`最近`,`作家`,`作文`,`作业`,`作用`,`座`,`座位`,`做到`,`做法`,`做饭`].filter(x => x.length <= 2);
// prettier-ignore
export const hsk3Words = [`爱心`,`安排`,`安装`,`按`,`按照`,`把（介）`,`把（量）`,`把握`,`白（副）`,`白菜`,`班级`,`搬`,`搬家`,`板`,`办理`,`保`,`保安`,`保持`,`保存`,`保护`,`保留`,`保险`,`保证`,`报（名）`,`报到`,`报道`,`报告`,`背`,`北部`,`背（名）`,`背后`,`被`,`被子`,`本来`,`本领`,`本事`,`比较`,`比例`,`比赛`,`必然`,`必要`,`变化`,`变为`,`标题`,`标准`,`表达`,`表格`,`表面`,`表明`,`表现`,`表演`,`并（副、连）`,`并且`,`播出`,`播放`,`不必`,`不断`,`不论`,`补`,`补充`,`不安`,`不得不`,`不光`,`不仅`,`布`,`步`,`部`,`部门`,`部长`,`才能`,`采取`,`采用`,`彩色`,`曾经`,`产生`,`长城`,`长处`,`长期`,`厂`,`场合`,`场所`,`超级`,`朝`,`吵`,`吵架`,`衬衫`,`衬衣`,`称为`,`成功`,`成果`,`成就`,`成立`,`成熟`,`成员`,`成长`,`城`,`城市`,`程度`,`持续`,`充满`,`重`,`初`,`初（初一）`,`初步`,`初级`,`初中`,`除了`,`处理`,`传`,`传播`,`传来`,`传说`,`创新`,`创业`,`创造`,`创作`,`从来`,`从前`,`从事`,`村`,`存`,`存在`,`错误`,`达到`,`打破`,`打听`,`大概`,`大使馆`,`大约`,`大夫`,`代`,`代表`,`代表团`,`带动`,`带领`,`单元`,`当初`,`当地`,`当然`,`当中`,`刀`,`导演`,`到达`,`到底`,`得分`,`等待`,`底下`,`地区`,`电视剧`,`电视台`,`电台`,`电子邮件`,`调`,`调查`,`订`,`定期`,`东部`,`动力`,`动人`,`读者`,`短处`,`短裤`,`短期`,`断`,`队员`,`对待`,`对方`,`对手`,`对象`,`顿`,`发表`,`发出`,`发达`,`发动`,`发明`,`发生`,`发送`,`发言`,`发展`,`反对`,`反复`,`反应`,`反正`,`范围`,`方式`,`防`,`防止`,`房东`,`房屋`,`房租`,`访问`,`放到`,`飞行`,`费`,`费用`,`分别`,`分配`,`分组`,`丰富`,`风险`,`否定`,`否认`,`服装`,`福`,`父母`,`父亲`,`付`,`负责`,`复印`,`复杂`,`富`,`改进`,`改造`,`概念`,`赶`,`赶到`,`赶紧`,`赶快`,`敢`,`感冒`,`感情`,`感受`,`干吗`,`高速`,`高速公路`,`告别`,`歌迷`,`歌声`,`歌手`,`个人`,`个性`,`各`,`各地`,`各位`,`各种`,`各自`,`根本`,`更加`,`工厂`,`工程师`,`工夫`,`工具`,`工业`,`工资`,`公布`,`公共`,`公开`,`公民`,`公务员`,`功夫`,`功课`,`功能`,`共同`,`共有`,`姑娘`,`古`,`古代`,`故乡`,`挂`,`关系`,`关注`,`观察`,`观看`,`观念`,`观众`,`管`,`管理`,`光`,`光明`,`广播`,`广大`,`规定`,`规范`,`国内`,`国庆`,`果然`,`果汁`,`过程`,`过去（名）`,`哈哈`,`海关`,`害怕`,`行`,`好好`,`好奇`,`合`,`合法`,`合格`,`合理`,`合作`,`和平`,`红茶`,`红酒`,`后果`,`后面`,`后年`,`互联网`,`互相`,`划船`,`华人`,`化（现代化）`,`话剧`,`话题`,`欢乐`,`环`,`环保`,`环境`,`会议`,`会员`,`活`,`火（名）`,`机器`,`积极`,`基本`,`基本上`,`基础`,`及时`,`…极了`,`集体`,`集中`,`计算`,`记录`,`记者`,`纪录`,`纪念`,`技术`,`继续`,`加工`,`加快`,`加强`,`家具`,`家属`,`家乡`,`价格`,`价钱`,`价值`,`架`,`坚持`,`坚决`,`坚强`,`简单`,`简直`,`建`,`建成`,`建立`,`建设`,`建议`,`将近`,`将来`,`交费`,`交警`,`交流`,`交往`,`交易`,`叫（介）`,`较`,`教材`,`教练`,`结实`,`接待`,`接近`,`节约`,`结合`,`结婚`,`结束`,`解决`,`解开`,`金`,`金牌`,`仅`,`仅仅`,`尽量`,`紧`,`紧急`,`紧张`,`进步`,`进一步`,`进展`,`近期`,`京剧`,`经济`,`经历`,`经验`,`经营`,`精彩`,`精神`,`精神`,`景色`,`警察`,`静`,`久`,`旧`,`救`,`就是`,`就业`,`举办`,`具体`,`具有`,`剧场`,`据说`,`决定`,`决赛`,`决心`,`绝对`,`咖啡`,`开发`,`开放`,`开始`,`开业`,`开展`,`看起来`,`看上去`,`考验`,`科技`,`可靠`,`可乐`,`克服`,`客观`,`课程`,`空`,`空调`,`恐怕`,`空儿`,`裤子`,`快速`,`困`,`困难`,`浪费`,`老百姓`,`老板`,`老太太`,`老头儿`,`乐`,`乐观`,`类`,`类似`,`离婚`,`里面`,`理发`,`理解`,`理论`,`理由`,`力`,`力量`,`立刻`,`利用`,`连`,`连忙`,`连续`,`连续剧`,`联合`,`联合国`,`联系`,`凉水`,`了`,`领`,`领导`,`领先`,`另外`,`另一方面`,`留学`,`龙`,`录`,`录音`,`路线`,`旅馆`,`旅行社`,`绿茶`,`乱`,`落后`,`麻烦`,`马`,`满足`,`慢慢`,`毛（名）`,`毛病`,`没用`,`媒体`,`每`,`美`,`美好`,`美丽`,`美食`,`美术`,`美元`,`迷`,`米（名）`,`面对`,`面积`,`民间`,`民族`,`明确`,`明显`,`命运`,`某`,`母亲`,`木头`,`目标`,`目前`,`奶茶`,`男子`,`南部`,`难道`,`难度`,`内`,`内容`,`内心`,`能不能`,`能力`,`年初`,`年代`,`年底`,`年纪`,`念`,`牛（名）`,`农村`,`农民`,`农业`,`女子`,`暖和`,`怕（副）`,`拍`,`排（动）`,`排名`,`牌子`,`派`,`判断`,`胖`,`跑步`,`配`,`配合`,`批评`,`批准`,`皮`,`皮包`,`啤酒`,`票价`,`评价`,`苹果`,`破`,`破坏`,`普遍`,`普及`,`期`,`齐`,`其次`,`其实`,`奇怪`,`气候`,`千万`,`前后`,`前进`,`前面`,`前往`,`强`,`强大`,`强调`,`强烈`,`桥`,`巧`,`亲`,`亲切`,`亲人`,`亲自`,`情感`,`情况`,`请教`,`庆祝`,`球迷`,`区`,`区别`,`取消`,`去世`,`全场`,`全面`,`全球`,`缺`,`缺点`,`缺少`,`确保`,`确定`,`确实`,`裙子`,`群`,`热爱`,`热烈`,`人才`,`人工`,`人类`,`人民`,`人民币`,`人群`,`人生`,`人员`,`认出`,`认得`,`认可`,`任（动）`,`任（连）`,`任何`,`任务`,`仍`,`仍然`,`日常`,`容易`,`如何`,`散步`,`沙发`,`沙子`,`伤`,`伤心`,`商品`,`商业`,`上来`,`上面`,`上去`,`上升`,`上衣`,`设备`,`设计`,`设立`,`社会`,`身份证`,`深`,`深刻`,`深入`,`升`,`生（形）`,`生产`,`生存`,`生动`,`生命`,`生意`,`生长`,`声明`,`胜`,`胜利`,`失去`,`石头`,`石油`,`时`,`时代`,`时刻`,`实际上`,`实力`,`实行`,`实验`,`实验室`,`食品`,`使`,`始终`,`世纪`,`世界`,`世界杯`,`市场`,`事故`,`事件`,`事实`,`事实上`,`事业`,`试题`,`试验`,`适合`,`适应`,`适用`,`室`,`收费`,`收看`,`收听`,`收音机`,`手续`,`手指`,`首都`,`首先`,`受`,`受伤`,`书架`,`输`,`输入`,`熟人`,`属`,`属于`,`束`,`数量`,`双`,`双方`,`思想`,`死`,`速度`,`随`,`所（名、量）`,`所长`,`台`,`谈`,`谈话`,`谈判`,`汤`,`糖`,`特色`,`提前`,`提问`,`题目`,`体会`,`体现`,`体验`,`天空`,`甜`,`调`,`调整`,`跳`,`跳高`,`跳舞`,`跳远`,`铁`,`铁路`,`听力`,`听众`,`停止`,`通常`,`通信`,`同意`,`痛（形）`,`痛苦`,`头（形）`,`头脑`,`突出`,`突然`,`图`,`图画`,`土（名）`,`团`,`团结`,`团体`,`推动`,`推广`,`推进`,`推开`,`退`,`退出`,`退休`,`外交`,`外面`,`外文`,`完美`,`完善`,`完整`,`玩具`,`往往`,`危害`,`危险`,`为（动）`,`为（介）`,`围`,`伟大`,`卫生`,`卫生间`,`为了`,`温暖`,`文化`,`文件`,`文明`,`文学`,`文章`,`文字`,`握手`,`屋子`,`武器`,`武术`,`舞台`,`西部`,`希望`,`系`,`下来`,`下面`,`下去`,`先进`,`显得`,`显然`,`显示`,`现场`,`现代`,`现金`,`现实`,`现象`,`线`,`相比`,`相当`,`相关`,`相互`,`相似`,`香`,`香蕉`,`消费`,`消失`,`消息`,`效果`,`写作`,`血`,`心`,`信（动）`,`信封`,`信任`,`行李`,`形成`,`形式`,`形象`,`形状`,`幸福`,`幸运`,`性（积极性）`,`性别`,`性格`,`修`,`修改`,`需求`,`需要`,`宣布`,`宣传`,`选手`,`学费`,`训练`,`压`,`压力`,`烟`,`眼前`,`演`,`演唱`,`演唱会`,`演出`,`演员`,`羊`,`阳光`,`要是`,`衣架`,`一切`,`已`,`以来`,`一方面`,`艺术`,`意外`,`意义`,`因此`,`银`,`银牌`,`印象`,`应当`,`迎接`,`营养`,`赢`,`影视`,`应用`,`优点`,`优势`,`由`,`由于`,`邮件`,`邮票`,`邮箱`,`游`,`游戏`,`游泳`,`有的是`,`有利`,`有效`,`预报`,`预防`,`预计`,`预习`,`员（服务员）`,`员工`,`愿望`,`约`,`乐队`,`运输`,`杂志`,`早已`,`造`,`造成`,`责任`,`增加`,`增长`,`展开`,`张`,`照`,`者（志愿者）`,`真实`,`争`,`争取`,`整`,`整个`,`整理`,`整齐`,`整体`,`整天`,`整整`,`正（形）`,`正式`,`证`,`证件`,`证据`,`证明`,`支（量）`,`支持`,`支付`,`只`,`直`,`直播`,`直到`,`值`,`值得`,`职工`,`职业`,`只好`,`只是`,`只有`,`指`,`指出`,`指导`,`至今`,`至少`,`志愿`,`志愿者`,`制定`,`制度`,`制造`,`制作`,`中部`,`中华民族`,`终于`,`钟`,`种`,`种子`,`重大`,`周围`,`猪`,`主持`,`主动`,`主任`,`主意`,`主张`,`注意`,`祝`,`抓`,`抓住`,`专家`,`专门`,`专题`,`专业`,`转`,`转变`,`状况`,`状态`,`追`,`准`,`资格`,`资金`,`子女`,`自从`,`自动`,`自觉`,`自然`,`自身`,`自主`,`总`,`总结`,`总是`,`足够`,`足球`,`组合`,`左右`,`作品`,`作者`,`做客`].filter(x => x.length <= 2);
